[
	{
		"source": {
			"id": null,
			"name": "Moneycontrol"
		},
		"author": "Avishek Banerjee",
		"title": "Maruti Suzuki to realign its strategies laying greater focus on SUVs across segments - Moneycontrol",
		"description": "<ol><li>Maruti Suzuki to realign its strategies laying greater focus on SUVs across segments  Moneycontrol\r\n</li><li>Maruti Suzuki stock rises by 46% from 1-year lows thanks to strong Q2. Should you buy? | Mint  Mint\r\n</li><li>Maruti Suzuki To Launch More CNG…",
		"url": "https://www.moneycontrol.com/news/business/maruti-suzuki-to-realign-its-strategies-laying-greater-focus-on-suvs-across-segments-9407821.html",
		"urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/Maruti3-694x435.png",
		"publishedAt": 1667107440000,
		"content": "                Volumes in the entry-level car segment are slipping as prices have surged on regulatory requirements around safety and emissions, and higher cost of inputs.      \n                                                      October 30, 2022 / 10:54 AM IST                                                        \n               Maruti Suzuki India (File image)          With the hatchbacks, especially in the entry-level segment, seeing lukewarm sales this financial year compared to the pre-COVID times, Maruti Suzuki India Limited (MSIL) affirmed that going forward it will be sharpening its focus on Sports Utility Vehicles (SUVs) across segments than towards small cars run on internal combustion engines (ICE). Besides, it will launch the Compressed Natural Gas (CNG) variants of some of the existing petrol-driven models.“In the second quarter (of this FY), hatchbacks have shown growth, but that is limited to the festival season. I don’t see this segment’s growth continuing subsequent to this quarter and early next year. This simply means the ability of people, whether in urban or rural areas, to buy hatchbacks has eroded. By next year, there will be a degrowth in the hatchback segment,” R.C. Bhargava, Chairman, MSIL, said post Q2 FY2022-23 results announcement.The country’s largest passenger vehicle-maker stated that sales of entry-level cars will continue to degrow as consumers’ disposable income has reduced due to higher prices and inflationary pressures. However, it must be mentioned that this phenomenon does not seem to have adversely impacted the spending power of buyers who are aiming at SUVs.Its overall market share, which was at 51 per cent in FY2019, has gone down to 41 per cent during this September quarter.“The small car segment has been declining (since FY2018-19) and has lost around 26-28 percent of numbers during this period,” added Bhargava.Maruti Suzuki also acknowledged that volumes in the entry-level car segment are declining as prices have surged due to regulatory requirements around safety and emissions and higher cost of inputs. When asked how the company is planning to re-engineer its small cars in order to comply with safety norms, he maintained that the auto industry body has been discussing this matter with the government.“The industry is taking up this question as to what would be a realistic date of not only implementation of six airbags, but also of installing the three-point seat belts at the rear seats,” stated the chairman of MSIL.Meanwhile, MSIL on Friday reported a rise of 334 percent year-on-year (YoY) in standalone net profit at Rs 2,061 crore in Q2 FY23 on the back of record volumes of its newly-launched SUVs, Grand Vitara, and Brezza, during the quarter.“Compared to the earlier composition, there will be a higher percentage of sales in the upper end of the market compared to the lower end and we will be adapting our product portfolio accordingly,” added Bhargava. However, he didn’t share what kind of models will be introduced. He was also categorical that MSIL had no plans to phase out any small cars from its product portfolio.MSIL has garnered 75,000 units of confirmed bookings for the Grand Vitara, of which a little over a third (25,500 units) is from strong hybrid variants. So, out of pending orders of 60,000 units, 20,100 units is for the strong hybrid variant (about 34 percent).“Aggressive product strategy and heightened focus on the SUV segment will undoubtedly help Maruti Suzuki make a strong comeback and regain its lost market share. We have seen in the past too, its ability to understand the market and consumers is unparalleled, and the company has always bounced back with more power and emerged as a winner,” said Puneet Gupta of S&P Automotive.MSIL, meanwhile, has not given up on the challenge of hitting the two-million sales mark.“The major determinant of our ability to succeed is semiconductor availability. There is a constraint of semiconductors, fundamentally from one company. And that is affecting four of our models,\" revealed Bhargava.Bhargava did not concur with the industry perception that Maruti Suzuki is late in foraying into the electric passenger vehicle segment (slated for 2025 roll-out).\"We are localizing the components, looking at the infrastructure development in the country. An electric vehicle customer should not face issues,\" he said.\n     \n         \n                \n     \n\n                            ",
		"isFull": true,
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "STLtoday.com"
		},
		"author": "By DAMIAN J. TROISE The Associated Press",
		"title": "Energy stocks get oil price support as recession looms",
		"description": "Surging oil prices charged energy stocks through 2022 and could keep supporting the sector despite a looming recession and stubbornly hot inflation squeezing consumers.",
		"url": "https://www.stltoday.com/business/energy-stocks-get-oil-price-support-as-recession-looms/article_a1ec9f95-1761-5312-a89f-a9947828d91c.html",
		"urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/3/6b/36b3c604-3915-500a-8dae-853b6291c315/635abe01eb7ec.image.jpg?crop=1846%2C969%2C0%2C76&resize=1200%2C630&order=crop%2Cresize",
		"publishedAt": 1667106900000,
		"content": "By DAMIAN J. TROISE\r\nThe Associated Press\r\nNEW YORK Surging oil prices charged energy stocks through 2022 and could keep supporting the sector despite a looming recession and stubbornly hot inflation… [+2406 chars]",
		"titleScore": -1,
		"titleMarketGrams": "Energy stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Wolf Report",
		"title": "My Current Favorite Stocks To Buy",
		"description": "It's no secret that the market we're in is rife with undervaluation. There are plenty of buying opportunities. Find out opportunities on an international basis.",
		"url": "https://seekingalpha.com/article/4550807-my-current-favorite-stocks-to-buy",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1347345879/image_1347345879.jpg?io=getty-c-w750",
		"publishedAt": 1667104092000,
		"content": "Author's Note: This article was published on iREIT on Alpha in early October of 2022.\r\nismagilov\r\nDear readers,\r\n In this article, I'm going to be looking at perhaps one of the more important questio… [+14353 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Ozbargain.com.au"
		},
		"author": "Nuclearvodka",
		"title": "Discovervin - 12 bottles for $100 - SPECIAL - CARTON PRICES FINAL CLOSING DOWN SALE!",
		"description": "DiscoverVin is closing down (sadly) and there's still a few clearance cases to be bought.\nI am from Pau in the French pyrenees, and Jurancon is (IMHO) the most underrated dessert wine ever.\n\nJurançon is a wine region in South West France in the foothills of t…",
		"url": "https://www.ozbargain.com.au/node/733586",
		"urlToImage": "https://files.ozbargain.com.au/n/86/733586x.jpg?h=41652da8",
		"publishedAt": 1667102288000,
		"content": "DiscoverVin is closing down (sadly) and there's still a few clearance cases to be bought.I am from Pau in the French pyrenees, and Jurancon is (IMHO) the most underrated dessert wine ever.\r\nJurançon … [+836 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Survivalblog.com"
		},
		"author": "James Wesley Rawles",
		"title": "Economics & Investing For Preppers",
		"description": "Here are the latest news items and commentary on current economics news, market trends, stocks, investing opportunities, and the precious metals markets. We also cover hedges, derivatives, and obscura. Most of these items are from the “tangibles heavy” contra…",
		"url": "https://survivalblog.com/2022/10/31/mon-oct-31-ni/",
		"urlToImage": "https://survivalblog.com/wp-content/uploads/2022/10/Diesel_Locomotive_Train.jpg",
		"publishedAt": 1667088689000,
		"content": "Here are the latest news items and commentary on current economics news, market trends, stocks, investing opportunities, and the precious metals markets. We also cover hedges, derivatives, and obscur… [+3063 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Cryptocynews.com"
		},
		"author": "Jay Howell",
		"title": "Pioneer Markets Review – Is Pioneer Markets Scam or a Legit Crypto Broker?",
		"description": "Pioneer Markets Review Pioneer Markets is one of the most recent and popular brokerage platforms that has been gaining traction in the online trading market. Pioneer Markets is a safe and legal platform for trading stocks and crypto. They have been evolving t…",
		"url": "https://www.cryptocynews.com/pioneer-markets/",
		"urlToImage": "https://www.cryptocynews.com/wp-content/uploads/2022/09/shutterstock_2098588699.jpg",
		"publishedAt": 1667081928000,
		"content": "Summary\r\nPioneer Markets is a broker for trading online through a quality and user friend online trading platform. You can read our Pioneer Markets review today to learn all about them. We have given… [+4674 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bizpoke",
		"title": "Wall St Week Ahead Hopeful U.S. stock rally set for date with Federal Reserve reality",
		"description": "The bounce in U.S. stocks that has defied a barrage of major earnings disappointments faces a key test. The Federal Reserve's next meeting could shed light on how long it will stick to the... #federalreserve #earningsdisappointments #bounce #msfto #undertakin…",
		"url": "https://biztoc.com/p/q5x9p84h?ref=rss",
		"urlToImage": "https://cdn.biztoc.com/og/q5x9p84h.jpg",
		"publishedAt": 1667077183000,
		"content": "The bounce in U.S. stocks that has defied a barrage of major earnings disappointments faces a key test. The Federal Reserve's next meeting could shed light on how long it will stick to the aggressive… [+1258 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Ahead Hopeful U.S. stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool Australia"
		},
		"author": "Tony Yoo",
		"title": "3 reasons ASX growth shares will make a roaring comeback: experts",
		"description": "One group of analysts believe the dominance of value stocks in 2022 will be short-lived. This is why.\nThe post 3 reasons ASX growth shares will make a roaring comeback: experts appeared first on The Motley Fool Australia.",
		"url": "https://www.fool.com.au/2022/10/30/3-reasons-asx-growth-shares-will-make-a-roaring-comeback-experts/",
		"urlToImage": "https://www.fool.com.au/wp-content/uploads/2021/09/GettyImages-1064761830-1.jpg",
		"publishedAt": 1667075400000,
		"content": "ASX growth shares made many investors wealthy for more than a decade until late last year.\r\nBut since late last year when inflation and interest rate fears gripped the market, they have been absolute… [+3988 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "VOA News"
		},
		"author": "webdesk@voanews.com (Associated Press)",
		"title": "US Fishermen Face Shutdowns as Warming Hurts Species",
		"description": "Fishing regulators and the seafood industry are grappling with the possibility that some once-profitable species that have declined with climate change might not come back.\n\n\nSeveral marketable species harvested by U.S. fishermen are the subject of quota cuts…",
		"url": "https://www.voanews.com/a/us-fishermen-face-shutdowns-as-warming-hurts-species/6809177.html",
		"urlToImage": "https://gdb.voanews.com/80470000-c0a8-0242-287e-08dab8a87ebf_cx0_cy6_cw0_w1200_r1.jpg",
		"publishedAt": 1667072378000,
		"content": "Fishing regulators and the seafood industry are grappling with the possibility that some once-profitable species that have declined with climate change might not come back.\r\nSeveral marketable specie… [+6673 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "toby",
		"title": "Will plunging shares end big tech’s era of ‘pornographic’ profits?",
		"description": "The five biggest tech stocks crashed by a combined $950bn (£820m) at their lowest point. Meta (formerly Facebook), Alphabet (formerly Google) and Microsoft saw billions wiped off their values.... #facebook #jimcramer #jeffbezos #google #meta #forbes #earnings…",
		"url": "https://biztoc.com/p/8dsxktc2?ref=rss",
		"urlToImage": "https://cdn.biztoc.com/og/8dsxktc2.jpg",
		"publishedAt": 1667068184000,
		"content": "The five biggest tech stocks crashed by a combined $950bn (£820m) at their lowest point. Meta (formerly Facebook), Alphabet (formerly Google) and Microsoft saw billions wiped off their values. Invest… [+1356 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "fortune",
			"name": "Fortune"
		},
		"author": "Adam Beam, The Associated Press",
		"title": "The plunging stock market is taking a bite out of California's wealthy—and the Golden State's ability to pay for things",
		"description": "Under California's progressive tax system, the top 1% pays almost half of the state's income taxes. That's bad when stocks are falling.",
		"url": "https://fortune.com/2022/10/29/california-tax-revenues-decline-plunging-stock-market-tech-economy-markets/",
		"urlToImage": "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-962142720.jpg?resize=1200,600",
		"publishedAt": 1667063647000,
		"content": "The good times might soon be over for Californias government.The nations most populous state has had so much cash lately that lawmakers have spent freely handing out free health care to low-income im… [+5880 chars]",
		"titleScore": 1,
		"titleMarketGrams": "The plunging stock \n The plunging stock market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "The Dow soars, Big Tech tumbles: What's next for stocks as investors await Fed guidance - MarketWatch",
		"description": "The Dow soars, Big Tech tumbles: What's next for stocks as investors await Fed guidanceMarketWatch Dow surges more than 800 points on the back of record oil profitsCNN S&P 500 Forecast: Gives Up Early Gain as Mood Turned SourDailyForex.com Stocks Drop On Disa…",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=167250089",
		"urlToImage": null,
		"publishedAt": 1667062404000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": 0,
		"titleMarketGrams": "What's next for stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Chris Hill, Ron Gross, Dan Boyd, and Emily Flippen)",
		"title": "Company Report Roundup: Tesla, Tractor Supply, American Express, and More",
		"description": "Plus a look at investing books, stocks to watch, and other topics for investors.",
		"url": "https://www.fool.com/investing/2022/10/29/company-report-roundup-tesla-tractor-supply-americ/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/705832/mfm_20221021.jpg",
		"publishedAt": 1667057640000,
		"content": "In this podcast, Motley Fool senior analysts Emily Flippen and Ron Gross discuss topics including:\r\n<ul><li>Pinterest, Meta Platforms, and Alphabet getting dragged down by Snap's bad news</li><li>Ame… [+40713 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "kendo",
		"title": ": Technology stocks tumble",
		"description": "Many of the largest technology companies have fared worse than the S&P 500 during this year’s broad bear market. So how can you know when such a large decline for a tech stock has gone too far?... #amazon #cnnopinion #metaplatforms #markhulbert #google #faang…",
		"url": "https://biztoc.com/p/bc5ceamg?ref=rss",
		"urlToImage": "https://cdn.biztoc.com/og/bc5ceamg.jpg",
		"publishedAt": 1667056383000,
		"content": "Many of the largest technology companies have fared worse than the S&amp;P 500 during this years broad bear market. So how can you know when such a large decline for a tech stock has gone too far? Wh… [+1207 chars]",
		"titleScore": 0,
		"titleMarketGrams": ": Technology stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Ritholtz.com"
		},
		"author": "Barry Ritholtz",
		"title": "MiB: The Jeremies! Schwartz and Siegel on SFTLR!",
		"description": "﻿   This week, we speak with The Jeremies! Professor Jeremy Siegel at the University of Pennsylvania, where he is frequently voted Best professor at Wharton, and is the author of Stocks for the Long Run, Jeremy Schwartz is CIO at Wisdom Tree Asset Management,…",
		"url": "https://ritholtz.com/2022/10/mib-the-jeremies/",
		"urlToImage": "https://ritholtz.com/wp-content/uploads/2021/01/MIB-.png",
		"publishedAt": 1667052946000,
		"content": "This week, we speak with The Jeremies! Professor Jeremy Siegel at the University of Pennsylvania, where he is frequently voted Best professor at Wharton, and is the author of Stocks for the Long Run,… [+2216 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Jennifer Saibil)",
		"title": "Got $5,000? Buy and Hold These 3 Market-Beating Stocks",
		"description": "They're not all beating the market now, but that's where the holding part comes in.",
		"url": "https://www.fool.com/investing/2022/10/29/got-5000-buy-and-hold-these-3-market-beating-stock/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/705130/person-holding-phone-and-shopping-in-supermarket.jpg",
		"publishedAt": 1667052900000,
		"content": "The market has been moving in and out of bear territory over the past few months as investors assess conflicting signs about how the economy is doing. Inflation is still high, and many consumer goods… [+4992 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Lawrence C. Strauss",
		"title": "Dividend-Paying Stocks Can Help Battle Inflation",
		"description": "Banks like U.S. Bancorp and Truist Financial, and REITs such as Simon Property Group, Realty Income, and Digital Realty Trust, offer attractive yields and the prospect of rising dividends.",
		"url": "https://www.barrons.com/articles/dividend-paying-stocks-inflation-51666907235",
		"urlToImage": "https://images.barrons.com/im-653638/social",
		"publishedAt": 1667052420000,
		"content": "Surging bond yields have been a pleasant addition to the toolbox of income investors after years of minimal fixed-income returns. But dividend stocks can offer crucial balance and additional income t… [+315 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Max Gottlich",
		"title": "Credit Suisse leads week's financial losers, while OneMain dominates the winners",
		"description": "This week&#39;s five top decliners in financial stocks featured three depository institutions, two of them Brazilian",
		"url": "https://seekingalpha.com/news/3897541-credit-suisse-leads-weeks-financial-losers-while-onemain-dominates-the-winners",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1347345879/image_1347345879.jpg?io=getty-c-w750",
		"publishedAt": 1667052180000,
		"content": "ismagilov\r\nThis week's five top decliners in financial stocks featured three depository institutions, two of which were Brazilian. On the flip side, the five biggest gainers included firms scattered … [+1883 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Juxtaposed Ideas",
		"title": "Tilray And Trulieve: The Recession Fire Is Not Ending Yet",
		"description": "Tilray (TLRY) and Trulieve (TCNNF) Cannabis naturally has underperformed against the wider market. Read more to know why we rate both stocks as Hold.",
		"url": "https://seekingalpha.com/article/4550300-tilray-trulieve-recession-fire-not-ending",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1333314611/image_1333314611.jpg?io=getty-c-w750",
		"publishedAt": 1667052000000,
		"content": "Dimple Bhati\r\nInvestment Thesis\r\n TLRY &amp; TCNNF 3Y Stock Price\r\nSeeking Alpha\r\nPost-reopening cadence and, probably, one foot into this painful recession, speculative stocks such as Tilray Brands … [+6033 chars]",
		"titleScore": -4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Matthew DiLallo, Neha Chamaria, and Reuben Gregg Brewer)",
		"title": "Don't Be Scared by the Bear Market; Buy These 3 Top Stocks for the Long Term",
		"description": "These stocks look like great buys amid the bear market.",
		"url": "https://www.fool.com/investing/2022/10/29/dont-be-scared-by-the-bear-market-buy-these-3-top/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706061/stok-market-tickers-with-a-bear-walking.jpg",
		"publishedAt": 1667048400000,
		"content": "Bear markets can be scary times for investors. The news often seems bleaker by the day as investors and analysts focus on the negatives. That can make it hard to put money to work on new investments.… [+5505 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Travis Hoium)",
		"title": "Is ChargePoint Stock a Buy?",
		"description": "Electric vehicle charging may be booming, but that doesn't mean all EV stocks will be great investments.",
		"url": "https://www.fool.com/investing/2022/10/29/is-chargepoint-stock-a-buy/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706734/youtube-thumbnails-49.png",
		"publishedAt": 1667048400000,
		"content": "ChargePoint(CHPT -1.02%) has ridden the boom in electric vehicle stocks over the past few years, but the company is still losing money, which the market isn't looking upon fondly these days. Is this … [+227 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Retired Investor",
		"title": "IDIV ETF: Should Have Stuck With My Original Sell Opinion",
		"description": "US Equity Cumulative Dividends Fund-Series 2027 (IDIV) is a unique ETF designed to capture the S&P dividends without the equity risk related to owning those stocks. Read more here.",
		"url": "https://seekingalpha.com/article/4548806-idiv-etf-should-have-stuck-with-my-original-sell-opinion",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1072593766/image_1072593766.jpg?io=getty-c-w750",
		"publishedAt": 1667048400000,
		"content": "PM Images\r\n(This article was co-produced with Hoya Capital Real Estate)\r\n Introduction\r\n This is my third and final coverage of the Metaurus US Equity Cumulative Dividends Fund-Series 2027 ETF (NYSEA… [+9734 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Paul Franke",
		"title": "Bond Market Screaming At Investors To Sell Equities: TLT Vs. SPY",
		"description": "Rising interest rates hurt stocks. We analyze if weak bonds are an equity bear predictor. Check here to know our thoughts.",
		"url": "https://seekingalpha.com/article/4550734-tlt-vs-spy-bond-market-screaming-at-investors-to-sell-equities",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1348235111/image_1348235111.jpg?io=getty-c-w750",
		"publishedAt": 1667048393000,
		"content": "Olemedia\r\nUsually at important stock market bottoms over the last 40 years, interest rates reverse a rising trend and begin to decline rapidly. New money printing, extreme investor bearishness, and h… [+10463 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "insider@insider.com (Leo Aquino, CEPF)",
		"title": "Wealthy millennials are getting their money advice from TikTok — and they're pouring cash into crypto",
		"description": "A Bank of America study found that 75% of wealthy millennials surveyed don't think they can achieve high returns from investments like stocks.",
		"url": "https://www.businessinsider.com/personal-finance/wealthy-millennials-buying-crypto-social-media-2022-10",
		"urlToImage": "https://i.insider.com/635c2de2818bbe00191a9716?width=1200&format=jpeg",
		"publishedAt": 1667047560000,
		"content": "Insider's experts choose the best products and services to help make smart decisions with your money (heres how). In some cases, we receive a commission from our our partners, however, our opinions a… [+2896 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "SA Stocks To Watch",
		"title": "Stocks To Watch: Investors Strap In For FOMC, Jobs Day, Amazon Blowback And Election Trades",
		"description": "Get ahead of the market by subscribing to Seeking Alpha's Stocks to Watch, a preview of key events scheduled for the coming week",
		"url": "https://seekingalpha.com/article/4550419-stocks-to-watch-investors-strap-in-for-fomc-jobs-day-amazon-blowback-and-election-trades",
		"urlToImage": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
		"publishedAt": 1667046600000,
		"content": "Get ahead of the market by subscribing to Seeking Alpha's Stocks to Watch, a preview of key events scheduled for the coming week. The newsletter keeps you informed of the biggest stories set to make … [+7921 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "jsor@insider.com (Jennifer Sor)",
		"title": "Stocks crashed 50% in the 2008 crisis. Here's how bad Jamie Dimon, Nouriel Roubini, Michael Burry, and other top commentators see it getting in the next recession.",
		"description": "Markets have been rattled in 2022 and investors are worried. Here's what five top commentators have said about comparisons to the last crash.",
		"url": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-crash-recession-2008-crisis-jamie-dimon-burry-2022-10",
		"urlToImage": "https://i.insider.com/632c583cf576c60018fc322f?width=1200&format=jpeg",
		"publishedAt": 1667046600000,
		"content": "As recession fears mount on Wall Street and inflation remains well above the Fed's 2% target, some of the top commentators in markets, business, and economics have been sounding off on just how bad t… [+5764 chars]",
		"titleScore": -6,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Randall W. Forsyth",
		"title": "Don’t Expect Stocks to Rally, Even if GOP Wins Control of Congress",
		"description": "The Fed, not the politicians, will call the stock market’s tune. Shades of 1994, with some important exceptions.",
		"url": "https://www.barrons.com/articles/stock-market-midterm-elections-congress-51666910362",
		"urlToImage": "https://images.barrons.com/im-654542/social",
		"publishedAt": 1667046600000,
		"content": "The outcome of the midterm elections on Nov. 8 could disappoint investors, regardless of which party they support. \r\nAccording to Wall Street lore, stocks usually perform strongly following the midte… [+437 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Reshma Kapadia",
		"title": "Rethink China: Xi's Power Play Could Topple Stocks Again",
		"description": "Yet to be seen is how new leadership implements economic policies. Political developments could make more investors decide the country is no longer investible.",
		"url": "https://www.barrons.com/articles/china-stock-market-xi-power-play-51666990764",
		"urlToImage": "https://images.barrons.com/im-654199/social",
		"publishedAt": 1667046367000,
		"content": "Chinese stocks have lost roughly half their market value, or almost $1.5 trillion, over the past two years. But the damage may not be over as investors reassess their China allocations after Presiden… [+7366 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "axios",
			"name": "Axios"
		},
		"author": "Felix Salmon",
		"title": "Musk and Zuckerberg show how much certain men are willing to pay for power",
		"description": "Elon Musk and Mark Zuckerberg have both vaporized tens of billions of dollars in personal wealth in their idiosyncratic attempts to control the systems underpinning the quotidian lives led by the rest of us.Why it matters: These actions — Zuckerberg pivoting …",
		"url": "https://www.axios.com/2022/10/29/musk-zuckerberg-stock-tesla-twitter-meta",
		"urlToImage": "https://images.axios.com/vvrlv32fAmX729suK3nwkaB6Xm0=/0x0:1920x1080/1366x768/2022/10/28/1666973397426.jpg",
		"publishedAt": 1667046043000,
		"content": "Elon Musk and Mark Zuckerberg have both vaporized tens of billions of dollars in personal wealth in their idiosyncratic attempts to control the systems underpinning the quotidian lives led by the res… [+2604 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Rich Duprey)",
		"title": "Looking for Tech Stocks? These 2 Are Great Buys",
		"description": "The market has mistakenly thrown these fast-growing businesses out with the bathwater.",
		"url": "https://www.fool.com/investing/2022/10/29/looking-for-tech-stocks-these-2-are-great-buys/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706471/stock-chart-arrow-up-getty.jpg",
		"publishedAt": 1667045940000,
		"content": "The U.S. economy rose at a 0.6% rate in the third quarter following two consecutive quarters of decline. Despite the increase, that hasn't put recession concerns on the back burner.\r\nWhile the overal… [+4350 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Ben Levisohn",
		"title": "Companies Are Coming Back to the U.S. Honeywell and Other Stocks That Should Benefit.",
		"description": "China’s Xi Jinping places political gain over economic gain, and the U.S. appears ready to back a zero-China policy. How reshoring of American companies could be boon for stocks in defense, chips, pharma, and more.",
		"url": "https://www.barrons.com/articles/china-us-stocks-trade-reshoring-51667002378",
		"urlToImage": "https://images.barrons.com/im-580827/social",
		"publishedAt": 1667045880000,
		"content": "The gulf between the U.S. and China is widening, which could be good news for stocks benefiting from the reshoring of industries that migrated over the past 40 years.\r\nIf President Xi Jinpings consol… [+303 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Randall W. Forsyth",
		"title": "Rising Markets Seem to See the Fed Easing. It’s Too Early for That.",
		"description": "Stocks had great week, aided by slippage in the dollar’s value and hope that rate rises will be smaller than the 0.75% expected in the coming week. But investors could be misreading the U.S. central bank’s intentions.",
		"url": "https://www.barrons.com/articles/fed-interest-rates-stock-market-51667005528",
		"urlToImage": "https://images.barrons.com/im-654551/social",
		"publishedAt": 1667045820000,
		"content": "What everybody knows isnt worth knowing, according to market wisdom.\r\nThe Federal Reserve will raise its key federal-funds target rate by 75 basis points this coming week, as we all know, from the cu… [+340 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Will Ebiefung)",
		"title": "Got $1,000? 2 No-Brainer Stocks to Buy Now",
		"description": "Disney and Revolve Group look poised for bull runs.",
		"url": "https://www.fool.com/investing/2022/10/29/got-1000-2-no-brainer-stocks-to-buy-now/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706411/gettyimages-1248262649.jpg",
		"publishedAt": 1667045700000,
		"content": "For most people, $1,000 can be helpful in all kinds of ways -- from paying bills to reducing debt or taking a weekend vacation. And if you can spare that amount to put into the stock market, it could… [+3331 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cryptomatic",
		"title": "These five stocks are best positioned for long-term growth, Goldman analysts say",
		"description": "Pepsi, Alcoa, Wolfspeed, Tesla and BlackRock are all coming off of quarterly results. Goldman Sachs said this week that there are a bunch of stocks that are poised for long-term growth. CNBC Pro... #semiconductorcompany #goldman #alcoa #fritolay #wolfspeed #a…",
		"url": "https://biztoc.com/p/ycuhf5hp?ref=rss",
		"urlToImage": "https://cdn.biztoc.com/og/ycuhf5hp.jpg",
		"publishedAt": 1667045448000,
		"content": "Pepsi, Alcoa, Wolfspeed, Tesla and BlackRock are all coming off of quarterly results. Goldman Sachs said this week that there are a bunch of stocks that are poised for long-term growth. CNBC Pro comb… [+1372 chars]",
		"titleScore": 5,
		"titleMarketGrams": "These five stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Ben Levisohn",
		"title": "Shades of the Dot-Com Bust: The Dow Beats the Nasdaq.",
		"description": "The Nasdaq has been hammered by some of its biggest tech stocks, drawing comparisons to the dot-com bubble and bust. The problem: Big Tech is still pricey.",
		"url": "https://www.barrons.com/articles/stock-market-dow-nasdaq-dot-com-bubble-51667004324",
		"urlToImage": "https://images.barrons.com/im-654037/social",
		"publishedAt": 1667045142000,
		"content": "Theres nothing worse than kicking someone when theyre downbut sometimes it needs to be done. Thats the case with the \r\n Nasdaq Composite,\r\n which is on pace to lag behind the \r\n Dow Jones Industrial … [+2516 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Investor's Business Daily"
		},
		"author": "Investor's Business Daily",
		"title": "Cheniere Energy Leads 5 LNG Stocks Near Buy Points",
		"description": "Leaderboard stock Cheniere Energy reports earnings this week.",
		"url": "https://www.investors.com/news/cheniere-energy-leads-5-lng-stocks-near-buy-points/",
		"urlToImage": "https://www.investors.com/wp-content/uploads/2022/09/Stock-LNGship-01-adobe.jpg",
		"publishedAt": 1667044857000,
		"content": "Your stocks to watch for the week ahead are LNG stocks Cheniere Energy (LNG), Flex LNG (FLNG), Golar LNG (GLNG), New Fortress Energy (NFE) and Excelerate Energy (EE).\r\nXWith the market in a confirmed… [+9265 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Keith Noonan)",
		"title": "Better Bear Market Buy: DigitalOcean vs. Snowflake Stock",
		"description": "Which of these promising cloud software stocks is the better investment?",
		"url": "https://www.fool.com/investing/2022/10/29/better-buy-digitalocean-vs-snowflake-stock/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706459/individual-working-on-laptop.jpg",
		"publishedAt": 1667043300000,
		"content": "Facing high levels of inflation, rising interest rates, and other macroeconomic pressures, cloud software stocks have gotten hit hard across 2022's trading. Snowflake(SNOW -5.57%) and DigitalOcean(DO… [+5054 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Matthew DiLallo)",
		"title": "3 High-Yield Energy Stocks to Earn Passive Income for Years",
		"description": "These companies can supply you with a high-octane income stream.",
		"url": "https://www.fool.com/investing/2022/10/29/3-high-yield-energy-stocks-to-earn-passive-income/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706083/a-small-chalk-board-with-passive-income-written-out-in-near-stacks-of-100-bills.jpg",
		"publishedAt": 1667043120000,
		"content": "The energy industry is one of the best places to find high-yield dividend stocks these days. The average yield across the sector is 4%. That's the highest in the S&amp;P 500 and more than double the … [+3976 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Keith Speights)",
		"title": "Could These 3 Marijuana Stocks Skyrocket in 2023?",
		"description": "Big moves are possible next year for all three of these stocks -- but not guaranteed.",
		"url": "https://www.fool.com/investing/2022/10/29/could-these-3-marijuana-stocks-skyrocket-in-2023/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/705817/cannabis-man-in-greenhouse.jpg",
		"publishedAt": 1667041380000,
		"content": "It feels like change is in the air for the U.S. cannabis industry, which has been beaten down throughout much of the past two years. However, President Biden's recent moves related to marijuana refor… [+4428 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Clark Schultz",
		"title": "The electric vehicle revolution may be stalling - watch these stocks",
		"description": "Is it possible to be bullish on the potential for electric vehicles to be widely adopted in the long term while also being constructive on internal combustion vehicles? Morgan...",
		"url": "https://seekingalpha.com/news/3896568-the-electric-vehicle-revolution-may-be-stalling-watch-these-stocks",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1323244949/image_1323244949.jpg?io=getty-c-w750",
		"publishedAt": 1667041200000,
		"content": "Is it possible to be bullish on the potential for electric vehicles to be widely adopted in the long term while also being constructive on internal combustion vehicles in the near term?\r\nMorgan Stanl… [+2858 chars]",
		"titleScore": -2,
		"titleMarketGrams": "- watch these stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Steve Reitmeister",
		"title": "#1 Investing Strategy for 2022",
		"description": "Investing before 2022 was easy. Just pick the hottest growth stocks and ride them higher. It kind of felt like 1999 all over again as there seemed to be no...",
		"url": "https://stocknews.com/news/spy-inx-dia-iwm-qqq-1-investing-strategy-for-2022-98573892/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-438126.jpeg",
		"publishedAt": 1667040900000,
		"content": "Investing before 2022 was easy. Just pick the hottest growth stocks and ride them higher. It kind of felt like 1999 all over again as there seemed to be no end to the gainsthat was before the calenda… [+9879 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Anthony Di Pizio, Trevor Jennewine, and Jamie Louko)",
		"title": "3 Supercharged Growth Stocks Down 56% to 94% You'll Regret Not Buying on the Dip",
		"description": "Despite the uncertainty, down markets do tend to deliver long-term opportunities.",
		"url": "https://www.fool.com/investing/2022/10/29/3-growth-stocks-down-56-94-regret-buying-dip/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706099/a-person-staring-at-their-laptop-with-excitement-after-buying-an-insurance-policy-online.jpg",
		"publishedAt": 1667040300000,
		"content": "The Nasdaq-100 technology index has declined by 31% in 2022, and that's even after spending the last two weeks staging a spirited recovery. While it has been a painful time for many investors with te… [+7158 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Matthew Frankel, CFP®)",
		"title": "2 Real Estate Stocks I'm Even More Excited About After Earnings",
		"description": "These two real estate stocks have been hard hit in the recent market downturn, but recent results look strong.",
		"url": "https://www.fool.com/investing/2022/10/29/2-real-estate-stocks-im-even-more-excited-about-af/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706519/data-center-2022-b.jpg",
		"publishedAt": 1667040180000,
		"content": "The real estate sector hasn't exactly been a stellar performer in the recent market downturn, and it isn't entirely surprising. After all, income-focused stocks like real estate investment trusts (RE… [+4227 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Karishma Vanjani",
		"title": "5 Emerging Market ETFs That Limit China Investments",
		"description": "Emerging market exchange-traded funds that limit exposure to China may be a better bet for investors as China's stocks get battered.",
		"url": "https://www.barrons.com/articles/5-emerging-market-etfs-that-limit-investments-in-china-51666993202",
		"urlToImage": "https://s.wsj.net/public/resources/MWimages/MW-HA919_barron_NS_20181226134502.png",
		"publishedAt": 1667040019000,
		"content": "Chinese President Xi Jinpings unprecedented third term as head of the ruling Communist Party rattled investors who see his stacking of loyalists as less than friendly to markets. Some China-focused e… [+4664 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Modern Income Investor",
		"title": "OEF: Get Exposure To The Largest Stocks In America",
		"description": "OEF is a slimmer, more concentrated version of the S&P 500. Check here to see its holdings, performance, risks and my recommendation.",
		"url": "https://seekingalpha.com/article/4550712-oef-ishares-etf-get-exposure-largest-stocks-america",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1227367186/image_1227367186.jpg?io=getty-c-w750",
		"publishedAt": 1667039367000,
		"content": "alexsl/iStock via Getty Images\r\nBy Somya Sharma\r\n Summary\r\n We rate the iShares S&amp;P 100 ETF (NYSEARCA:OEF) a Hold partly because of our concerns about the broad U.S. equity market. OEF has had a … [+5313 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Milan Vaishnav CMT MSTA",
		"title": "Dalal Street Week Ahead: Shift focus to index stocks",
		"description": "The analysis of Relative Rotation Graphs (RRG) shows that Nifty Bank, PSU Bank, and Metal Indexes are inside the leading quadrant; they are likely to relatively outperform the broader markets. The Nifty MIDCAP index is also inside the leading quadrant but it …",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-week-ahead-shift-focus-to-index-stocks/articleshow/95163911.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95164059,width-1070,height-580,imgsize-84144,overlay-etmarkets/photo.jpg",
		"publishedAt": 1667039201000,
		"content": "After spending nearly 10 weeks below the falling trend line pattern resistance and taking support at important levels, the Nifty has finally attempted to break above this significant resistance patte… [+3962 chars]",
		"titleScore": 0,
		"titleMarketGrams": "focus to index stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Reshma Kapadia",
		"title": "Rethinking China: Xi's Power Play Could Bring Down Stocks Even More",
		"description": "Yet to be seen is how China's new leadership implements economic policies, but political developments could make more investors decide that China is no longer investible.",
		"url": "https://www.barrons.com/articles/rethinking-china-xis-power-play-could-bring-down-stocks-even-more-51666990764",
		"urlToImage": "https://images.barrons.com/im-654199/social",
		"publishedAt": 1667038188000,
		"content": "Chinese stocks have lost roughly half their market value, or almost $1.5 trillion, over the past two years. But the damage may not be over as investors reassess their China allocations after Presiden… [+7366 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Keith Speights, David Jagielski, and Prosper Junior Bakiny)",
		"title": "3 Unstoppable Stocks That Could Double in 5 Years",
		"description": "The opportunities for these innovators are tremendous.",
		"url": "https://www.fool.com/investing/2022/10/29/3-unstoppable-stocks-that-could-double-in-5-years/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706486/person-pleasantly-surprised-with-laptop.jpg",
		"publishedAt": 1667037600000,
		"content": "Little Orphan Annie had it right: The sun will come out tomorrow. Although we're in a bear market now, stocks will rebound in time. \r\nWe asked three Motley Fool contributors which stocks they're espe… [+5601 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Howard Smith)",
		"title": "2 Growth Stocks on My Buy List",
		"description": "Growth investors need a long time horizon, and these two companies have extremely bright futures.",
		"url": "https://www.fool.com/investing/2022/10/29/2-growth-stocks-on-my-buy-list/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/703346/stocks_risk.jpg",
		"publishedAt": 1667037360000,
		"content": "Growth stocks have been hit the hardest in the ongoing bear market. That's because they typically rise the fastest when markets are charging higher, resulting in lofty valuations. While the steep dro… [+3498 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "24/7 Wall St."
		},
		"author": "Lee Jackson",
		"title": "Goldman Sachs Has 5 Stocks to Buy Under $10 With 100% to 800% Upside Potential",
		"description": "These are five stocks for aggressive investors looking to get share count leverage on companies that have sizable upside potential. While not suited for all investors, they are not penny stocks with absolutely no track record or liquidity, and Goldman Sachs d…",
		"url": "https://247wallst.com/investing/2022/10/29/goldman-sachs-has-5-stocks-to-buy-under-10-with-100-to-800-upside-potential/",
		"urlToImage": "https://247wallst.com/wp-content/uploads/2021/05/imageForEntry1-Ek1.jpg",
		"publishedAt": 1667037023000,
		"content": "While most of Wall Street focuses on large-cap and mega-cap stocks, as they provide a degree of safety and liquidity, many investors are limited in the number of shares they can buy. Many of the bigg… [+3610 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Gary Tanashian",
		"title": "Gold Stocks: Not Quite Yet",
		"description": "Macro changing in favor of gold stock sector is and has been a process. See why we believe best opportunities in gold stocks are during a counter-cyclical macro.",
		"url": "https://seekingalpha.com/article/4550705-gold-stocks-not-quite-yet",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1384646810/image_1384646810.jpg?io=getty-c-w750",
		"publishedAt": 1667036235000,
		"content": "Bet_Noire\r\nMacro changing in favor of the gold stock sector is and has been a process\r\n The process began with the leveling off of inflation's momentum and continued as the global economy began to sh… [+3901 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "Two largecap stocks Nooresh Merani is betting on for next week",
		"description": "One stock in the Nifty has finally taken leadership, which is Reliance Industries. The largest weight in the Nifty has finally given a short-term breakout. The rest of the names like HDFC, HDFC Bank and ICICI, Kotak, etc, even the IT pack is still trendless a…",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/two-largecap-stocks-nooresh-merani-is-betting-on-for-next-week/articleshow/95162824.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95162822,width-1070,height-580,imgsize-42402,overlay-etmarkets/photo.jpg",
		"publishedAt": 1667035152000,
		"content": "We have seen the energy index give a breakout today, so the new rotation could be more on the energy names like as well as power, says Nooresh Merani, independent technical analyst. \r\nEdited excerpts… [+3837 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Two largecap stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Sean Williams)",
		"title": "Nasdaq Bear Market: 5 Magnificent Growth Stocks You'll Regret Not Buying on the Dip",
		"description": "With the Nasdaq Composite down as much as 38% from its peak, these highly innovative companies are ripe for the picking.",
		"url": "https://www.fool.com/investing/2022/10/29/nasdaq-bear-market-5-growth-stocks-regret-not-buy/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/706031/bear-market-stocks-plunge-crash-invest-correction-getty.jpg",
		"publishedAt": 1667034360000,
		"content": "For most investors, 2022 hasn't gone as planned. Following a year where the biggest drawdown in the S&amp;P 500 totaled just 5%, the benchmark index has responded in 2022 by plunging into a bear mark… [+8424 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "DailyFX"
		},
		"author": "Michael Boutros",
		"title": "S&P 500, Nasdaq, Dow Jones Technical Forecast: FOMC Levels",
		"description": "Stocks surged this weeks with all three major indices rallying to multi-week highs ahead of the Fed. The levels that matter on S&P 500, Nasdaq & Dow weekly charts.",
		"url": "https://www.dailyfx.com/analysis/s-p-500-nasdaq-dow-jones-technical-forecast-fomc-levels-20221029.html",
		"urlToImage": "https://a.c-dn.net/b/1VC1j3/data6.JPG",
		"publishedAt": 1667034000000,
		"content": "US Stock Indices Technical Forecast: Weekly Trade Levels\r\n<ul><li>SPX500 support 3664, 3419-3501 (key), 3142-3219- resistance 3906/07, 4007, 4105</li><li>Nasdaq support 11119, 10589, 9206-9446 - resi… [+6775 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "U.Today"
		},
		"author": "U.Today",
		"title": "Bitcoin Is Good to Buy Before FED Pivots and Stops Hiking Rates: Robert Kiyosaki",
		"description": "“Rich Dad, Poor Dad” author says that Bitcoin will stay, while stocks and real-estate will crash",
		"url": "https://u.today/bitcoin-is-good-to-buy-before-fed-pivots-and-stops-hiking-rates-robert-kiyosaki",
		"urlToImage": "https://u.today/sites/default/files/styles/twitter/public/2022-10/25240.jpg",
		"publishedAt": 1667033460000,
		"content": "Disclaimer: The opinion expressed here is not investment advice it is provided for informational purposes only. It does not necessarily reflect the opinion of U.Today. Every investment and all tradin… [+2673 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Visual.ly"
		},
		"author": "ankitguptacif22",
		"title": "Restaurant Inventory Software | Ciferon",
		"description": "The Simplest Restaurant Inventory Software manages your stocks, raw material, recipes, vendors, real time food cost, purchases, and wastage",
		"url": "https://visual.ly/community/Infographics/health/restaurant-inventory-software-ciferon",
		"urlToImage": "https://i.visual.ly/images/restaurant-inventory-software--ciferon_635cdb7b56ee2_w250_h250.png",
		"publishedAt": 1667029883000,
		"content": "Restaurant Inventory Software The Simplest Restaurant Inventory Software manages your stocks , raw material , recipes , vendors , real time food cost , purchases , and wastage Purchase Management Wit… [+475 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Left Brain Investment Research",
		"title": "Earnings Bonanza As We Wait For The Fed",
		"description": "What's Working are interest-rate sensitive sectors like homebuilders, crypto, and high beta small caps; What's Not Working is Chinese Stocks. Read an analysis here.",
		"url": "https://seekingalpha.com/article/4550686-earnings-bonanza-as-we-wait-for-the-fed",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1367511149/image_1367511149.jpg?io=getty-c-w750",
		"publishedAt": 1667028641000,
		"content": "We may be getting close to the top in rates. Investors need to consider locking in generous yields while they still can.\r\n Torsten Asmus\r\nBrian Dress, CFA - Director of Research, Investment Advisor\r\n… [+18380 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Six high ROE and low PEG ratio stocks, right combination for wealth creation",
		"description": "One of the most important financial ratios is return on equity  and if that is combined with a lower PEG ratio, even better results come.  The selected list applies different algorithms for all BSE and NSE stocks. For the purpose of this article, we have take…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-six-high-roe-and-low-peg-ratio-stocks-right-combination-for-wealth-creation/articleshow/95160123.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95160191,width-1070,height-580/photo.jpg",
		"publishedAt": 1667027068000,
		"content": "SynopsisOne of the most important financial ratios is return on equity and if that is combined with a lower PEG ratio, even better results come. The selected list applies different algorithms for all… [+102 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Mukul Agrawal added these stocks to his portfolio in Sept quarter",
		"description": "Seasoned investor Mukul Agrawal has made half a dozen fresh additions to his portfolio during the September 2022 quarter. His additions range from a variety of sectors including logistics, tyre makers, financial services, speciality chemicals and industrial p…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-added-these-stocks-to-his-portfolio-in-sept-quarter/fresh-entry/slideshow/95160337.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95160337,width-1070,height-580,overlay-etmarkets/photo.jpg",
		"publishedAt": 1667026106000,
		"content": "Mukul Mahavir Agrawal's name also appeared in the key shareholders of the trading restricted counter. He picked up 6,00,000 equity shares or 2.09 per cent in the company, which is currently valued at… [+251 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Agrawal added these stocks \n"
	},
	{
		"source": {
			"id": "bloomberg",
			"name": "Bloomberg"
		},
		"author": "Tim Culpan",
		"title": "Tech Stocks: 10 Charts Explain the Industry's Challenges",
		"description": "From semiconductors to social media to the cloud, the industry delivered a torrent of bad news.",
		"url": "https://www.bloomberg.com/opinion/articles/2022-10-29/tech-stocks-10-charts-explain-the-industry-s-challenges",
		"urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iKel7HmjNsV8/v1/1200x800.jpg",
		"publishedAt": 1667025014000,
		"content": "It was indeed a \r\nterrible, horrible, no good, very bad week for the tech sector. From semiconductors and social media to computing and the cloud, the worlds biggest companies made plain in earnings … [+6958 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "carly",
		"title": "Hopeful U.S. stock rally set for date with Federal Reserve reality",
		"description": "A bounce in U.S. stocks that has defied a barrage of major earnings disappointments faces a key test. The Federal Reserve's next meeting could shed light on how long it will stick to the... #ubs #undertaking #earningsdisappointments #amazon #gain #federalrese…",
		"url": "https://biztoc.com/p/rkuurbr4?ref=rss",
		"urlToImage": "https://cdn.biztoc.com/og/rkuurbr4.jpg",
		"publishedAt": 1667023153000,
		"content": "A bounce in U.S. stocks that has defied a barrage of major earnings disappointments faces a key test. The Federal Reserve's next meeting could shed light on how long it will stick to the aggressive m… [+1332 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Hopeful U.S. stock \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Online",
		"title": "4 must-reads of ET Wealth: How serious investors can generate wealth, 6 stocks with up to 52% upside potential & more",
		"description": "A rundown of the four most important stories from ET Wealth this week.",
		"url": "https://economictimes.indiatimes.com/wealth/personal-finance-news/4-must-reads-of-et-wealth-how-serious-investors-can-generate-wealth-6-stocks-with-up-to-52-upside-potential-more/articleshow/95141008.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95141012,width-1070,height-580,imgsize-420127,overlay-etwealth/photo.jpg",
		"publishedAt": 1667021766000,
		"content": "Here is a curated list of the best ET Wealth stories of the week. We look at how serious investors can generate wealth, how PEG ratio can help you pick good stocks, a divorce checklist for men and th… [+880 chars]",
		"titleScore": 6,
		"titleMarketGrams": "generate wealth, 6 stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "seattlepi.com"
		},
		"author": "By STAN CHOE, DAMIAN J. TROISE and ALEX VEIGA, AP Business Writers",
		"title": "Wall Street rally marks first weekly win streak since summer",
		"description": "Technology stocks led a broad rally on Wall Street Friday, capping another strong week for the market, as investors welcomed solid profits from Apple and other companies.\nThe S&P 500 rose 2.5% and posted its first back-to-back weekly gains since August. The D…",
		"url": "https://www.seattlepi.com/business/article/Asian-shares-mostly-lower-as-Japan-preps-massive-17540574.php",
		"urlToImage": "https://s.hdnux.com/photos/01/30/06/74/23097105/3/rawImage.jpg",
		"publishedAt": 1667016705000,
		"content": "Technology stocks led a broad rally on Wall Street Friday, capping another strong week for the market, as investors welcomed solid profits from Apple and other companies.The S&amp;P 500 rose 2.5% and… [+4851 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Vasily Zyryanov",
		"title": "EWD: Swedish Equities Hammered By U.S. Inflation, Outlook Somber",
		"description": "iShares MSCI Sweden Capped Fund is an ETF overseeing a portfolio of 46 Swedish stocks. See why I'm maintaining a neutral rating on EWD ETF.",
		"url": "https://seekingalpha.com/article/4550644-ewd-etf-swedish-equities-hammered-us-inflation-outlook-somber",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/170006998/image_170006998.jpg?io=getty-c-w750",
		"publishedAt": 1667016584000,
		"content": "knape/E+ via Getty Images\r\nA swift and decisive change in monetary policy across the globe entailed by inflation almost spiraling out of control is still reverberating through various corners of the … [+7708 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Dealnews.com"
		},
		"author": null,
		"title": "Webull Limited Offer: Get up to 12 free stocks w/ new funded account",
		"description": "Open an account with Webull to get your 2 free fractional share stocks, each valued up to $300. Deposit any amount to receive 4 - 10 free fractional share stocks, each valued up to $3,000. If you're lucky, that's up to $30,600 in stocks! \r\n Features\r\n <ul> <l…",
		"url": "https://www.dealnews.com/Webull-Limited-Offer-Get-up-to-12-free-stocks-w-new-funded-account/20733338.html",
		"urlToImage": "https://c.dlnws.com/image/upload/f_auto,t_maximum,q_auto/content/ylbbh5rwyykj1bh8gihh.png",
		"publishedAt": 1667016000000,
		"content": "moreOpen an account with Webull to get your 2 free fractional share stocks, each valued up to $300. Deposit any amount to receive 4 - 10 free fractional share stocks, each valued up to $3,000. If you… [+858 chars]",
		"titleScore": 0,
		"titleMarketGrams": "to 12 free stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Vidya Sreedhar",
		"title": "32 smallcap stocks give double-digit weekly returns; is more steam left?",
		"description": "“As seen in market upcycle, mid and smallcap stocks tend to outperform largecaps. Based on expectation of Nifty 50 creating a new high, we can expect this to translate into broader market outperformance as well..” said Vivek Goel, co-founder and joint MD at T…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/32-smallcap-stocks-give-double-digit-weekly-returns-is-more-steam-left/articleshow/95157121.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95157103,width-1070,height-580,imgsize-88698,overlay-etmarkets/photo.jpg",
		"publishedAt": 1667015566000,
		"content": "The week gone by was positive for the domestic market, with Sensex notching 1% gain. But the broader market remained an outperformer as is evident in the stellar returns given by stocks in the smallc… [+2026 chars]",
		"titleScore": 0,
		"titleMarketGrams": "32 smallcap stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Adam Hamilton",
		"title": "Gold Stocks' Winter Rally 7",
		"description": "Gold and gold stocks are entering their strongest seasonal span of the year. Gold’s big winter rally is fueled by outsized demand first from holiday jewelry buying then investment buying.",
		"url": "https://seekingalpha.com/article/4550635-gold-stocks-winter-rally-7",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1175645213/image_1175645213.jpg?io=getty-c-w750",
		"publishedAt": 1667013134000,
		"content": "Aslan Alphan\r\nThe gold miners’ stocks have been battered over this past half-year, bludgeoned relentlessly lower with gold. Heavy gold-futures selling fueled by the US dollar shooting parabolic in a … [+19094 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "juggler",
		"title": "Jim Cramer says he likes these 3 travel stocks",
		"description": "CNBC's Jim Cramer named travel as one of five recession-resistant market leaders that are emerging. He highlighted Amazon's most recent quarterly results as an example. Part of the reason tech... #jimcramer #amazon #reasontechcompanies #marketleaders #disney",
		"url": "https://biztoc.com/p/mwkg7fvf?ref=rss",
		"urlToImage": "https://cdn.biztoc.com/og/mwkg7fvf.jpg",
		"publishedAt": 1667012954000,
		"content": "CNBC's Jim Cramer named travel as one of five recession-resistant market leaders that are emerging. He highlighted Amazon's most recent quarterly results as an example. Part of the reason tech compan… [+374 chars]",
		"titleScore": 2,
		"titleMarketGrams": "these 3 travel stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "xluettgen",
		"title": "S&P 500 Rebounds After a Week of Mixed Messages From Big Tech",
		"description": "The S&P 500 rose 2.5 percent, bringing its gains for the week to 3.95 percent. Stocks rallied on Friday, finishing a second consecutive week of gains. Investors hope the Federal Reserve might... #amazon #federalreserve #bankers #meta #messages #technologycomp…",
		"url": "https://biztoc.com/p/jxy5s99x?ref=rss",
		"urlToImage": "https://cdn.biztoc.com/og/jxy5s99x.jpg",
		"publishedAt": 1667008755000,
		"content": "The S&amp;P 500 rose 2.5 percent, bringing its gains for the week to 3.95 percent. Stocks rallied on Friday, finishing a second consecutive week of gains. Investors hope the Federal Reserve might ind… [+1213 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "Reuters",
		"title": "Buoyant Wall Street boosts world, European stocks; oil prices slide",
		"description": "World and European shares turned higher on Friday as Wall Street extended gains amid hopes of a slowdown in some central banks' rate hikes",
		"url": "https://www.business-standard.com/article/international/buoyant-wall-street-boosts-world-european-stocks-oil-prices-slide-122102801409_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-10/26/full/1666746335-2517.jpg",
		"publishedAt": 1667008380000,
		"content": "By Chris Prentice and Marc Jones\r\nWASHINGTON/LONDON (Reuters) -World and European shares turned higher on Friday as Wall Street extended gains amid hopes of a slowdown in some central banks' rate hik… [+4342 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "bloomberg",
			"name": "Bloomberg"
		},
		"author": "Adam Majendie",
		"title": "Your Saturday Asia Briefing: Falling Stocks and Melted Gold",
		"description": "Something for the weekend.",
		"url": "https://www.bloomberg.com/news/articles/2022-10-29/china-stock-market-rout-to-indian-melted-gold-saturday-asia-briefing",
		"urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iTSgVTJOu9oE/v1/1200x800.jpg",
		"publishedAt": 1667007923000,
		"content": "Lets cut to the chase. After a truly seismic week for markets, politics \r\nand the Chief Twit, here are the big questions you may want to know the answers to as you settle into the weekend:\r\nOK, there… [+1929 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	}
]