[
	{
		"source": {
			"id": null,
			"name": "seattlepi.com"
		},
		"author": "By ELAINE KURTENBACH, AP Business Writer",
		"title": "Asian shares gain after Fed chair signals slower rate hikes",
		"description": "BANGKOK (AP) - Shares advanced in Asia on Thursday after a rally on Wall Street spurred by the Federal Reserve chair's comments on easing the pace of interest rate hikes to tame inflation. Signs that China may be shifting its approach to containing COVID-19 o…",
		"url": "https://www.seattlepi.com/news/article/Asian-shares-gain-after-Fed-chair-signals-slower-17623105.php",
		"urlToImage": "https://s.hdnux.com/img/modules/siteheader/brand.png",
		"publishedAt": 1669878501000,
		"content": "A woman uses her phone in front of monitors showing Japan's Nikkei 225 index at a securities firm while waiting for a traffic light in Tokyo, Thursday, Dec. 1, 2022. Shares have advanced in Asia after a rally on Wall Street spurred by the Federal Reserve chair's comments on easing the pace of interest rate hikes to tame inflation.Hiro Komae/APBANGKOK (AP) — Shares advanced in Asia on Thursday after a rally on Wall Street spurred by the Federal Reserve chair's comments on easing the pace of interest rate hikes to tame inflation.AdvertisementArticle continues below this adSigns that China may be shifting its approach to containing COVID-19 outbreaks to focus more on vaccinations also helped drive buying of shares across the region.Tokyo's Nikkei 225 index added 0.9% to 28,226.08 while the Hang Seng in Hong Kong advanced 1.4% to 18,859.73. The Shanghai Composite index climbed 0.5% to 3,166.23. In Seoul, the Kospi picked up 0.3% to 2,479.84. Australia's S&P/ASX 200 gained 1% to 7,354.40.Bangkok's SET rose 0.9% a day after the central bank raised its key interest rate by a quarter point to 1.25%, aiming to curb inflation.AdvertisementArticle continues below this adOn Wednesday, Fed Chair Jerome Powell, said in comments at the Brookings Institution that the central bank could begin moderating its pace of rate hikes as soon as December, when its policymaking committee will hold its next meeting.“We have a risk management balance to strike,” Powell said. “And we think that slowing down (on rate hikes) at this point is a good way to balance the risks.”Stocks roared higher. The benchmark S&P 500 rose 3.1%, snapping a three-day losing streak and closing at 4,080.11. The Dow Jones Industrial Average gained 2.2% to 34,589.77 and the Nasdaq composite climbed 4.4% to 11,468.Small company stocks also rallied. The Russell 2000 index rose 2.7% to 1,886.58.AdvertisementArticle continues below this adMore than 95% of the stocks in the S&P 500 advanced, led by technology companies. Apple rose 4.9% and Microsoft jumped 6.2%.“The optimism in the market is that perhaps the worse is over for the U.S. in terms of inflation reading, and the Fed isn’t going to increase the interest aggressively,\" Naeem Aslam of Avatrade said in a commentary.Powell’s comments sent Treasury yields sharply lower. The yield on the 10-year Treasury dropped to 3.62% from 3.75% late Tuesday. The yield on the two-year note, which tends to track market expectations of future Fed action, fell to 4.34%. It was trading at 4.48% late Tuesday and had been as high as 4.53% shortly before Powell’s speech.While citing some recent signs that inflation is cooling, Powell stressed that the Fed will push rates higher than previously expected and keep them there for an extended period to ensure inflation comes down sufficiently.AdvertisementArticle continues below this ad“History cautions strongly against prematurely loosening policy,” Powell said. “We will stay the course until the job is done.”Major indexes have been unsteady all year as the economy and financial markets dealt with stubbornly hot inflation and the Fed's attempt to cool high prices with aggressive interest rate increases.Wall Street has been hoping that the Fed will slow the scale and pace of its interest rate hikes. It has raised its benchmark interest rate six times since March, driving it to a range of 3.75% to 4%, the highest in 15 years. The goal is to make borrowing more costly and generally slow the economy in order to tame inflation.Higher mortgage rates have caused home sales to plunge and higher interest rates also have raised costs for most other consumer and business loans.AdvertisementArticle continues below this adThe economy has been slowing, and many economists expect the U.S. to slip into a recession next year. But there are strong pockets of growth. The government said Wednesday that the economy expanded at a 2.9% annual rate from July through September, an upgrade from its initial estimate.Consumers have continued spending, despite inflation squeezing wallets. Overall, employment remains strong, though job openings dropped in October more than economists had anticipated and human resources company ADP reported an easing in private sector hiring in November.Investors will get more data Thursday on the employment sector with a report on weekly unemployment claims. The closely watched monthly report on the job market will be released on Friday.In other trading Thursday, U.S. benchmark crude oil lost 41 cents to $80.14 a barrel in electronic trading on the New York Mercantile Exchange. It climbed 3% on Wednesday.AdvertisementArticle continues below this adBrent crude, the pricing basis for international trading, shed 54 cents to $86.43 a barrel.The U.S. dollar fell to 136.32 Japanese yen from 138.09 yen. The euro rose to $1.0454 from $1.0409.",
		"isFull": true,
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "thestreet.com",
		"title": "U.S. Stock Movers of Note: Buffett Holding StoneCo; Gold Stocks",
		"description": "Stocks rose Wednesday after dovish comments from Fed Chairman Jerome Powell. The Dow Jones Industrial Average rose 737.24, or 2.18% to 34,589.77. The S&P 500 rose 122.48, or 3.09% to 4,080.11. Winners outpaced losers 475 to 24 in the S&P 500. .Within the S&P …",
		"url": "https://biztoc.com/x/23a6738169466298",
		"urlToImage": "https://c.biztoc.com/p/23a6738169466298/og.webp",
		"publishedAt": 1669878244000,
		"content": "Stocks rose Wednesday after dovish comments from Fed Chairman Jerome Powell.\r\nThe Dow Jones Industrial Average rose 737.24, or 2.18% to 34,589.77.\r\nThe S&amp;P 500 rose 122.48, or 3.09% to 4,080.11. … [+986 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "Fed's Powell: Rate hikes to slow, but adjustment just beginning - Reuters",
		"description": "Fed's Powell: Rate hikes to slow, but adjustment just beginningReuters Fed Chair Powell says smaller interest rate hikes could start in DecemberCNBC Stock market news live updates: Stocks leap after Powell signals rate hike slowdownYahoo Finance Why Are Stock…",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=168559948",
		"urlToImage": null,
		"publishedAt": 1669877553000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "Avdhut Bagkar",
		"title": "TCS, Tata Coffee: 5 Tata Group stocks that you can bet on for a good return",
		"description": "With in the Tata Group space, except for Indian Hotels, others like TCS, Tata Motors, Trent and Tata Coffee seem poised for a buoyant rally in the near term.",
		"url": "https://www.business-standard.com/article/markets/tcs-tata-coffee-5-tata-group-stocks-that-you-can-bet-on-for-a-good-return-122120100399_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-05/18/full/1652839023-7136.jpg",
		"publishedAt": 1669877160000,
		"content": "Tata Group has been in the news recently as it further consolidated its position in the airline space by announcing the merger of Air India with Singapore International Airlines (SIA)-operated Vistar… [+285 chars]",
		"titleScore": 3,
		"titleMarketGrams": "5 Tata Group stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "Asia-Pacific markets rise, Japanese yen at 3-month high as Fed signals smaller hikes - CNBC",
		"description": "Asia-Pacific markets rise, Japanese yen at 3-month high as Fed signals smaller hikesCNBC Stock market news live updates: Stocks leap after Powell signals rate hike slowdownYahoo Finance Fed Chair Powell says smaller interest rate hikes could start in December…",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=168559364",
		"urlToImage": null,
		"publishedAt": 1669876378000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": 1,
		"titleMarketGrams": "Asia-Pacific markets \n"
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Jacob Sonenshine",
		"title": "Recession Disconnect: Bonds Say Yes. Stocks Say No.",
		"description": "The last time the yield curve was inverted this deeply in the early 1980s, it correctly predicted a recession.",
		"url": "https://www.barrons.com/articles/yield-curve-recession-51669841948",
		"urlToImage": "https://images.barrons.com/im-676316/social",
		"publishedAt": 1669876200000,
		"content": "The yield curve is signaling that a recession is on the way. The stock market isntand something has got to give. The yield curve is the difference in yield between long-dated and short-dated bonds. I… [+2805 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "Analysis-Markets sigh with relief after Powell speech, but more turbulence likely ahead By Reuters",
		"description": "By Davide Barbuscia and David Randall (Reuters) - A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a looming recession could cap gains in both asset classes. Thoug…",
		"url": "https://biztoc.com/x/3d9ebff5786b6d52",
		"urlToImage": "https://c.biztoc.com/p/3d9ebff5786b6d52/og.webp",
		"publishedAt": 1669875736000,
		"content": "By Davide Barbuscia and David Randall\r\n(Reuters) - A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a l… [+989 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "reuters.com",
		"title": "Analysis: Markets sigh with relief after Powell speech, but more turbulence likely ahead",
		"description": "Dec 1 (Reuters) - A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a looming recession could cap gains in both asset classes. Though asset prices have been battere…",
		"url": "https://biztoc.com/x/6b6037194df35b0a",
		"urlToImage": "https://c.biztoc.com/p/6b6037194df35b0a/og.webp",
		"publishedAt": 1669875724000,
		"content": "Dec 1 (Reuters) - A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a looming recession could cap gains … [+973 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "FX Empire"
		},
		"author": "Reuters",
		"title": "Analysis-Markets sigh with relief after Powell speech, but more turbulence likely ahead",
		"description": "By Davide Barbuscia and David Randall (Reuters) -   A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a looming recession could cap gains in both asset classes.",
		"url": "https://www.fxempire.com/news/article/analysis-markets-sigh-with-relief-after-powell-speech-but-more-turbulence-likely-ahead-1215867",
		"urlToImage": "https://responsive.fxempire.com/width/600/webp-lossy-70.q50/_fxempire_/2022/12/tagreuters.com2022newsml_LYNXMPEIB01HA2.jpg",
		"publishedAt": 1669875701000,
		"content": "Though asset prices have been battered by the Feds rate rises this year, momentum has been on the side of the bulls in recent weeks. The S&amp;P 500 has soared nearly 14% from its October low while y… [+4350 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "International Business Times"
		},
		"author": "Davide Barbuscia and David Randall",
		"title": "Analysis-Markets Sigh With Relief After Powell Speech, But More Turbulence Likely Ahead",
		"description": "A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a looming recession could cap gains in both asset classes.",
		"url": "https://www.ibtimes.com/analysis-markets-sigh-relief-after-powell-speech-more-turbulence-likely-ahead-3642249",
		"urlToImage": "https://d.ibtimes.com/en/full/4389261/traders-work-floor-nyse-new-york.jpg",
		"publishedAt": 1669875335000,
		"content": "A trader works on the floor of the New York Stock Exchange (NYSE) in New York City, U.S., November 29, 2022. \r\nA rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairma… [+4575 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "reuters",
			"name": "Reuters"
		},
		"author": null,
		"title": "Markets sigh with relief after Powell speech, but more turbulence likely ahead",
		"description": "A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a looming recession could cap gains in both asset classes.",
		"url": "https://www.reuters.com/markets/us/markets-sigh-with-relief-after-powell-speech-more-turbulence-likely-ahead-2022-12-01/",
		"urlToImage": "https://www.reuters.com/resizer/Gb_QAHvDRQf-JEa5Sbo3W3x-eyA=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/N7TYEUXR4BL7DJHZ2KRITD4MC4.jpg",
		"publishedAt": 1669875128000,
		"content": "Dec 1 (Reuters) - A rally in U.S. stocks and bonds powered ahead after a speech by Federal Reserve Chairman Jerome Powell on Wednesday, but some investors believe a looming recession could cap gains … [+4642 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "4 stocks to go for in auto and auto ancillary space: Mitul Shah",
		"description": "“Within the auto segment, a positive surprise is coming on the tractor side, though this segment has also witnessed a month-on-month decline post the festival impact. But compared to the numbers which the Street is expecting for the tractor industry on a YoY …",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/4-stocks-to-go-for-in-auto-and-auto-ancillary-space-mitul-shah/articleshow/95904999.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95904968,width-1070,height-580,imgsize-52108,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669875071000,
		"content": "Among commercial vehicle makers, seems to be promising and among auto ancillaries, tyre companies are going to benefit largely because of raw material price benefit as we all know that crude prices c… [+2618 chars]",
		"titleScore": 0,
		"titleMarketGrams": "4 stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Ozbargain.com.au"
		},
		"author": "videoguys",
		"title": "DJI Action 2 Power Combo $299, Insta360 X3 $779, Sony FX6 $9099 + Delivery ($0 C&C) & More @ Videoguys Australia",
		"description": "Hey Guys,\n\nHappy Holidays!\n\nBlack Friday weekend is done, and we've just launched our gift idea deals leading up to Christmas. We've got a couple of great deals on video and audio equipment for you.\nThese are while stocks last, or up to 23/12/2022. Whichever …",
		"url": "https://www.ozbargain.com.au/node/742559",
		"urlToImage": "https://files.ozbargain.com.au/n/59/742559l.jpg?h=ca52f4ae",
		"publishedAt": 1669874817000,
		"content": "Hey Guys,\r\nHappy Holidays!\r\nBlack Friday weekend is done, and we've just launched our gift idea deals leading up to Christmas. We've got a couple of great deals on video and audio equipment for you.T… [+2905 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stock market update: Power stocks up as market rises",
		"description": "The 30-share BSE Sensex was  up  265.94 points at 63365.59",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-power-stocks-up-as-market-rises/articleshow/95904546.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83800143,width-1070,height-580,imgsize-287158,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669874151000,
		"content": "NEW DELHI: Power stocks were trading higher on Thursday at 11:25AM \r\nJyoti Structures(up 5.00%), PIGL(up 4.92%), GE Power India Limited(up 4.56%), Gujarat Industries Power(up 4.26%), Indo Tech Transf… [+1234 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Stock market \n market update: Power stocks \n stocks up as market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "While stocks and bonds plunge, sales of these 'safe' investments are booming",
		"description": "Yep. Right on cue. As stocks, bonds and other investments have tanked, ordinary investors have flooded into higher-fee annuity products in the quest for investments with more “safety” or “protection.” One of the many reasons ordinary investors underperform th…",
		"url": "https://biztoc.com/x/2e8910941d170cac",
		"urlToImage": "https://c.biztoc.com/p/2e8910941d170cac/og.webp",
		"publishedAt": 1669874043000,
		"content": "Yep. Right on cue.\r\nAs stocks, bonds and other investments have tanked, ordinary investors have flooded into higher-fee annuity products in the quest for investments with more safety or protection.\r\n… [+950 chars]",
		"titleScore": 0,
		"titleMarketGrams": "While stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stock market update: Fertilisers stocks up as market rises",
		"description": "The 30-share BSE Sensex was  up  283.11 points at 63382.76",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-fertilisers-stocks-up-as-market-rises/articleshow/95904415.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83515267,width-1070,height-580,imgsize-853209,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669873844000,
		"content": "NEW DELHI: Fertilisers stocks were trading higher on Thursday at 11:20AM \r\nSouthern Petrochemicals Industries(up 3.74%), Madhya Bharat Agro Products(up 3.59%), Rama Phosphates(up 2.15%), Nagarjuna Fe… [+1153 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Stock market \n market update: Fertilisers stocks \n stocks up as market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "SI Reporter",
		"title": "Cement shares in focus; JK Lakshmi, Dalmia, JK Cement up over 12% in 1 mth",
		"description": "Analysts expect cement stocks to witness catch up activity after months of underperformance as many negatives seem to be priced-in",
		"url": "https://www.business-standard.com/article/markets/cement-shares-in-focus-jk-lakshmi-dalmia-jk-cement-up-over-12-in-1-mth-122120100356_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-10/03/full/1601665980-9355.jpg",
		"publishedAt": 1669873500000,
		"content": "Shares of cement companies continued at their upward movement on the bourses on expectation of margin improvement due to falling input costs, and demand recovery post monsoon and during the next fisc… [+2649 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "China tech stocks have 'a lot of upside' and peak regulation is over, fund management firm says",
		"description": "The Chinese government is unlikely to introduce new regulations for the internet tech sector, according to Jonathan Krane of KraneShares. - He said the rules introduced in recent years were meant to create long-term stability in the sector. - Ramiz Chelat of …",
		"url": "https://biztoc.com/x/b5aaa0aa5ed04df6",
		"urlToImage": "https://c.biztoc.com/p/b5aaa0aa5ed04df6/og.webp",
		"publishedAt": 1669873325000,
		"content": "The Chinese government is unlikely to introduce new regulations for the internet tech sector, according to Jonathan Krane of KraneShares.\r\n- He said the rules introduced in recent years were meant to… [+962 chars]",
		"titleScore": 0,
		"titleMarketGrams": "China tech stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "247wallst.com",
		"title": "10 Stocks That Could Benefit From the FIFA World Cup 2022",
		"description": "The FIFA 2022 World Cup is currently underway and is scheduled to run till December 18. It is the biggest sporting event and has an impact on the financial world as well. Many companies stand to gain from this FIFA event. Most of these companies are usually d…",
		"url": "https://biztoc.com/x/5ec5d63104e065fe",
		"urlToImage": "https://c.biztoc.com/p/5ec5d63104e065fe/og.webp",
		"publishedAt": 1669873205000,
		"content": "The FIFA 2022 World Cup is currently underway and is scheduled to run till December 18. It is the biggest sporting event and has an impact on the financial world as well. Many companies stand to gain… [+970 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stock market update: FMCG stocks up as market rises",
		"description": "The 30-share BSE Sensex was  up  288.61 points at 63388.26",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-fmcg-stocks-up-as-market-rises/articleshow/95904021.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83608600,width-1070,height-580,imgsize-23742,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669872931000,
		"content": "NEW DELHI: FMCG stocks were trading higher on Thursday at 11:05AM \r\nHatsun Agro Product Ltd(up 10.30%), Hindustan Foods(up 3.96%), Mrs Bectors Food Specialities(up 2.23%), Vadilal Industries(up 1.63%… [+1265 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Stock market \n market update: FMCG stocks \n stocks up as market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Chinese Stocks Add to Historic Rally as Reopening Signs Grow",
		"description": "(Bloomberg) -- Chinese stocks extended gains into the new month amid fresh signs that the nation is moving away from Covid Zero that’s wreaked havoc on markets and the economy. Most Read from Bloomberg The Hang Seng China Enterprises Index rose 3.7% before pa…",
		"url": "https://biztoc.com/x/02044310cfcf2eb3",
		"urlToImage": "https://c.biztoc.com/p/02044310cfcf2eb3/og.webp",
		"publishedAt": 1669872847000,
		"content": "(Bloomberg) -- Chinese stocks extended gains into the new month amid fresh signs that the nation is moving away from Covid Zero thats wreaked havoc on markets and the economy.\r\nMost Read from Bloombe… [+953 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Sensex rises! These stocks are up over 15% on BSE",
		"description": "In the Nifty50 index, 31 stocks were trading in the green, while 19 stocks were in the red.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/sensex-rises-these-stocks-are-up-over-15-on-bse/articleshow/95903885.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-82697732,width-1070,height-580,imgsize-184256,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669872625000,
		"content": "NEW DELHI: Several stocks gained in excess of 15% in Mumbai trading on Thursday even as equity benchmarks, BSE Sensex and NSE Nifty, traded in the green amid brisk buying in frontline bluechip counte… [+549 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Sensex rises! These stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Brett Arends",
		"title": "While stocks and bonds plunge, sales of these ‘safe’ investments are booming",
		"description": "New figures show investors are turning cautious — after the stock market has fallen",
		"url": "https://www.marketwatch.com/story/while-stocks-and-bonds-plunge-sales-of-these-safe-investments-are-booming-11669845775",
		"urlToImage": "https://images.mktw.net/im-676294/social",
		"publishedAt": 1669872600000,
		"content": "Yep. Right on cue.As stocks, bonds and other investments have tanked, ordinary investors have flooded into higher-fee annuity products in the quest for investments with more safety or protection.One … [+4371 chars]",
		"titleScore": 0,
		"titleMarketGrams": "While stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "ft.com",
		"title": "Emerging market stocks and bonds stage powerful rebound rally",
		"description": "Investors respond to signs that interest rate rises in developed economies are set to slow #developedeconomies #slow #respond #signs #developed #economies",
		"url": "https://biztoc.com/x/a37e051f9ee580d3",
		"urlToImage": "https://c.biztoc.com/71/og.png",
		"publishedAt": 1669872364000,
		"content": "Investors respond to signs that interest rate rises in developed economies are set to slow \r\n#developedeconomies#slow#respond#signs#developed#economies\r\n This story appeared first on ft.com, 2022-12-… [+2 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Emerging market \n Emerging market stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stock market update: Mining stocks up as market rises",
		"description": "The 30-share BSE Sensex was  up  279.84 points at 63379.49",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-mining-stocks-up-as-market-rises/articleshow/95903775.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83209716,width-1070,height-580,imgsize-107089,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669872318000,
		"content": "NEW DELHI: Mining stocks were trading higher on Thursday at 10:55AM \r\nOrissa Minerals Development Company(up 5.00%), NMDC Ltd(up 2.51%), Madhav Marbles and Granites(up 2.37%), Ashapura Minechem(up 2.… [+1018 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Stock market \n market update: Mining stocks \n stocks up as market \n"
	},
	{
		"source": {
			"id": null,
			"name": "The Week Magazine"
		},
		"author": "Peter Weber",
		"title": "U.S. gas prices fall to pre–Ukraine invasion levels, Dow jumps back to bear market",
		"description": "The average price of gas in the U.S. fell to under $3.50 a gallon on Wednesday, AAA reports, making gas as cheap as it was before Russia's invasion of Ukraine destabilized global energy. And GasBuddy, which tracks the price of gasoline, predicts prices to dro…",
		"url": "https://theweek.com/economy/1018865/us-gas-prices-fall-to-pre-ukraine-invasion-levels-dow-jumps-back-to-bear-market",
		"urlToImage": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1669872887/GettyImages-73517854.jpg",
		"publishedAt": 1669872274000,
		"content": "Gas Holiday\r\nThe average price of gas in the U.S. fell to under $3.50 a gallon on Wednesday, AAA reports, making gas as cheap as it was before Russia's invasion of Ukraine destabilized global energy.… [+2072 chars]",
		"titleScore": -1,
		"titleMarketGrams": "back to bear market \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Sensex rises! These stocks are up over 10% on BSE",
		"description": "In the Nifty 50 index, 31 stocks were trading in the green, while 19 stocks were trading in the red.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/sensex-rises-these-stocks-are-up-over-10-on-bse/articleshow/95903565.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83549420,width-1070,height-580,imgsize-22674,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669871704000,
		"content": "NEW DELHI: Quite a few stocks rose in excess of 10% on BSE as domestic equity indices, BSE Sensex and NSE Nifty, traded in the green on Thursday amid buying in frontline bluechip counters. \r\nStocks t… [+671 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Sensex rises! These stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stock market update: Stocks that hit 52-week lows on NSE",
		"description": "Bajaj Auto,  UPL,  Cipla,  HUL and  Nestle India were among the top losers on NSE.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-stocks-that-hit-52-week-lows-on-nse/articleshow/95903428.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83804572,width-1070,height-580,imgsize-297423,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669871397000,
		"content": "Indices hit Fresh Highs on Strong Liquidity Flows Indian equities surged to fresh records on Wednesday as a spurt in the last half hour of trade helped the Sensex surpass 63,000 for the first time.\r\n… [+594 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Stock market \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Kshitij Anand",
		"title": "ETMarkets Fund Manager Talk: 20 years' study shows most active managers underperform benchmark most of the time: Benedeck Voros",
		"description": "\"In volatile periods in particular, low volatility strategies have proved successful in providing portfolio defence and limiting downside risk by avoiding highly volatile stocks and favouring those that have exhibited more stable performance. Low volatility i…",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-fund-manager-talk-20-years-study-shows-most-active-managers-underperform-benchmark-most-of-the-time-benedeck-voros/articleshow/95891353.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95891385,width-1070,height-580,imgsize-42728,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669871100000,
		"content": "Most active managers underperform most of the time and this remains true after adjusting for risk, too, says Benedeck Voros, Director, Index Investment StrategyIn an interview with ETMarkets, Voros, … [+7339 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Hot Stocks: Gland Pharma, Mirza International and Agro Tech Foods could give 19-30% return",
		"description": "Offices and schools have opened, which creates an incremental demand for shoes and that benefits the shoe manufacturers, the brokerage said. After growing in metro cities, management has now shifted its focus to tier 2 & 3 cities where management sensed large…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-gland-pharma-mirza-international-and-agro-tech-foods-could-give-19-30-return/articleshow/95903131.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95903189,width-1070,height-580,imgsize-45264,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669870884000,
		"content": "Brokerage firm Ashika Stock Broking has a buy rating on while has retained a buy call on . Phillip Capital also has a buy on .\r\nWe have collated a list of recommendations from top brokerage firms:\r\nA… [+2175 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Share market update: Most active stocks on D-Street today in terms of volume",
		"description": "The NSE Nifty index was trading 77.3 points  up  at 18835.65",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/share-market-update-most-active-stocks-on-d-street-today-in-terms-of-volume/articleshow/95903018.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83745691,width-1070,height-580,imgsize-156851,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669870477000,
		"content": "Indices hit Fresh Highs on Strong Liquidity Flows Indian equities surged to fresh records on Wednesday as a spurt in the last half hour of trade helped the Sensex surpass 63,000 for the first time.\r\n… [+594 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Share market \n update: Most active stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnn.com",
		"title": "Stock market news: Dow, S&P 500 and the Federal Reserve",
		"description": "US stocks exploded higher Wednesday. The Dow is now more than 20% above its 52-week low, which puts it in a new bull market. Federal Reserve chair Jerome Powell strongly suggested that the central bank is ready to slow its pace of interest rate hikes. Powell …",
		"url": "https://biztoc.com/x/bcedb5b7e995a900",
		"urlToImage": "https://c.biztoc.com/p/bcedb5b7e995a900/og.webp",
		"publishedAt": 1669870327000,
		"content": "US stocks exploded higher Wednesday. The Dow is now more than 20% above its 52-week low, which puts it in a new bull market. Federal Reserve chair Jerome Powell strongly suggested that the central ba… [+601 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Stock market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Jim Cramer says to use Wednesday’s rally to reposition into profitable stocks",
		"description": "CNBC's Jim Cramer urged investors to use the market's rally on Wednesday to recalibrate their portfolios. - \"Use this moment to pivot yourself. Get out of the stocks I've been railing against for a full year,\" he said. CNBC's Jim Cramer urged investors to use…",
		"url": "https://biztoc.com/x/442d4dc0628c3f06",
		"urlToImage": "https://c.biztoc.com/p/442d4dc0628c3f06/og.webp",
		"publishedAt": 1669870326000,
		"content": "CNBC's Jim Cramer urged investors to use the market's rally on Wednesday to recalibrate their portfolios.\r\n- \"Use this moment to pivot yourself. Get out of the stocks I've been railing against for a … [+948 chars]",
		"titleScore": 2,
		"titleMarketGrams": "reposition into profitable stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stock market update: Sugar stocks up as market rises",
		"description": "The 30-share BSE Sensex was  up  249.04 points at 63348.69",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-sugar-stocks-up-as-market-rises/articleshow/95902915.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-77646325,width-1070,height-580,imgsize-71505,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669870171000,
		"content": "NEW DELHI: Sugar stocks were trading higher on Thursday at 10:19AM \r\nSakthi Sugars(up 3.81%), Ponni Sugars(Erode)(up 2.45%), BAJAJHIND(up 1.79%), \r\n &amp; Chemicals(up 1.66%), &amp; Industries(up 1.2… [+1176 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Stock market \n market update: Sugar stocks \n stocks up as market \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "BCCL",
		"title": "At multi-year highs: These 6 stocks gave 5-year breakouts",
		"description": "In the Nifty 500 pack, six stocks crossed their previous 5-year high value at the close on November 30, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look: At a high!",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-6-stocks-gave-5-year-breakouts-on-november-30/at-a-high/slideshow/95902956.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95902956,width-1070,height-580,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669869723000,
		"content": "To see your saved stories, click on link hightlighted in bold",
		"titleScore": 0,
		"titleMarketGrams": "highs: These 6 stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Sensex rises! But these stocks are down 5% or more on BSE",
		"description": "In the Nifty pack, 26 stocks were trading in the green, while 24 stocks were trading in the red.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/sensex-rises-but-these-stocks-are-down-5-or-more-on-bse/articleshow/95902680.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-82697732,width-1070,height-580,imgsize-184256,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669869558000,
		"content": "NEW DELHI: Several stocks plunged in excess of 5 per cent in Mumbai trading on Thursday even as equity benchmark BSE Sensex traded 312.1 points up at 63411.75 amid brisk buying in frontline bluechip … [+592 chars]",
		"titleScore": 1,
		"titleMarketGrams": "rises! But these stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stock market update: Stocks that hit 52-week highs on NSE",
		"description": "HLV Ltd.,  HPL Electric Power,  Axita Cotton,  Salasar Techno Engg and  Hindustan Foods, hit their fresh 52-week highs at 10:04AM.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/stock-market-update-stocks-that-hit-52-week-highs-on-nse/articleshow/95902510.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-78620279,width-1070,height-580,imgsize-275381,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669869252000,
		"content": "Indices hit Fresh Highs on Strong Liquidity Flows Indian equities surged to fresh records on Wednesday as a spurt in the last half hour of trade helped the Sensex surpass 63,000 for the first time.\r\n… [+594 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Stock market \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "Sensex gains 350 points, hits fresh record high; Nifty above 18,850; TechM rises 2%",
		"description": "Sensex surges 350 pts, hits fresh record high; Nifty above 18,850; TechM, Infy rise 2% each; RVNL, Tata Steel, PNB among most active stocks on NSE.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-gains-350-points-hits-fresh-record-high-nifty-above-18850-techm-rises-2/videoshow/95902331.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95902331,width-1070,height-580,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669868962000,
		"content": "Sensex surges 350 pts, hits fresh record high; Nifty above 18,850; TechM, Infy rise 2% each; RVNL, Tata Steel, PNB among most active stocks on NSE.",
		"titleScore": 6,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Share market update: Most active stocks of the day in terms of total traded value",
		"description": "The NSE Nifty index was trading 86.9 points  up  at 18845.25",
		"url": "https://economictimes.indiatimes.com/markets/stocks/stock-watch/share-market-update-most-active-stocks-of-the-day-in-terms-of-total-traded-value/articleshow/95902312.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-83771694,width-1070,height-580,imgsize-185726,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669868946000,
		"content": "Indices hit Fresh Highs on Strong Liquidity Flows Indian equities surged to fresh records on Wednesday as a spurt in the last half hour of trade helped the Sensex surpass 63,000 for the first time.\r\n… [+594 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Share market \n update: Most active stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Why Tech Stocks Meta Platforms, Etsy, and Airbnb All Popped Today",
		"description": "What happened Shares of Meta Platforms (META 7.89%), Etsy (ETSY 8.38%), and Airbnb (ABNB 7.09%) were catching an afternoon breeze after Federal Reserve Chair Jerome Powell made dovish remarks in a speech today. That sent stocks higher broadly, especially the …",
		"url": "https://biztoc.com/x/92f3101727f5f814",
		"urlToImage": "https://c.biztoc.com/p/92f3101727f5f814/og.webp",
		"publishedAt": 1669868648000,
		"content": "What happened\r\nShares of Meta Platforms (META 7.89%), Etsy (ETSY 8.38%), and Airbnb (ABNB 7.09%) were catching an afternoon breeze after Federal Reserve Chair Jerome Powell made dovish remarks in a s… [+937 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "SI Reporter",
		"title": "Nifty IT index surges 2%; Infy, TCS, Tech Mahindra, Coforge gain up to 3%",
		"description": "The US market ended higher overnight, led by gains in technology stocks, after US Federal Reserve chairman indicated that the central bank may slow pace of rate hikes. Nasdaq Composite jumped 4.4%",
		"url": "https://www.business-standard.com/article/markets/nifty-it-index-surges-2-infy-tcs-tech-mahindra-coforge-gain-up-to-3-122120100235_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-07/22/full/1626963288-7065.jpg",
		"publishedAt": 1669868566000,
		"content": "Shares of information technology (IT) companies were in focus on Thursday with the Nifty IT index surging 2 per cent on the National Stock Exchange (NSE) in the intra-day trade. The rally comes after… [+2246 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "AFP",
		"title": "Asian stocks join global rally and dollar drops on Fed rate joy",
		"description": "Asian stocks extended a global rally Thursday and the dollar fell after Federal Reserve boss Jerome Powell flagged a slowdown in the pace of interest rate hikes and China opened the way for a softer approach to fighting Covid.",
		"url": "https://timesofindia.indiatimes.com/business/international-business/asian-stocks-join-global-rally-and-dollar-drops-on-fed-rate-joy/articleshow/95902017.cms",
		"urlToImage": "https://static.toiimg.com/thumb/msid-95902646,width-1070,height-580,imgsize-69854,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
		"publishedAt": 1669868080000,
		"content": "",
		"titleScore": 4,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Is It Time To Buy Gold Stocks As Gold Mining Stocks Surge? Here's What Charts Show",
		"description": "Gold stocks hold a valuable place in asset allocation for investors, especially in times of high inflation and economic uncertainty. Investing in gold can be tricky, but one of the best investments to gain exposure to gold is through the S&P Gold Shares ETF (…",
		"url": "https://biztoc.com/x/ef1070fff927492d",
		"urlToImage": "https://c.biztoc.com/p/ef1070fff927492d/og.webp",
		"publishedAt": 1669868045000,
		"content": "Gold stocks hold a valuable place in asset allocation for investors, especially in times of high inflation and economic uncertainty. Investing in gold can be tricky, but one of the best investments t… [+946 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Stocks Rally on China Covid, Powell; Dollar Slides: Markets Wrap",
		"description": "(Bloomberg) -- Stocks extended gains in Asia after China appeared to soften is Covid stance and Federal Reserve Chair Jerome Powell signaled a slowdown in the pace of interest-rate hikes. Most Read from Bloomberg The dollar fell against most of its Group-of-1…",
		"url": "https://biztoc.com/x/106e50b3aeacbe4c",
		"urlToImage": "https://c.biztoc.com/p/106e50b3aeacbe4c/og.webp",
		"publishedAt": 1669868044000,
		"content": "(Bloomberg) -- Stocks extended gains in Asia after China appeared to soften is Covid stance and Federal Reserve Chair Jerome Powell signaled a slowdown in the pace of interest-rate hikes.\r\nMost Read … [+961 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "indiatimes.com",
		"title": "Deven Choksey on Kirit Parekh report & impact on oil & gas stocks",
		"description": "Related Is it a good time to buy into GMR Airports considering that Adani airport IPO will happen in next 12 to 18 months? There was a buzz that Bangalore airport could see an M&A deal and now air traffic is also going higher? A disclaimer, we do not cover GM…",
		"url": "https://biztoc.com/x/f37c5a59deaa164c",
		"urlToImage": "https://c.biztoc.com/p/f37c5a59deaa164c/og.webp",
		"publishedAt": 1669867806000,
		"content": "Related\r\nIs it a good time to buy into GMR Airports considering that Adani airport IPO will happen in next 12 to 18 months? There was a buzz that Bangalore airport could see an M&amp;A deal and now a… [+947 chars]",
		"titleScore": 0,
		"titleMarketGrams": "oil & gas stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Agencies",
		"title": "Brokerages initiate coverage on these 8 stocks, see up to 155% upside scope",
		"description": "A host of brokerage firms have initiated coverage on a number of stocks across various sectors, including infrastructure, banking, gold loan, textile and QSR. They majorly have a positive view on these counters and see an upside potential of 155% in these sto…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/brokerages-initiate-coverage-on-these-8-stocks-see-up-to-155-upside-scope/initiating-coverage/slideshow/95902060.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95902060,width-1070,height-580,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669867510000,
		"content": "Rating: Buy | Target Price: Rs 230 | Upside Potential: 4%Mishra Dhatu Nigams (Midhani) Q2FY23 performance was steadily led by higher scrap utilisation. \"We see exciting prospects from the wide plate … [+363 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "ValueWalk",
		"title": "5 Top ESG Stocks For 2022 And The Outlook For 2023",
		"description": "ESG reporting policies and standardization has taken off over the last decade, promoting investors to park their cash in ESG stocks. Here are 5 of my top picks.",
		"url": "https://seekingalpha.com/article/4561604-5-top-esg-stocks-for-2022-and-the-outlook-for-2023",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1402625152/image_1402625152.jpg?io=getty-c-w750",
		"publishedAt": 1669867377000,
		"content": "Alistair Berg\r\nInvestors and shareholders have endured a tumultuous year on the market as overall sentiment sinks lower into bear territory. As macroeconomic problems persist, from out-of-control inf… [+8954 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Chinese Stocks in Hong Kong Jump, Capping Best Month Since 2003",
		"description": "Chinese Stocks in Hong Kong Jump, Capping Best Month Since 2003 Bloomberg #kongjump #hongkong #jump #capping #hong #kong",
		"url": "https://biztoc.com/x/efc73e4116e0b025",
		"urlToImage": "https://c.biztoc.com/71/og.png",
		"publishedAt": 1669867325000,
		"content": "Chinese Stocks in Hong Kong Jump, Capping Best Month Since 2003 Bloomberg \r\n#kongjump#hongkong#jump#capping#hong#kong\r\n This story appeared first on bloomberg.com, 2022-11-30.",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Moneycontrol"
		},
		"author": "Vishal Wagh",
		"title": "Nifty likely headed to 19,000 mark post-weekly expiry; bet on these 2 stocks for decent returns",
		"description": "The Nifty is trading in uncharted territory, so theoretically, the upper side is unlimited.",
		"url": "https://www.moneycontrol.com/news/business/markets/nifty-likely-headed-to-19000-mark-post-weekly-expiry-bet-on-these-2-stocks-for-decent-returns-9629591.html",
		"urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/sensex1-1-770x433.jpg",
		"publishedAt": 1669867218000,
		"content": "Vishal Wagh, Head of Research at Bonanza Portfolio\r\nThe Nifty 50 closed at 18,758.35 with a gain of about 140 points on November 30 and formed a bullish candlestick on a daily scale. In all time fram… [+3342 chars]",
		"titleScore": 2,
		"titleMarketGrams": "on these 2 stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Chosun.com"
		},
		"author": "By Kwon Soon-wan( )",
		"title": "KOSPI Rebounds as Foreign Investors Snap up Shares",
		"description": "Foreign investors snapped up more than W6 trillion worth of Korean shares in October and November of this year, spearheading a rebound of the benchmark Korea Composite Stock Price Index (US$1=W1,319). Foreign investors appear to have gone bargain-hunting for …",
		"url": "https://english.chosun.com/site/data/html_dir/2022/12/01/2022120101545.html",
		"urlToImage": "https://english.chosun.com/site/data/img_dir/2022/12/01/2022120101543_0.jpg",
		"publishedAt": 1669867130000,
		"content": "Foreign investors snapped up more than W6 trillion worth of Korean shares in October and November of this year, spearheading a rebound of the benchmark Korea Composite Stock Price Index (US$1=W1,319)… [+1137 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Nikhil Agarwal",
		"title": "Sensex at record high but over 200 stocks are trading below 5-year average PE level. Should you buy?",
		"description": "In the financials basket, HDFC Bank, ICICI Bank, SBI, HDFC, Bajaj Finance, Kotak Mahindra Bank and Axis Bank are also on the list. However, while evaluating banks and other lenders, price-to-book value (P/B) is more appropriate than PE as banks earn income ba…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-at-record-high-but-over-200-stocks-are-trading-below-5-year-average-pe-level-should-you-buy/articleshow/95901535.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95901639,width-1070,height-580,imgsize-655876,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669866809000,
		"content": "NEW DELHI: Taking the prices of many stocks to record high levels, Sensex and Nifty are now trading in uncharted territory. But over 200 stocks, including D-Street favourites , HUL and , are still be… [+2761 chars]",
		"titleScore": 0,
		"titleMarketGrams": "but over 200 stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "247wallst.com",
		"title": "Top 10 Emerging Markets Stocks With Fund Managers Over November",
		"description": "Emerging Market Stocks provide investors with the ability to access a greater pool of companies to choose from in a wider range of sectors across the globe. Fund managers frequently use emerging market exposure to seek attractive opportunities that may not be…",
		"url": "https://biztoc.com/x/01b1b6399c73119e",
		"urlToImage": "https://c.biztoc.com/p/01b1b6399c73119e/og.webp",
		"publishedAt": 1669866487000,
		"content": "Emerging Market Stocks provide investors with the ability to access a greater pool of companies to choose from in a wider range of sectors across the globe.\r\nFund managers frequently use emerging mar… [+977 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "China tech stocks have 'a lot of upside' and peak regulation is over, fund management firm says",
		"description": "The Chinese government is unlikely to introduce new regulations for the internet tech sector, according to Jonathan Krane of KraneShares. - He said the rules introduced in recent years were meant to create long-term stability in the sector. - Ramiz Chelat of …",
		"url": "https://biztoc.com/x/81021c6b008b572a",
		"urlToImage": "https://c.biztoc.com/p/81021c6b008b572a/og.webp",
		"publishedAt": 1669866485000,
		"content": "The Chinese government is unlikely to introduce new regulations for the internet tech sector, according to Jonathan Krane of KraneShares.\r\n- He said the rules introduced in recent years were meant to… [+962 chars]",
		"titleScore": 0,
		"titleMarketGrams": "China tech stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stocks to buy today: 9 short-term trading ideas by experts for 1 December 2022",
		"description": "​The S&P BSE Sensex topped 63,000 while the Nifty50 also hit 18,700 levels on Wednesday.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-9-short-term-trading-ideas-by-experts-for-1-december-2022/articleshow/95901529.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95901517,width-1070,height-580,imgsize-523157,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669866367000,
		"content": "The Indian market is likely to trade higher on Thursday tracking positive global cues.\r\nThe S&amp;P BSE Sensex topped 63,000 while the Nifty50 hit 18,700 levels on Wednesday.\r\nWe have collated stocks… [+981 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Fintel.io"
		},
		"author": "247patrick",
		"title": "Top 10 Emerging Markets Stocks With Fund Managers Over November",
		"description": "Here is a look at the top 10 emerging markets stocks with fund managers in November.",
		"url": "https://fintel.io/news/these-stocks-emerging-markets-stocks-had-the-greatest-fund-flows-for-november",
		"urlToImage": "https://247wallst.com/wp-content/uploads/2021/03/imageForEntry7-pkV.jpg",
		"publishedAt": 1669866106000,
		"content": "Emerging Market Stocks provide investors with the ability to access a greater pool of companies to choose from in a wider range of sectors across the globe.\r\nFund managers frequently use emerging mar… [+5627 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "Deven Choksey on Kirit Parekh report & impact on oil & gas stocks",
		"description": "\"Keeping of floor rate at $4 per MMBtu is basically giving a good sense for the exploration companies, as a result of which the downside seems protected at this point of time and gradually moving into the open market, prices from 2027 onwards is again suggest…",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/deven-choksey-on-kirit-parekh-report-impact-on-oil-gas-stocks/articleshow/95890648.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95890665,width-1070,height-580,imgsize-22846,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669866060000,
		"content": "Two things are working favourably for at this point of time. I think the windfall tax impact will come down with the fall in the crude oil prices as a result of which, that particular saving would be… [+4771 chars]",
		"titleScore": 0,
		"titleMarketGrams": "oil & gas stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "CNBC"
		},
		"author": "Abigail Ng",
		"title": "China tech stocks have 'a lot of upside' and peak regulation is over, fund management firm says",
		"description": "The Chinese government is unlikely to introduce new regulations for the internet tech sector, according to Jonathan Krane of KraneShares.",
		"url": "https://www.cnbc.com/2022/12/01/china-internet-firms-have-seen-peak-regulation-kraneshares.html",
		"urlToImage": "https://image.cnbcfm.com/api/v1/image/107158826-1669798966315-gettyimages-1240929070-SHANGHAI_COVID.jpeg?v=1669865446&w=1920&h=1080",
		"publishedAt": 1669865713000,
		"content": "The Chinese government is unlikely to introduce new regulations for the internet tech sector and there could be more support going forward, according to Jonathan Krane of KraneShares.\r\n\"I think we've… [+2031 chars]",
		"titleScore": 0,
		"titleMarketGrams": "China tech stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "Upside surprise left as we go into 2023; IT has decoupled in some way from US slowdown: Ridham Desai",
		"description": "“Raising liabilities will be the key distinguishing factor across the banking sector when you are picking stocks. Banks that nail liabilities will outperform. Raising liabilities is more than a branch network. It is about having technology and customer servic…",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/upside-surprise-left-as-we-go-into-2023-it-has-decoupled-in-some-way-from-us-slowdown-ridham-desai/articleshow/95890432.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95890463,width-1070,height-580,imgsize-21024,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669865460000,
		"content": "I think we are in a structural BOP surplus position because the amount of capital that is going to come to India is going to be far in excess of what we need as defined by our saving deficit or our c… [+7686 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Kshitij Anand",
		"title": "ETMarkets Smart Talk: We stick to Roots and Wings approach to pick stocks in 2023: Ram Kalyan Medury",
		"description": "\"With all the structural reforms in place and focus on infrastructure, and manufacturing incentives, we expect earnings growth to continue. The impact of higher input costs due to inflation has likely abated. One of the leading brokerages projected a 15% grow…",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-we-stick-to-roots-and-wings-approach-to-pick-stocks-in-2023-ram-kalyan-medury/articleshow/95890221.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95890268,width-1070,height-580,imgsize-21784,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669865400000,
		"content": "The Investment philosophy does not change with market movements we prefer to stick to Roots and Wings as the way to go, says Ram Kalyan Medury, Founder &amp; CEO, at Jama Wealth.In an interview with … [+4030 chars]",
		"titleScore": 1,
		"titleMarketGrams": "approach to pick stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "FRANCE 24 English"
		},
		"author": "FRANCE24",
		"title": "French fishing ban unites fishermen, biodiversity activists",
		"description": "Almost two decades after the ban, Cap Roux, a coastal tip of the Esterel mountain range near the resort of Saint-Raphael on the Mediterranean coast, is a biodiversity haven. \n\nIt stands in stark contrast to many other places on the Cote d'Azur where unbridled…",
		"url": "https://www.france24.com/en/live-news/20221201-french-fishing-ban-unites-fishermen-biodiversity-activists",
		"urlToImage": "https://s.france24.com/media/display/17e89c0e-7127-11ed-a28a-005056bf30b7/w:1280/p:16x9/923fdd888869c92e6e305e43abb536b7da0a63e1.jpg",
		"publishedAt": 1669864824000,
		"content": "Saint-Raphael (France) (AFP) A local fishing ban off the southern French coast has won praise from environmentalists and fishermen alike, a rare example of biodiversity protection dovetailing with bu… [+3446 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "International Business Times"
		},
		"author": "AFP News",
		"title": "Asian Stocks Join Global Rally And Dollar Drops On Fed Rate Joy",
		"description": "Asian stocks join global rally and dollar drops on Fed rate joy",
		"url": "https://www.ibtimes.com/asian-stocks-join-global-rally-dollar-drops-fed-rate-joy-3642145",
		"urlToImage": "https://d.ibtimes.com/en/full/4389151/hong-kong-led-rally-across-asia-after-jerome-powells-dovish-speech-hopes-easing-chinas.jpg",
		"publishedAt": 1669864534000,
		"content": "Hong Kong led the rally across Asia after Jerome Powell's dovish speech and on hopes for an easing of China's Covid policy\r\nAsian stocks extended a global rally Thursday and the dollar fell after Fed… [+4176 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "gumroad.com",
		"title": "The Rational Investor: The Ultimate Stock Research Framework",
		"description": "Does the idea of researching individual stocks seem overwhelming? Are you confused where to even start with your research? Do you want an easy to follow research framework to help you make smarter investment decisions? Then this course is for you! In this cou…",
		"url": "https://biztoc.com/x/e258a2b4570f3ee6",
		"urlToImage": "https://c.biztoc.com/p/e258a2b4570f3ee6/og.webp",
		"publishedAt": 1669864447000,
		"content": "Does the idea of researching individual stocks seem overwhelming?\r\nAre you confused where to even start with your research?\r\nDo you want an easy to follow research framework to help you make smarter … [+971 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Reuters",
		"title": "Asian stocks jump after Powell hints at rate hike slowdown",
		"description": "In an eagerly-awaited speech, Powell said the central bank could scale back the pace of its interest rate hikes \"as soon as December,\" but cautioned that the fight against inflation was far from over.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/global-markets-asian-stocks-jump-after-powell-hints-at-rate-hike-slowdown/articleshow/95900744.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95900798,width-1070,height-580,imgsize-73268,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669864116000,
		"content": "Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tighteni… [+2729 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Dansdeals.com"
		},
		"author": "Mimi",
		"title": "GParency Onboards 150 New Salespeople And Is Looking To Hire 100 More!",
		"description": "Please note: This is a stickied sponsored post, please scroll down for new posts. GParency Onboards 150 New Salespeople And Is Looking To Hire 100 More! New Part-time and Full-time hires will earn commission, stocks and a $50k-$100K salary guarantee the first…",
		"url": "https://www.dansdeals.com/advertisement/gparency-onboards-150-new-salespeople-looking-hire-100/",
		"urlToImage": "https://i.dansdeals.com/wp-content/uploads/2022/11/30205530/WhatsApp-Image-2022-11-30-at-8-compressed.jpg",
		"publishedAt": 1669863873000,
		"content": "Please note: This is a stickied sponsored post, please scroll down for new posts.\r\nGParency Onboards 150 New Salespeople And Is Looking To Hire 100 More!\r\nNew Part-time and Full-time hires will earn … [+2526 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "Reuters",
		"title": "Asian stocks jump after US Fed chair Powell hints at rate hike slowdown",
		"description": "Powell's comments at the Brookings Institution in Washington sent Wall Street equities soaring, while the U.S. dollar and Treasury yields fell",
		"url": "https://www.business-standard.com/article/international/asian-stocks-jump-after-us-fed-chair-powell-hints-at-rate-hike-slowdown-122120100158_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-10/05/full/1664948057-3655.jpg",
		"publishedAt": 1669863480000,
		"content": "By Ankur Banerjee\r\nSINGAPORE (Reuters) - Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a … [+3004 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "Rex Cano",
		"title": "Stocks to Watch: TCS, KPI Green, Siemens, Alstom India, Apollo Hospitals",
		"description": "Stocks to Watch Today: In the F&O space, BHEL, Delta Corp, Indiabulls Housing Finance and PNB are the stocks in ban period on Thursday.",
		"url": "https://www.business-standard.com/article/markets/stocks-to-watch-today-tcs-kpi-green-siemens-alstom-india-apollo-hospitals-ril-asian-paints-122120100150_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-09/12/full/1631463208-1967.jpg",
		"publishedAt": 1669863120000,
		"content": "Stocks to Watch Today: The key benchmark indices are likely to start trade on a buoyant note tracking strong gains in global peers. Overnight, the US markets rallied up to 4 per cent after US Federal… [+2937 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "Asian stocks jump after Powell hints at rate hike slowdown By Reuters",
		"description": "By Ankur Banerjee SINGAPORE (Reuters) - Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tightening. In an eagerly-aw…",
		"url": "https://biztoc.com/x/a54dea765759d9d3",
		"urlToImage": "https://c.biztoc.com/p/a54dea765759d9d3/og.webp",
		"publishedAt": 1669863004000,
		"content": "By Ankur Banerjee\r\nSINGAPORE (Reuters) - Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a … [+967 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "International Business Times"
		},
		"author": "Ankur Banerjee",
		"title": "Asian Stocks Jump After Powell Hints At Rate Hike Slowdown",
		"description": "Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tightening.",
		"url": "https://www.ibtimes.com/asian-stocks-jump-after-powell-hints-rate-hike-slowdown-3642132",
		"urlToImage": "https://d.ibtimes.com/en/full/4389138/electronic-board-shows-shanghai-shenzhen-stock-indexes-shanghai.jpg",
		"publishedAt": 1669862739000,
		"content": "An electronic board shows Shanghai and Shenzhen stock indexes, at the Lujiazui financial district, following the coronavirus disease (COVID-19) outbreak, in Shanghai, China November 14, 2022. \r\nAsian… [+2979 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "benzinga.com",
		"title": "Alibaba, Nio Stocks Surge Over 7%: Hang Seng Index Today",
		"description": "Hong Kong stocks soared on Thursday with the benchmark Hang Seng opening 2.47% higher following Federal Reserve Chair Jerome Powell’s speech that indicated the central bank may slow the pace of rate hikes as soon as December. EV stocks surged, with Xpeng shar…",
		"url": "https://biztoc.com/x/eab1695333956163",
		"urlToImage": "https://c.biztoc.com/p/eab1695333956163/og.webp",
		"publishedAt": 1669862646000,
		"content": "Hong Kong stocks soared on Thursday with the benchmark Hang Seng opening 2.47% higher following Federal Reserve Chair Jerome Powells speech that indicated the central bank may slow the pace of rate h… [+941 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Moneycontrol"
		},
		"author": "Reuters",
		"title": "Asian stocks jump after Jerome Powell hints at rate hike slowdown",
		"description": "In an eagerly-awaited speech, Powell said the central bank could scale back the pace of its interest rate hikes &quot;as soon as December,&quot; but cautioned that the fight against inflation was far from over.",
		"url": "https://www.moneycontrol.com/news/business/markets/asian-stocks-jump-after-jerome-powell-hints-at-rate-hike-slowdown-9630261.html",
		"urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/07/Asian-Markets-770x433.jpg",
		"publishedAt": 1669862372000,
		"content": "Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tighteni… [+2729 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "reuters.com",
		"title": "Asian stocks jump after Powell hints at rate hike slowdown",
		"description": "SINGAPORE, Dec 1 (Reuters) - Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tightening. In an eagerly-awaited speec…",
		"url": "https://biztoc.com/x/b72ab48bee1631b1",
		"urlToImage": "https://c.biztoc.com/p/b72ab48bee1631b1/og.webp",
		"publishedAt": 1669862285000,
		"content": "SINGAPORE, Dec 1 (Reuters) - Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in … [+988 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "Stocks in focus: Zomato, Paytm and more",
		"description": "Nifty futures on the Singapore Exchange traded 68 points or 0.36% higher at 18,984.50 around 7 am, signalling a positive start for Dalal Street. Here are some stocks which may buzz the most in today's trade.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-focus-zomato-paytm-and-more/videoshow/95899683.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95899683,width-1070,height-580,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669862277000,
		"content": "Nifty futures on the Singapore Exchange traded 68 points or 0.36% higher at 18,984.50 around 7 am, signalling a positive start for Dalal Street. Here are some stocks which may buzz the most in today'… [+7 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "FX Empire"
		},
		"author": "Reuters",
		"title": "Asian stocks jump after Powell hints at rate hike slowdown",
		"description": "By Ankur Banerjee SINGAPORE (Reuters) -   Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tightening.",
		"url": "https://www.fxempire.com/news/article/asian-stocks-jump-after-powell-hints-at-rate-hike-slowdown-1215731",
		"urlToImage": "https://responsive.fxempire.com/width/600/webp-lossy-70.q50/_fxempire_/2022/12/tagreuters.com2022newsml_LYNXMPEIB01DO1.jpg",
		"publishedAt": 1669862201000,
		"content": "In an eagerly-awaited speech, Powell said the central bank could scale back the pace of its interest rate hikes as soon as December, but cautioned that the fight against inflation was far from over.\r… [+2581 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": "reuters",
			"name": "Reuters"
		},
		"author": null,
		"title": "Asian stocks jump after Powell hints at rate hike slowdown",
		"description": "Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tightening.",
		"url": "https://www.reuters.com/markets/global-markets-wrapup-1-2022-12-01/",
		"urlToImage": "https://www.reuters.com/resizer/M2VkwuMvylqNZUOyPAai9nU-UI4=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/324ZZ2MP2JOZXC75YIS5XTN7QE.jpg",
		"publishedAt": 1669862069000,
		"content": "SINGAPORE, Dec 1 (Reuters) - Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in … [+2922 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "CNA"
		},
		"author": null,
		"title": "Asian stocks jump after Powell hints at rate hike slowdown",
		"description": "SINGAPORE : Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monetary tightening.In an eagerly-awaited speech, Powell said the…",
		"url": "https://www.channelnewsasia.com/business/asian-stocks-jump-after-powell-hints-rate-hike-slowdown-3114406",
		"urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--qQYHlR5Z--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2022-12-01t023359z_1_lynxmpeib01do_rtroptp_3_global-markets.jpg?itok=v1cIGn-G",
		"publishedAt": 1669862039000,
		"content": "SINGAPORE : Asian equities jumped on Thursday, while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace of monet… [+2886 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "CNA"
		},
		"author": null,
		"title": "Asian stocks jump after Fed chair hints at rate hike slowdown",
		"description": "SINGAPORE: Asian equities jumped on Thursday (Dec 1), while the dollar slid as investors poured into risky assets after Federal Reserve Chair Jerome Powell opened the door to a slowdown in the pace",
		"url": "https://www.channelnewsasia.com/business/asian-stocks-jump-equities-federal-reserve-powell-fed-chair-interest-rate-3114406",
		"urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--qQYHlR5Z--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2022-12-01t023359z_1_lynxmpeib01do_rtroptp_3_global-markets.jpg?itok=v1cIGn-G",
		"publishedAt": 1669861980000,
		"content": "Mainland China stocks opened up 1.2 per cent and Hong Kong shares rose 2.5 per cent in early trade after they closed higher on Wednesday following the easing of COVID-19 measures in Guangzhou city.\r\n… [+1196 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Asian stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Rappler"
		},
		"author": "Reuters",
		"title": "Stocks rally, yields and dollar fall as Powell signals slower hikes",
		"description": "US Federal Reserve Chair Jerome Powell's words are a relief for investors who had feared more hawkishness",
		"url": "https://www.rappler.com/business/updates-global-stock-markets-currencies-oil-prices-november-30-2022/",
		"urlToImage": "https://www.rappler.com/tachyon/2022/12/stock-market-november-21-2022-reuters-002.jpg",
		"publishedAt": 1669861517000,
		"content": "NEW YORK, USA Wall Street equities closed sharply higher on Wednesday, November 30, while US Treasury yields declined and the dollar sank after Federal Reserve Chair Jerome Powell said the central ba… [+3511 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Post Magazine"
		},
		"author": "Zhang Shidong, Zhang Shidong",
		"title": "Hong Kong stocks rise to three-month high following US rally after Fed signals more moderate rate stance",
		"description": "Hong Kong stocks rose to an almost three-month high after the US Federal Reserve signalled it will slow the pace of interest-rate increases, bolstering investors’ appetite for risk assets.",
		"url": "https://www.scmp.com/business/china-business/article/3201625/hong-kong-stocks-rise-three-month-high-following-us-rally-after-fed-signals-more-moderate-rate",
		"urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2022/12/01/ab34b539-8960-4624-98d4-5965b0c5fb62_114c45a8.jpg?itok=BxZIdrE-&v=1669861429",
		"publishedAt": 1669861435000,
		"content": "Published: 10:23am, 1 Dec, 2022\r\nUpdated: 10:23am, 1 Dec, 2022",
		"titleScore": 1,
		"titleMarketGrams": "Hong Kong stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Stocks trending after hours: Salesforce, Okta, Snowflake and more",
		"description": "Salesforce (CRM): Salesforce co-CEO and vice chair Bret Taylor is stepping down as of January 31, 2023, the company announced in its earnings release Wednesday. Co-founder Marc Benioff will become Salesforce's solo CEO. For its third quarter, Salesforce repor…",
		"url": "https://biztoc.com/x/6d21170a01331e1c",
		"urlToImage": "https://c.biztoc.com/p/6d21170a01331e1c/og.webp",
		"publishedAt": 1669860727000,
		"content": "Salesforce (CRM): Salesforce co-CEO and vice chair Bret Taylor is stepping down as of January 31, 2023, the company announced in its earnings release Wednesday. Co-founder Marc Benioff will become Sa… [+949 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool Australia"
		},
		"author": "Tony Yoo",
		"title": "Climate and energy: Analyst tips 2 ASX shares perfectly placed for global crises",
		"description": "Ask A Fund Manager: Bell Direct's Grady Wulff names a pair of stocks that may surprise you with their green credentials.\nThe post Climate and energy: Analyst tips 2 ASX shares perfectly placed for global crises appeared first on The Motley Fool Australia.",
		"url": "https://www.fool.com.au/2022/12/01/climate-and-energy-analyst-tips-2-asx-shares-perfectly-placed-for-global-crises/",
		"urlToImage": "https://www.fool.com.au/wp-content/uploads/2022/12/Grady-Wulff-headshot_Bell-Direct-16_9.jpg",
		"publishedAt": 1669860000000,
		"content": "The Motley Fool chats with the best in the industry so that you can get an insight into how the professionals think. In this edition, Bell Direct market analyst Grady Wulff picks two ASX shares that … [+3198 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Livemint"
		},
		"author": "Livemint",
		"title": "Stocks to Watch: TCS, NDTV, IEX, Adani Power, IDFC, ONGC | Mint - Mint",
		"description": "<ol><li>Stocks to Watch: TCS, NDTV, IEX, Adani Power, IDFC, ONGC | Mint  Mint\r\n</li><li>Stocks in news: TCS, Wipro, Adani Power, KPI Green and more  Business Today\r\n</li><li>Stocks in the news: TCS, AB Fashion, HCL Tech, BSE, Lupin and Ami Organics  Economic …",
		"url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-tcs-ndtv-iex-adani-power-idfc-ongc-11669855480889.html",
		"urlToImage": "https://images.livemint.com/img/2022/12/01/600x338/40cfde44a33c403fb7f363284fb2f53b-40cfde44a33c403fb_1669855534471_1669855534655_1669855534655.jpg",
		"publishedAt": 1669859897000,
		"content": "Tata Consultancy Services: IT major Tata Consultancy Services on Wednesday said that it has bagged a deal from Rail Delivery Group to design, develop, implement, and operate the UK's Rail Data Market… [+4560 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Stocks in the news: TCS, Wipro, NMDC, Apollo Hospitals, Zomato and Adani Power",
		"description": "Tata Consultancy Services has bagged a deal from Rail Delivery Group to design, develop, implement, and operate the UK's Rail Data Marketplace. The contract between TCS and RDG is for a term of six years.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-the-news-tcs-wipro-nmdc-apollo-hospitals-zomato-and-adani-power/articleshow/95899011.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95899009,width-1070,height-580,imgsize-88698,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669859442000,
		"content": "Nifty futures on the Singapore Exchange traded 69.5 points, or 0.37% higher at 18,986, signaling that Dalal Street was headed for a positive start on Thursday. Here are a dozen stocks which may buzz … [+3537 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "SGX Nifty gains 70 points; here's what changed for market while you were sleeping",
		"description": "Stocks in Asia extended gains following a sharp rally on Wall Street after Federal Reserve Chair Jerome Powell signaled a slowdown in the pace of rate hikes. Japanese equities rose, Australians shares headed for a seven-month high and US and Hong Kong futures…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/sgx-nifty-gains-70-points-heres-what-changed-for-market-while-you-were-sleeping/articleshow/95898943.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95898937,width-1070,height-580,imgsize-77238,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669858812000,
		"content": "Following a sharp rise in US stocks overnight and upbeat sentiments in Asian peers on positive comments from US Fed chair Jerome Powell, Indian equity indices too seemed set to extend their winning s… [+3662 chars]",
		"titleScore": 4,
		"titleMarketGrams": "what changed for market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Up More Than 300%: 3 Monster Growth Stocks Flying Under the Radar",
		"description": "For the past couple of months or so, the markets have mostly been trending upwards. However, such has been the strength of 2022’s inflation-driven/interest-rate-hiking environment that all the major indexes are still showing year-to date losses. As a result, …",
		"url": "https://biztoc.com/x/9a72c5ac65bc26eb",
		"urlToImage": "https://c.biztoc.com/p/9a72c5ac65bc26eb/og.webp",
		"publishedAt": 1669858804000,
		"content": "For the past couple of months or so, the markets have mostly been trending upwards. However, such has been the strength of 2022s inflation-driven/interest-rate-hiking environment that all the major i… [+922 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "TheStreet"
		},
		"author": "Tom Bemis",
		"title": "U.S. Stock Movers of Note: Buffett Holding StoneCo; Gold Stocks",
		"description": "Powell comments spark late rally on hopes interest rate hikes will ease.",
		"url": "https://www.thestreet.com/investing/stocks/u-s-stock-movers-of-note-buffett-holding-stoneco-gold-stocks",
		"urlToImage": "https://www.thestreet.com/.image/t_share/MTgyMDk5MjE2NjExNDE5MjY3/warren-buffett_2.jpg",
		"publishedAt": 1669858680000,
		"content": "Stocks rose Wednesday after dovish comments from Fed Chairman Jerome Powell.\r\nThe Dow Jones Industrial Average rose 737.24, or 2.18% to 34,589.77.\r\nThe S&amp;P 500 rose 122.48, or 3.09% to 4,080.11. … [+3813 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Moneycontrol"
		},
		"author": "Kunal Shah",
		"title": "Hot Stocks | Here is why you should bet on UltraTech Cement, Colgate-Palmolive, Bharat Dynamics for short term",
		"description": "Bharat Dynamics has given a falling trend line breakout with a rise in volumes on the daily chart. The momentum indicator RSI has also given a positive crossover which confirms the buy signal on the daily chart.",
		"url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-bet-on-ultratech-cement-colgate-palmolive-bharat-dynamics-for-short-term-9628031.html",
		"urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/11/stocks_sensex_nifty_stockmarket-770x433.jpg",
		"publishedAt": 1669858612000,
		"content": "Kunal Shah, Senior Technical &amp; Derivative Analyst at LKP Securities\r\nThe Nifty made a new all-time high during the day on November 30 as the Nifty bulls remained at the helm during the day. Unlik… [+2621 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "These 20 stocks soared in November with gains of 22% or more after Powell ignites rally",
		"description": "The rally in U.S. stocks accelerated on the last day of November as Federal Reserve Chairman Jerome Powell signaled policy makers might slow the pace of interest-rate increases soon. The S&P 500 SPX, +3.09% ended the day with a 3.1% gain, having risen 5.4% du…",
		"url": "https://biztoc.com/x/f72d4c6967bb0dd9",
		"urlToImage": "https://c.biztoc.com/p/f72d4c6967bb0dd9/og.webp",
		"publishedAt": 1669858564000,
		"content": "The rally in U.S. stocks accelerated on the last day of November as Federal Reserve Chairman Jerome Powell signaled policy makers might slow the pace of interest-rate increases soon.\r\nThe S&amp;P 500… [+1003 chars]",
		"titleScore": 2,
		"titleMarketGrams": "These 20 stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "benzinga.com",
		"title": "Tesla, Amazon, Snowflake, Xpeng, Salesforce: Why These 5 Stocks Are Drawing Investors' Attention Today",
		"description": "Major Wall Street indices soared on Wednesday after Federal Reserve Chair Jerome Powell said the central bank may slow the pace of rate hikes as soon as December while also observing there is a long way to go in bringing down inflation. The Nasdaq closed over…",
		"url": "https://biztoc.com/x/b2915167f2944e04",
		"urlToImage": "https://c.biztoc.com/p/b2915167f2944e04/og.webp",
		"publishedAt": 1669858447000,
		"content": "Major Wall Street indices soared on Wednesday after Federal Reserve Chair Jerome Powell said the central bank may slow the pace of rate hikes as soon as December while also observing there is a long … [+961 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Reuters",
		"title": "US stock market: Wall Street ends sharply higher after Powell comments",
		"description": "\"(The market) has waited with bated breath, looking for that clarification in terms of duration and extent of Fed tightening. And anything that gives hope to the idea the Fed is becoming less hawkish is viewed as a positive for stocks, at least on a short-ter…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-market-wall-street-ends-sharply-higher-after-powell-comments/articleshow/95898759.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95898759,width-1070,height-580,imgsize-17570,overlay-etmarkets/photo.jpg",
		"publishedAt": 1669857578000,
		"content": "Wall Street ended sharply higher on Wednesday after Federal Reserve Chair Jerome Powell said the central bank might scale back the pace of its interest rate hikes as soon as December.\r\nThe S&amp;P 50… [+3197 chars]",
		"titleScore": 0,
		"titleMarketGrams": "US stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Stocks trending after hours: Salesforce, Okta, Snowflake and more",
		"description": "Salesforce (CRM): Salesforce co-CEO and vice chair Bret Taylor is stepping down as of January 31, 2023, the company announced in its earnings release Wednesday. Co-founder Marc Benioff will become Salesforce's solo CEO. For its third quarter, Salesforce repor…",
		"url": "https://biztoc.com/x/1c9a939a2d8e9990",
		"urlToImage": "https://c.biztoc.com/p/1c9a939a2d8e9990/og.webp",
		"publishedAt": 1669857124000,
		"content": "Salesforce (CRM): Salesforce co-CEO and vice chair Bret Taylor is stepping down as of January 31, 2023, the company announced in its earnings release Wednesday. Co-founder Marc Benioff will become Sa… [+949 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "wsj.com",
		"title": "Stocks Gain for Second Month in a Row; Dow Exits Bear Market",
		"description": "Stocks rallied Wednesday after Federal Reserve Chair Jerome Powell signaled a potential slowdown in interest-rate increases, powering the Dow Jones Industrial Average more than 700 points higher and into a new bull market. The S&P 500 and Nasdaq Composite jum…",
		"url": "https://biztoc.com/x/b724a1f738361488",
		"urlToImage": "https://c.biztoc.com/p/b724a1f738361488/og.webp",
		"publishedAt": 1669856887000,
		"content": "Stocks rallied Wednesday after Federal Reserve Chair Jerome Powell signaled a potential slowdown in interest-rate increases, powering the Dow Jones Industrial Average more than 700 points higher and … [+744 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Stocks making the biggest moves after hours: Salesforce, Snowflake, Costco, Five Below and more",
		"description": "Check out the companies making headlines after the bell: Salesforce — Salesforce's stock shed 6.7% despite beating analysts' expectations on both the top and bottom lines after announcing the departure of co-CEO Bret Taylor. Snowflake — The cloud stock tumble…",
		"url": "https://biztoc.com/x/73b10ab278ae6f59",
		"urlToImage": "https://c.biztoc.com/p/73b10ab278ae6f59/og.webp",
		"publishedAt": 1669856885000,
		"content": "Check out the companies making headlines after the bell:\r\nSalesforce Salesforce's stock shed 6.7% despite beating analysts' expectations on both the top and bottom lines after announcing the departur… [+951 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "3 Best-Performing REITs With Dividend Yields Over 8%",
		"description": "Income-oriented investors are always on the lookout for real estate investment trusts (REITs) with high-yielding dividends. But share price performance is also important. Can you have strong dividends as well as price appreciation from the same stocks? Take a…",
		"url": "https://biztoc.com/x/ac5e36492094b06e",
		"urlToImage": "https://c.biztoc.com/p/ac5e36492094b06e/og.webp",
		"publishedAt": 1669856285000,
		"content": "Income-oriented investors are always on the lookout for real estate investment trusts (REITs) with high-yielding dividends. But share price performance is also important. Can you have strong dividend… [+953 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Stocks making the biggest moves after hours: Salesforce, Snowflake, Costco, Five Below and more",
		"description": "Check out the companies making headlines after the bell: Salesforce — Salesforce's stock shed 6.7% despite beating analysts' expectations on both the top and bottom lines after announcing the departure of co-CEO Bret Taylor. Snowflake — The cloud stock tumble…",
		"url": "https://biztoc.com/x/29e26aee94f79704",
		"urlToImage": "https://c.biztoc.com/p/29e26aee94f79704/og.webp",
		"publishedAt": 1669855686000,
		"content": "Check out the companies making headlines after the bell:\r\nSalesforce Salesforce's stock shed 6.7% despite beating analysts' expectations on both the top and bottom lines after announcing the departur… [+951 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "The Edge Markets MY"
		},
		"author": null,
		"title": "Wall St Climbs 20% From Low as Inflation Fears Ebb...",
		"description": "(Dec 1): US stocks surged on Wednesday, putting the blue-chip Dow Jones Industrial Average more than 20% above its September low after Federal Reserve Chair Jerome Powell’s dovish comments and signs of cooling US inflation raised hopes that the central bank w…",
		"url": "https://www.theedgemarkets.com/article/dow-climbs-20-low-stocks-rally-and-inflation-fears-ebb",
		"urlToImage": "https://www.theedgemarkets.com/sites/default/files/default.jpg",
		"publishedAt": 1669855236000,
		"content": "(Dec 1): US stocks surged on Wednesday, putting the blue-chip Dow Jones Industrial Average more than 20% above its September low after Federal Reserve Chair Jerome Powells dovish comments and signs o… [+2737 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Jim Cramer says to use Wednesday’s rally to reposition into profitable stocks",
		"description": "CNBC's Jim Cramer urged investors to use the market's rally on Wednesday to recalibrate their portfolios. - \"Use this moment to pivot yourself. Get out of the stocks I've been railing against for a full year,\" he said. CNBC's Jim Cramer urged investors to use…",
		"url": "https://biztoc.com/x/de1449be0876b732",
		"urlToImage": "https://c.biztoc.com/p/de1449be0876b732/og.webp",
		"publishedAt": 1669854845000,
		"content": "CNBC's Jim Cramer urged investors to use the market's rally on Wednesday to recalibrate their portfolios.\r\n- \"Use this moment to pivot yourself. Get out of the stocks I've been railing against for a … [+948 chars]",
		"titleScore": 2,
		"titleMarketGrams": "reposition into profitable stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "‘God have mercy on us all’: Robert Kiyosaki warns that the economy is the ‘biggest bubble’ in history, urges investors to dump paper assets",
		"description": "2022 has been tough for most investors. Stocks have plunged, bonds have tumbled, and even broad benchmark ETFs are deep in the red. But the worst could be yet to come according to Rich Dad Poor Dad author Robert Kiyosaki. “I believe economy is the biggest bub…",
		"url": "https://biztoc.com/x/e5e5400770990835",
		"urlToImage": "https://c.biztoc.com/p/e5e5400770990835/og.webp",
		"publishedAt": 1669854604000,
		"content": "2022 has been tough for most investors. Stocks have plunged, bonds have tumbled, and even broad benchmark ETFs are deep in the red.\r\nBut the worst could be yet to come according to Rich Dad Poor Dad … [+936 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "The Tell: Here’s what history says about stock market performance in December",
		"description": "U.S. stocks are wrapping up a good November that saw equities to bounce off their 2022 lows set in October, with optimism building that the momentum will cement a year-end rally. Indeed, there’s been a lot of talk about seasonal tailwinds and how they might —…",
		"url": "https://biztoc.com/x/54bcb67021493a9d",
		"urlToImage": "https://c.biztoc.com/p/54bcb67021493a9d/og.webp",
		"publishedAt": 1669853525000,
		"content": "U.S. stocks are wrapping up a good November that saw equities to bounce off their 2022 lows set in October, with optimism building that the momentum will cement a year-end rally.\r\nIndeed, theres been… [+965 chars]",
		"titleScore": 0,
		"titleMarketGrams": "history says about stock \n says about stock market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "seekingalpha.com",
		"title": "Construction Is America's Backbone: 2 Best Industrial Stocks",
		"description": "Summary - Ranked #1 and #2 in Construction Machinery & Heavy Trucks, my two stock picks are up double digits this year, maintaining bullish momentum despite the macroeconomic and geopolitical headwinds. - With tremendous Q3 earnings results, both stocks exper…",
		"url": "https://biztoc.com/x/6ed636ff1fc64043",
		"urlToImage": "https://c.biztoc.com/p/6ed636ff1fc64043/og.webp",
		"publishedAt": 1669853164000,
		"content": "Summary\r\n- Ranked #1 and #2 in Construction Machinery &amp; Heavy Trucks, my two stock picks are up double digits this year, maintaining bullish momentum despite the macroeconomic and geopolitical he… [+966 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Dow Climbs 20% From Low as Stocks Rally and Inflation Fears Ebb",
		"description": "Dow Climbs 20% From Low as Stocks Rally and Inflation Fears Ebb Bloomberg #dowclimbs #inflationfears #fearsebb #climbs #inflation #fears #ebb #dow",
		"url": "https://biztoc.com/x/2c0074cb7b5ddedf",
		"urlToImage": "https://c.biztoc.com/71/og.png",
		"publishedAt": 1669853045000,
		"content": "Dow Climbs 20% From Low as Stocks Rally and Inflation Fears Ebb Bloomberg \r\n#dowclimbs#inflationfears#fearsebb#climbs#inflation#fears#ebb#dow\r\n This story appeared first on bloomberg.com, 2022-11-30.",
		"titleScore": 0,
		"titleMarketGrams": ""
	}
]