[
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Fredrik Arnold",
		"title": "December Dogs Of The Dow Paced By Verizon Yield And Disney Gain Estimates",
		"description": "30 Dow stocks represent nine of eleven sectors. Read more to see the Dow Industrial Index top-ten firms by broker target price upside.",
		"url": "https://seekingalpha.com/article/4562191-december-dogs-of-the-dow-paced-by-verizon-yield-and-disney-gain-estimates",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1186874177/image_1186874177.jpg?io=getty-c-w750",
		"publishedAt": 1670137883000,
		"content": "   feedough/iStock via Getty Images Foreword While more than half this collection of Dow Industrials is too pricey and reveals only skinny dividends, four of the five lowest priced Dogs of the Dow are ready to buy. This month, Verizon Communications Inc (VZ), Dow Inc. (DOW), Intel Corp. (INTC), and Walgreens Boots Alliance (WBA), live up to the dogcatcher ideal of annual dividends from $1K invested exceeding their single share prices. Furthermore, two more, Cisco (CSCO) and Coca-Cola Co (KO) showed its prices within $22 of meeting that goal. When the slide continues watch IBM, MMM, JPM (currently out of the top-five) bubble to the surface. With renewed downside market pressure of 59%, it would be possible for all ten to become elite fair-priced dogs with their annual yield (from $1K invested) meeting or exceeding their single share prices by year's end. [See a summary of top ten fair-priced December Dow Dogs in Actionable Conclusion 21 near the middle of this article.]  Actionable Conclusions (1-10): Brokers Expect 8.33% To 26.62% Net Gains From Top-Ten Dow Dogs By December 2023  Four of ten top dividend-yielding Dow dogs (tinted gray in the chart below) were among the top ten gainers for the coming year based on analyst 1-year target prices. So, this December 2023 yield-based forecast for Dow dogs, as graded by Wall St. wizard estimates, was 40% accurate. Estimated dividend-returns from $1000 invested in the ten highest-yielding stocks and their aggregate one-year analyst median target prices, as reported by YCharts, created the 2022-23 data points for the projections below. (Note: one-year target prices estimated by lone analysts were not applied.) Ten probable profit-generating trades projected to December 2023 were: Source: YCharts.com The Walt Disney Co (DIS) was projected to net $266.18, based on the median of target estimates from 29 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility 80% under the market as a whole. Salesforce Inc (CRM) was projected to net $262.39, based on the median of target price estimates from 45 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility 10% greater than the market as a whole. Verizon Communications Inc was projected to net $249.41, based on dividends, plus the median of target price estimates from 23 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility 62% less than the market as a whole. Apple Inc (AAPL) was forecast to net $173.66, based on the median of target price estimates from 41 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility 22% greater than the market as a whole. Microsoft Corp (MSFT) was projected to net $164.77, based on the median of target price estimates from 44 analysts, plus the estimated annual dividend, less broker fees. The Beta number showed this estimate subject to risk/volatility 7% less than the market as a whole. Visa Inc (V) was projected to net $129.64, based on dividends, plus the median of target price estimates from 32 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility 5% under the market as a whole. Intel Corp was projected to net $129.39 based on the median of target price estimates from 35 analysts, plus dividends, less broker fees. The Beta number showed this estimate subject to risk/volatility 25% less than the market as a whole. Cisco Systems Inc was projected to net $116.74, based on dividends, plus the median target price estimates from 22 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility equal to the market as a whole. 3M Co (MMM) netted $107.40 based on the median of target price estimates from 18 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility 1% greater than the market as a whole. The Home Depot Inc (HD) was projected to net $83.29, based on the median of target prices estimated by 30 analysts, less broker fees. The Beta number showed this estimate subject to risk/volatility4% less than the market as a whole. The average net gain in dividend and price was estimated at 16.83% on $10k invested as $1k in each of these top ten Dow Index stocks. This gain estimate was subject to average risk/volatility 15% less than the market as a whole. Source: Open source dog art from dividenddogcatcher.com The Dividend Dogs Rule Stocks earned the \"dog\" moniker by exhibiting three traits: (1) paying reliable, repeating dividends, (2) their prices fell to where (3) yield (dividend/price) grew higher than their peers. Thus, the highest yielding stocks in any collection became known as \"dogs.\" More precisely, these are, in fact, best called, \"underdogs\".  The December 2022 Dow 30 By Yield  Source: YCharts.com   Actionable Conclusions (11-20): 10 Top Dow Dividend Stocks By Yield Ranged 2.77% To 6.93% Per YCharts   Top ten Dow dogs as of 11/30/22 represented eight of eleven Morningstar sectors. The lone communication services sector member took first place, Verizon [1]. In second place was the lone basic materials dog, Dow Inc [2]. Then three technology dogs placed in the third, sixth, and eighth positions, Intel Corp [3], International Business Machines (IBM) [6], and Cisco Systems Inc [8]. A lone industrials dog was fourth, 3M Co [4], healthcare paced fifth, represented by Walgreens Boots Alliance [5], and another lone energy representative was seventh, Chevron (CVX) [7]. Finally, ninth place belonged to the financial services representative, JPMorgan Chase & Co (JPM) [9], and tenth went to the consumer defensive standout, Coca-Cola Co [10], to complete the incoming December Dogs of the Dow by yield lists from YCharts. Source: YCharts.com  Dividend Vs. Price Results A graph above shows the relative strengths of the top ten Dow dogs by dividend and price as of market close 11/30/2022. This month six of the top-ten Dow dogs show an overbought condition (in which aggregate single share price of those six exceeds projected annual dividend from $10k invested as $1k each). A dividend dogcatcher priority is to select stocks whose dividends from $1K invested exceed their single share price. As mentioned above, that condition was reached by four of the five lowest priced Dogs of the Dow: Verizon Communications, Dow Inc, Intel Corp, and Walgreens Boots Alliance, live up to the dogcatcher ideal of annual dividends from $1K invested exceeding their single share prices. Furthermore, two more, Cisco Systems, showed a price within $10.72 and Coca-Cola Co came within $21.64 of meeting that ideal goal as of November 30. Actionable Conclusion (21): Six of Ten Top Dow Dogs Are Overbought This gap between high share price and low dividend per $1k (or oversold condition) means, no matter which chart you read, 23 of all 27 Dow dividend payers are low risk and low opportunity dogs, with the non-dividend payers being particularly dismal. The Dow top-ten average cost per dollar of annual dividend for November 31, 2022, was $25.39 per YCharts. One that cut its dividend after March, 2020, Boeing (BA), has re-learned (and is now certified that it knows how to fly in some countries) and is thus prepared to take off again when airlines trust planes made in the USA again. The used plane and airbus market, however, is soaring. BA is struggling to recover from being in worse shape than was GE when excised from the Dow index. As for DIS, the magic kingdom may never be close to reinstating a dividend. Furthermore, the newest of the three latest no-dividend stocks on the block, CRM, is simply overpriced, yet fading rapidly, as their CEO unexpectedly bailed out, Those three non-dividend payers are the true down in the dumps dogs of the Dow, despite analysts high-balling their future share price estimates. All of the three demonstrate a total disregard for shareholders. Remember this dogcatcher yield-based stock-picking strategy is contrarian. That means rooting for (buying) the underdog is productive when you don't already own these stocks. If you do hold these stocks, then you must look for opportune pull-backs in price to add to your position to best improve your dividend yield. Plenty of pull-back opportunities appear to be ahead. Price Drops or Dividend Increases Could Get All Ten Dow Dogs Back to \"Fair Price\" Rates For Investors Source: YCharts.com The charts above retain the current dividend amount and adjust the share price to produce a yield (from $1K invested) to equal or exceed the single share price of each stock. As the top illustration shows, four are ideally priced. Beside Verizon Communications, Dow Inc, Intel Corp, and Walgreens Boots Alliance, breaking into the ideal zone, two more low-priced stocks are within $2@ of making the grade, Cisco Corp is $11 away, and Coca-Cola Co is $22 within goal. Four more, however (IBM; MMM; CVX; JPM) need to trim prices between $49 and $108. to attain that elusive 50/50 goal. The alternative, of course, could be that these companies raise their dividends but that is a lot to ask in these highly disrupted, inflationary, yet cash-rich times. Mr. Market is much more effective at moving prices up or down to appropriate amounts, just watch and buy when the targeted stock price moves into the sweet spot. Source: YCharts.com  Actionable Conclusions: (22-31) The Dow Index Showed 7.01% To 27.62% Top Ten Upsides To December 2023; (32) Eight Downsides of -0.47% to -9.99% Were Revealed By Broker 1-Yr. Targets   To quantify top dog rankings, analyst median price target estimates provided a \"market sentiment\" gauge of upside potential. Added to the simple high-yield \"dog\" metrics, analyst median price target estimates provided another tool to dig out bargains.  Analysts Forecast A 39.91% Advantage For 5 Highest-Yield, Lowest-Priced of 10 Dow Dogs As Of November 30, 2023  Ten top Dow dogs were culled by yield for their monthly update. Yield (dividend / price) results as verified by YCharts did the ranking. Source: YCharts.com As noted above, top-ten Dow dogs selected 11/30/22 by YCharts methods revealing the highest dividend-yields represented eight of the eleven sectors. Consumer Cyclical selections were missing. (Real Estate is not reported and Utilities has its own Dow Index.)  Actionable Conclusions: Analysts Expected 5 Lowest-Priced of the Ten Highest-Yield Dow Dogs (34) To Deliver 11.35% Vs. (35) 8.11% Net Gains by All Ten Come November 30, 2023  Source: YCharts.com $5000 invested as $1k in each of the five lowest-priced stocks in the top ten Dow Dividend kennel by yield were predicted by analyst 1-year targets to deliver 39.91% more gain than from $5,000 invested in all ten. The second lowest priced top ten stock, Verizon Communications Inc, showed top analyst-estimated gains of 24.94%.   Source: YCharts.com The five lowest-priced Dow top-yield dogs for November 30 were: Intel Corp; Verizon Communications Inc; Walgreens Boots Alliance Inc; Cisco Systems Inc; Dow Inc, with prices ranging from $30.07 to $50.97. Five higher-priced Dow top-yield dogs for October 31 were: Coca-Cola Co; 3M Co; JPMorgan Chase & Co; International Business Machines Corp; Chevron Corp, whose prices ranged from $63.61 to $183.31. The distinction between five low-priced dividend dogs and the general field of ten reflected Michael B. O'Higgins' \"basic method\" for beating the Dow. The scale of projected gains based on analyst targets added a unique element of \"market sentiment\" gauging upside potential. It provided a here-and-now equivalent of waiting a year to find out what might happen in the market. Caution is advised since analysts are historically only 20% to 85% accurate on the direction of change and just 0% to 15% accurate on the degree of change. (In 2017 the market somewhat followed analyst sentiment. In 2018 analysts estimates were contrarian indicators of market performance, and they continued to be contrary for the first two quarters of 2019 but switched to conforming for the last two quarters.) In 2020 analyst projections were quite contrarian. The first half of 2021 most dividend stock price actions exceeded all analyst expectations. The last half of 2021 was still gangbusters. The 2022 September sag may free-up five or more Dow dogs, sending them into the ideal zone where returns from $1k invested equal (or exceed) their single-share price. Afterword Lest there be any doubt about the recommendations in this article, this month there were four Dow Index stocks showing dividends for $1k invested exceeding single share price: Intel Corp, Verizon Communications, Walgreens Boots Alliance, and Dow Inc. The dogcatcher hands off recommendations are still in place referring to one that cut its dividend in March 2020. While Boeing, has re-learned (and is certified in certain countries) to fly, it still has to coax customers to buy planes again. BA faces strong headwinds to stay on the Dow index (despite analyst optimism for the lone U.S. commercial air-crafter). Also keep hands off the newest non-dividend member of the Dow, Salesforce.com Inc, until it declares a dividend from $1K invested greater than its single share price, perhaps new leadership will help. While subscriptions keep the ship afloat, Disney needs audiences to get strapped back into buying tickets to watch and ride and may never resume a dividend. Meanwhile DIS has Apple, Amazon, Netflix, and Paramount, and numerous other content providers pouring out streamable content. Will the mouse house ever roar again, let-alone, pay dividends? The net gain/loss estimates above did not factor in any foreign or domestic tax problems resulting from distributions. Consult your tax advisor regarding the source and consequences of \"dividends\" from any investment. Stocks listed above were suggested only as possible reference points for your Dow dividend dog stock purchase or sale research process. These were not recommendations. Disclaimer: This article is for informational and educational purposes only and should not be construed to constitute investment advice. Nothing contained herein shall constitute a solicitation, recommendation or endorsement to buy or sell any security. Prices and returns on equities in this article except as noted are listed without consideration of fees, commissions, taxes, penalties, or interest payable due to purchasing, holding, or selling same.  Graphs and charts were compiled by Rydlun & Co., LLC from data derived from Indexarb; YCharts; finance.yahoo.com; analyst mean target price by YCharts. Open source dog art from dividenddogcatcher.com.Get the Dogs Of The Dow 'Safer' Dividend Dogcatcher StoryClick here to subscribe to The Dividend Dogcatcher & get more information.Catch A Dog On Facebook the evening before every NYSE trade day on Facebook/Dividend Dog Catcher, a Fredrik Arnold live video highlights a portfolio candidate in the Underdog Daily Dividend Show!Root for the Underdog. Be sure to comment below on any stock ticker you like to make it eligible for my next FA follower report.",
		"isFull": true,
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "The TikTok Juggernaut Keeps On Rolling",
		"description": "There's no time like the present for TikTok. Despite U.S. lawmakers' threats to ban the Chinese-owned social media app, TikTok is brushing regulatory concerns aside and morphing into a global giant, taking on the likes of FANG stocks Alphabet's (GOOGL) Google…",
		"url": "https://biztoc.com/x/a180c0ef761af77c",
		"urlToImage": "https://c.biztoc.com/p/a180c0ef761af77c/og.webp",
		"publishedAt": 1670137805000,
		"content": "There's no time like the present for TikTok. Despite U.S. lawmakers' threats to ban the Chinese-owned social media app, TikTok is brushing regulatory concerns aside and morphing into a global giant, … [+1008 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Volatile Football Stocks Offer a Tough Match for Shareholders",
		"description": "Volatile Football Stocks Offer a Tough Match for Shareholders Bloomberg",
		"url": "https://biztoc.com/x/098a6fd1969d1bec",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670136125000,
		"content": "Volatile Football Stocks Offer a Tough Match for Shareholders Bloomberg \r\n This story appeared first on bloomberg.com, 2022-12-04.",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "wsj.com",
		"title": "What Types of Bonds Deliver the Best Returns?",
		"description": "With interest rates on the march this year, many investors are looking at bonds again, for the first time in 10-plus years, as a true income-delivering alternative to stocks. Indeed, while investors have exited equities along with the downturn in that sector,…",
		"url": "https://biztoc.com/x/e447259d0c1d6b60",
		"urlToImage": "https://c.biztoc.com/p/e447259d0c1d6b60/og.webp",
		"publishedAt": 1670136125000,
		"content": "With interest rates on the march this year, many investors are looking at bonds again, for the first time in 10-plus years, as a true income-delivering alternative to stocks.\r\nIndeed, while investors… [+841 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Volatile Football Stocks Offer a Tough Match for Shareholders",
		"description": "Volatile Football Stocks Offer a Tough Match for Shareholders Bloomberg",
		"url": "https://biztoc.com/x/9b5172265121e63f",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670135286000,
		"content": "Volatile Football Stocks Offer a Tough Match for Shareholders Bloomberg \r\n This story appeared first on bloomberg.com, 2022-12-04.",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "bloomberg",
			"name": "Bloomberg"
		},
		"author": "Joe Easton, Sunil Kesur",
		"title": "Volatile Football Stocks Offer a Tough Match for Shareholders",
		"description": "If following a soccer team can be frustrating, try investing in one.",
		"url": "https://www.bloomberg.com/news/articles/2022-12-04/volatile-football-stocks-offer-a-tough-match-for-shareholders",
		"urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iwOqjqtGUESE/v1/1200x800.jpg",
		"publishedAt": 1670133600000,
		"content": "Want the lowdown on European markets? In your inbox before the open, every day. \r\nSign up here.\r\nIf following a soccer team can be frustrating, try investing in one. \r\nAs British Premier League stalw… [+3348 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "Industrial Stocks Are Ready to Break Out. Caterpillar, Deere, and More Companies to Watch",
		"description": "Stocks in the industrial sector have been on a tear. In aggregate, they are knocking on the door of reaching new heights. The Industrial Select Sector SPDR ETF (ticker: XLI ), home to Caterpillar (CAT), Deere (DE), Honeywell International (HON), Boeing (BA), …",
		"url": "https://biztoc.com/x/f238237bbf916da1",
		"urlToImage": "https://c.biztoc.com/p/f238237bbf916da1/og.webp",
		"publishedAt": 1670132285000,
		"content": "Stocks in the industrial sector have been on a tear. In aggregate, they are knocking on the door of reaching new heights.\r\nThe Industrial Select Sector SPDR ETF (ticker: XLI ), home to Caterpillar (C… [+366 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "These money and investing tips can help you know when the bull market has come back to stay",
		"description": "Don’t miss these top money and investing features: - There’s a strong possibility that the bear market in stocks is over, as investors finally give up hope - More risk doesn’t always mean greater reward. Just look at these imploded tech stocks - Fed ‘pivot’ t…",
		"url": "https://biztoc.com/x/c72a5eaca1601794",
		"urlToImage": "https://c.biztoc.com/p/c72a5eaca1601794/og.webp",
		"publishedAt": 1670131084000,
		"content": "Dont miss these top money and investing features:\r\n- Theres a strong possibility that the bear market in stocks is over, as investors finally give up hope\r\n- More risk doesnt always mean greater rewa… [+987 chars]",
		"titleScore": 2,
		"titleMarketGrams": "when the bull market \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "Vinit Bolinjkar on why NBFC stocks are back in demand & what are the top picks",
		"description": "“SBI Life is our preferred pick in the sector. We believe that they have a very big franchise which they can build on very aggressively. India is still an underpenetrated market and given its distribution reach and the way they have been performing, I believe…",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/vinit-bolinjkar-on-why-nbfc-stocks-are-back-in-demand-what-are-the-top-picks/articleshow/95974626.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95974650,width-1070,height-580,imgsize-16820,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670130177000,
		"content": "There is a lot of froth around the changing business dynamics and we believe that for some time the business will continue to remain sideways, interest will be lacklustre until the valuations decline… [+3076 chars]",
		"titleScore": 1,
		"titleMarketGrams": "on why NBFC stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Bloomberg",
		"title": "Crypto stocks teeter near abyss as Fink’s warning adds to angst",
		"description": "Cryptocurrency firms including Coinbase Global Inc., Galaxy Digital Holdings Ltd. and MicroStrategy Inc. all plunged more than 25% last month. The declines added to the pain of a dismal year amid a deep and extended plunge in Bitcoin and other digital tokens.",
		"url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-stocks-teeter-near-abyss-as-finks-warning-adds-to-angst/articleshow/95974029.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95974055,width-1070,height-580,imgsize-41822,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670126990000,
		"content": "Analysts and investors are struggling to call a bottom in crypto stocks in the wake of a brutal month that ended with the head of BlackRock Inc. saying most digital-asset firms wont survive. \r\nCrypto… [+4037 chars]",
		"titleScore": -3,
		"titleMarketGrams": "Crypto stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "nikkei.com",
		"title": "Elderly make up 40% of retail investors in Japan Inc",
		"description": "TOKYO -- Shareholders of Japanese companies are graying quickly, with individuals 70 and older now accounting for more than 40% of retail investors in domestic stocks, up from 15% three decades ago. The aging of investors in Japanese shares is much faster tha…",
		"url": "https://biztoc.com/x/8dbe6858d20e03d3",
		"urlToImage": "https://c.biztoc.com/p/8dbe6858d20e03d3/og.webp",
		"publishedAt": 1670124367000,
		"content": "TOKYO -- Shareholders of Japanese companies are graying quickly, with individuals 70 and older now accounting for more than 40% of retail investors in domestic stocks, up from 15% three decades ago.\r… [+223 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Time To Take Profits On These Recent Breakout Stocks?",
		"description": "Breakout stocks Steel Dynamics (STLD) and Pinduoduo (PDD) are hitting new highs and stand among the few recent market winners.X Investors may be wondering if now is a good time to take profits in these breakout stocks. The short answer is yes. Now could be a …",
		"url": "https://biztoc.com/x/2e0e68f9818499fb",
		"urlToImage": "https://c.biztoc.com/p/2e0e68f9818499fb/og.webp",
		"publishedAt": 1670122685000,
		"content": "Breakout stocks Steel Dynamics (STLD) and Pinduoduo (PDD) are hitting new highs and stand among the few recent market winners.X\r\nInvestors may be wondering if now is a good time to take profits in th… [+986 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "australian-financial-review",
			"name": "Australian Financial Review"
		},
		"author": "Subrat Patnaik",
		"title": "Netflix's ad-supported tier spurs comeback for share price - The Australian Financial Review",
		"description": "Netflix’s turnaround plan is winning over investors, who have turned one of the worst-performing stocks early this year into one of the best in the second half of the calendar year.",
		"url": "https://www.afr.com/companies/media-and-marketing/netflix-s-ad-supported-tier-spurs-comeback-for-share-price-20221204-p5c3gz",
		"urlToImage": "https://static.ffx.io/images/$zoom_1%2C$multiply_1%2C$ratio_1.777778%2C$width_1059%2C$x_107%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/2e194a8ce545b1b28a707145a9e66475f34a18b6",
		"publishedAt": 1670122260000,
		"content": "The stock plunged 72 per cent from the start of the year to its low point in May, the biggest drop in the Nasdaq 100 Index over that period, only to surge 84 per cent since then. The gain from the lo… [+1153 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "FRANCE 24 English"
		},
		"author": "FRANCE24",
		"title": "Germany's Scholz weathers shocks in turbulent first year",
		"description": "The ex-finance minister took office promising continuity with the era of Angela Merkel, who ended her 16 years as chancellor a widely respected figure.\n\nBut Russia's invasion of Ukraine has forced him to rip up Germany's post-war axioms and chart out new econ…",
		"url": "https://www.france24.com/en/live-news/20221204-germany-s-scholz-weathers-shocks-in-turbulent-first-year",
		"urlToImage": "https://s.france24.com/media/display/6a2bc610-737c-11ed-b313-005056a97e36/w:1280/p:16x9/3d1f0aec6ddd9d1bf2b2e3e1ddc1227976c4e180.jpg",
		"publishedAt": 1670121372000,
		"content": "Frankfurt (Germany) (AFP) A war in his backyard, galloping economic crisis, and unhappy partners at home and abroad -- German Chancellor Olaf Scholz has weathered unprecedented shocks in his first ye… [+4716 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Dow Jones Stocks: Chevron Leads 5 Blue Chips Near Buy Points",
		"description": "Dow Jones stocks Boeing (BA), UnitedHealth (UNH), Caterpillar (CAT), Chevron (CVX) and Goldman Sachs (GS) are in focus this week.X The Dow Jones Industrial Average has been leading the current market rally, hitting a seven-month high recently. While it's made…",
		"url": "https://biztoc.com/x/1aec454c2d6100cc",
		"urlToImage": "https://c.biztoc.com/p/1aec454c2d6100cc/og.webp",
		"publishedAt": 1670121365000,
		"content": "Dow Jones stocks Boeing (BA), UnitedHealth (UNH), Caterpillar (CAT), Chevron (CVX) and Goldman Sachs (GS) are in focus this week.X\r\nThe Dow Jones Industrial Average has been leading the current marke… [+981 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "ft.com",
		"title": "Wall St stocks gain for second straight week on hopes of Fed slowing rate rises",
		"description": "Wall St stocks gain for second straight week on hopes of Fed slowing rate rises Financial Times Dow Jones Stocks: Chevron Leads 5 Blue Chips Near Buy Points | Investor's Business Daily Investor's Business Daily Stocks Recover Most of Their Losses as Bond Yiel…",
		"url": "https://biztoc.com/x/b0b15d6b757c82e4",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670118845000,
		"content": "Wall St stocks gain for second straight week on hopes of Fed slowing rate rises Financial Times\r\nDow Jones Stocks: Chevron Leads 5 Blue Chips Near Buy Points | Investor's Business Daily Investor's Bu… [+361 chars]",
		"titleScore": 6,
		"titleMarketGrams": "Wall St stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "thestreet.com",
		"title": "3 Dividend Stocks With Low Volatility and Above-Average Yields",
		"description": "Bear markets, such as 2022, generally leave few places for investors to hide. Most stocks are priced with some level of growth in mind, and therefore, when the fear of recession or higher interest rates strikes, most stocks move lower. However, there are some…",
		"url": "https://biztoc.com/x/e594ddd24ccc3a77",
		"urlToImage": "https://c.biztoc.com/p/e594ddd24ccc3a77/og.webp",
		"publishedAt": 1670118006000,
		"content": "Bear markets, such as 2022, generally leave few places for investors to hide. Most stocks are priced with some level of growth in mind, and therefore, when the fear of recession or higher interest ra… [+955 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "Another Bad Sign for Tech Stocks",
		"description": "The move to cloud-native software was supposed to be unstoppable. But this past week, we learned even the best secular trends have their limits and aren’t completely immune to a slowing global economy. For much of this year, enterprise spending for cloud proj…",
		"url": "https://biztoc.com/x/0a2aa8144be8b527",
		"urlToImage": "https://c.biztoc.com/p/0a2aa8144be8b527/og.webp",
		"publishedAt": 1670115964000,
		"content": "The move to cloud-native software was supposed to be unstoppable. But this past week, we learned even the best secular trends have their limits and arent completely immune to a slowing global economy… [+347 chars]",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Ozbargain.com.au"
		},
		"author": "I Smell Pennies",
		"title": "USB Ethernet Adapter Aluminum USB 3.0 to Network Gigabit LAN $2.48 + Post ($0 with Prime/ $39 Spend) @ CableCreation Amazon AU",
		"description": "Cheapest USB 3.0 to Ethernet adapter in the market as of now. With next day free prime delivery it’s a no brainer.\n\nCoupon discount brings it to an all time low\n\n\n\nPromo as follows:\n\nOriginal price: $24.99\r\n\nPrice drop: $12.48\r\n\nPrice after $10 discount: $2.4…",
		"url": "https://www.ozbargain.com.au/node/743055",
		"urlToImage": "https://files.ozbargain.com.au/n/55/743055x.jpg?h=ab4d71ca",
		"publishedAt": 1670110065000,
		"content": "Cheapest USB 3.0 to Ethernet adapter in the market as of now. With next day free prime delivery its a no brainer.\r\nCoupon discount brings it to an all time low\r\nPromo as follows:\r\nOriginal price: $24… [+4444 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "bloomberg",
			"name": "Bloomberg"
		},
		"author": "Vildana Hajric",
		"title": "Stock Strategist Is Bracing for 5% Inflation for the Next Decade",
		"description": "While the crypto horror show rages on, stocks have quietly rallied almost 10% in the last month amid cautious optimism that the worst of the inflation shock is over.",
		"url": "https://www.bloomberg.com/news/articles/2022-12-03/stock-strategist-is-bracing-for-5-inflation-for-the-next-decade",
		"urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i0RdnRa4mc6Y/v0/1200x675.jpg",
		"publishedAt": 1670105167000,
		"content": "While the \r\ncrypto horror show rages on, stocks have quietly rallied almost 10% in the last month amid cautious optimism that the worst of the inflation shock is over. \r\nBut might it be a head-fake? … [+4679 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "This is Money"
		},
		"author": "John Abiona",
		"title": "CITY WHISPERS: New boss aims to reverse clean fuel firm's fortunes",
		"description": "More than 5 per cent of its shares are held by short sellers. It is among the top five most shorted stocks. The value of the company has dived to £630million.",
		"url": "https://www.thisismoney.co.uk/money/investing/article-11498441/CITY-WHISPERS-New-boss-aims-reverse-clean-fuel-firms-fortunes.html",
		"urlToImage": "https://i.dailymail.co.uk/1s/2022/12/03/17/65206875-0-image-a-145_1670089005399.jpg",
		"publishedAt": 1670104256000,
		"content": "It's been quite the week for ITM Power. The company which makes electrolysers that produce hydrogen for cleaner fuel has a new boss. \r\nSo why are investors betting against the Sheffield company, whic… [+2932 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cointelegraph.com",
		"title": "Bitcoin bulls lie in wait as US dollar strength hits 5-month lows",
		"description": "Bitcoin (BTC) continued to hold key support on Dec. 2 as United States stocks fell on the Wall Street open. DXY weakness offers hope of “Santa rally” Data from Cointelegraph Markets Pro and TradingView followed BTC/USD as bulls bought time between $16,800 and…",
		"url": "https://biztoc.com/x/275cfe2566bda128",
		"urlToImage": "https://c.biztoc.com/p/275cfe2566bda128/og.webp",
		"publishedAt": 1670094248000,
		"content": "Bitcoin (BTC) continued to hold key support on Dec. 2 as United States stocks fell on the Wall Street open.\r\nDXY weakness offers hope of Santa rally\r\nData from Cointelegraph Markets Pro and TradingVi… [+967 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "seekingalpha.com",
		"title": "Stocks To Watch: Oil Plays, Lowe's, Southwest Airlines And Lululemon In Focus",
		"description": "Get ahead of the market by subscribing to Seeking Alpha's Stocks to Watch, a preview of key events scheduled for the coming week. The newsletter keeps you informed of the biggest stories set to make headlines, including upcoming IPOs, investor days, earnings …",
		"url": "https://biztoc.com/x/dd4548f65263cab7",
		"urlToImage": "https://c.biztoc.com/p/dd4548f65263cab7/og.webp",
		"publishedAt": 1670093405000,
		"content": "Get ahead of the market by subscribing to Seeking Alpha's Stocks to Watch, a preview of key events scheduled for the coming week. The newsletter keeps you informed of the biggest stories set to make … [+997 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "wsj.com",
		"title": "What Types of Bonds Deliver the Best Returns?",
		"description": "With interest rates on the march this year, many investors are looking at bonds again, for the first time in 10-plus years, as a true income-delivering alternative to stocks. Indeed, while investors have exited equities along with the downturn in that sector,…",
		"url": "https://biztoc.com/x/a9b76d9775012b4f",
		"urlToImage": "https://c.biztoc.com/p/a9b76d9775012b4f/og.webp",
		"publishedAt": 1670090899000,
		"content": "With interest rates on the march this year, many investors are looking at bonds again, for the first time in 10-plus years, as a true income-delivering alternative to stocks.\r\nIndeed, while investors… [+841 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Antaranews.com"
		},
		"author": "Aditya Ramadhan, Raka Adji",
		"title": "Maintaining rice stocks to control inflation",
		"description": "Rice is one of the food commodities that contributes significantly to food inflation and greatly influences the national inflation rate, according to Statistics Indonesia (BPS).\r\nData recorded by BPS has shown that rice prices ...",
		"url": "https://en.antaranews.com/news/263787/maintaining-rice-stocks-to-control-inflation",
		"urlToImage": "https://cdn.antaranews.com/cache/800x533/2022/11/25/18.jpg",
		"publishedAt": 1670088944000,
		"content": "Jakarta (ANTARA) - Rice is one of the food commodities that contributes significantly to food inflation and greatly influences the national inflation rate, according to Statistics Indonesia (BPS).Dat… [+4978 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Maintaining rice stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "Why stocks might not be doomed even with a key recession signal flashing warnings - MarketWatch",
		"description": "Why stocks might not be doomed even with a key recession signal flashing warningsMarketWatch View Full Coverage on Google News ...",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=168613812",
		"urlToImage": null,
		"publishedAt": 1670087565000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": -7,
		"titleMarketGrams": "Why stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Kevin P. Curran",
		"title": "P&G, Reynolds highlighted among resilient consumer staples stocks",
		"description": "Amid persistent inflation, fears of substitution effects impacting consumer staples providers have grown.",
		"url": "https://seekingalpha.com/news/3913670-pg-reynolds-highlighted-among-resilient-consumer-staples-stocks",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/81945168/image_81945168.jpg?io=getty-c-w1280",
		"publishedAt": 1670087100000,
		"content": "Scott Olson\r\nAmid persistent inflation, fears of substitution effects impacting consumer staples providers have loomed large as of late. However, according to data from Morgan Stanley and Nielsen, sh… [+3278 chars]",
		"titleScore": 0,
		"titleMarketGrams": "resilient consumer staples stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fortune.com",
		"title": "Investors question ‘whether crypto has a future’ after a brutal month and Larry Fink’s warning that most firms will fold",
		"description": "Investors question ‘whether crypto has a future’ after a brutal month and Larry Fink’s warning that most firms will fold Analysts and investors are struggling to call a bottom in crypto stocks in the wake of a brutal month that ended with the head of BlackRoc…",
		"url": "https://biztoc.com/x/7dee0f6f3f7fbbdb",
		"urlToImage": "https://c.biztoc.com/p/7dee0f6f3f7fbbdb/og.webp",
		"publishedAt": 1670086574000,
		"content": "Investors question whether crypto has a future after a brutal month and Larry Finks warning that most firms will fold\r\nAnalysts and investors are struggling to call a bottom in crypto stocks in the w… [+981 chars]",
		"titleScore": -6,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Crypto Stocks Teeter Near Abyss as Fink’s Warning Adds to Angst",
		"description": "(Bloomberg) -- Analysts and investors are struggling to call a bottom in crypto stocks in the wake of a brutal month that ended with the head of BlackRock Inc. saying most digital-asset firms won’t survive. Most Read from Bloomberg Cryptocurrency firms includ…",
		"url": "https://biztoc.com/x/a780c864541da973",
		"urlToImage": "https://c.biztoc.com/p/a780c864541da973/og.webp",
		"publishedAt": 1670086565000,
		"content": "(Bloomberg) -- Analysts and investors are struggling to call a bottom in crypto stocks in the wake of a brutal month that ended with the head of BlackRock Inc. saying most digital-asset firms wont su… [+989 chars]",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Got $5,000? 3 Top Dividend Stocks to Buy Right Now",
		"description": "When it comes to total returns received from stock investing, dividends can often play an underrated role. In fact, reinvested dividends accounted for roughly 84% of the S&P 500's total returns from 1960 to 2021. So if you're looking for some dividend stocks …",
		"url": "https://biztoc.com/x/8466d44211560041",
		"urlToImage": "https://c.biztoc.com/p/8466d44211560041/og.webp",
		"publishedAt": 1670085485000,
		"content": "When it comes to total returns received from stock investing, dividends can often play an underrated role. In fact, reinvested dividends accounted for roughly 84% of the S&amp;P 500's total returns f… [+954 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "From Bank of America to Morgan Stanley, Wall Street giants are expecting stocks to crash more than 20% next year. Here's what they've been saying",
		"description": "Three major Wall Street banks expect the S&P 500 to tank over 20% at some point next year. US stocks face a recession, cuts to earnings outlooks and liquidity risks as the Fed hikes rates. Here's what Morgan Stanley, Bank of America and Deutsche Bank say abou…",
		"url": "https://biztoc.com/x/8ace6649e953a2bd",
		"urlToImage": "https://c.biztoc.com/p/8ace6649e953a2bd/og.webp",
		"publishedAt": 1670085245000,
		"content": "Three major Wall Street banks expect the S&amp;P 500 to tank over 20% at some point next year.\r\nUS stocks face a recession, cuts to earnings outlooks and liquidity risks as the Fed hikes rates.\r\nHere… [+965 chars]",
		"titleScore": -2,
		"titleMarketGrams": "giants are expecting stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Stefon Walters)",
		"title": "Got $5,000? 3 Top Dividend Stocks to Buy Right Now",
		"description": "Investors can't go wrong with these companies at their current prices and dividend yields.",
		"url": "https://www.fool.com/investing/2022/12/03/got-5000-3-top-dividend-stocks-to-buy-right-now/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711046/grocery-shopping.jpg",
		"publishedAt": 1670085000000,
		"content": "When it comes to total returns received from stock investing, dividends can often play an underrated role. In fact, reinvested dividends accounted for roughly 84% of the S&amp;P 500's total returns f… [+3962 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Crypto Stocks Teeter Near Abyss as Fink's Warning Adds to Angst",
		"description": "Crypto Stocks Teeter Near Abyss as Fink's Warning Adds to Angst Bloomberg #angstbloomberg #cryptostocksteeter",
		"url": "https://biztoc.com/x/ae901750995a9d02",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670084886000,
		"content": "Crypto Stocks Teeter Near Abyss as Fink's Warning Adds to Angst Bloomberg \r\n#angstbloomberg#cryptostocksteeter\r\n This story appeared first on bloomberg.com, 2022-12-03.",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Crypto Stocks Teeter Near Abyss as Fink's Warning Adds to Angst",
		"description": "Crypto Stocks Teeter Near Abyss as Fink's Warning Adds to Angst Bloomberg #cryptostocksteeter #angstbloomberg",
		"url": "https://biztoc.com/x/cf9ee854abb46e86",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670084046000,
		"content": "Crypto Stocks Teeter Near Abyss as Fink's Warning Adds to Angst Bloomberg \r\n#cryptostocksteeter#angstbloomberg\r\n This story appeared first on bloomberg.com, 2022-12-03.",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "wsj.com",
		"title": "What Types of Bonds Deliver the Best Returns?",
		"description": "With interest rates on the march this year, many investors are looking at bonds again, for the first time in 10-plus years, as a true income-delivering alternative to stocks. Indeed, while investors have exited equities along with the downturn in that sector,…",
		"url": "https://biztoc.com/x/2894d3f2845f1f1a",
		"urlToImage": "https://c.biztoc.com/p/2894d3f2845f1f1a/og.webp",
		"publishedAt": 1670084045000,
		"content": "With interest rates on the march this year, many investors are looking at bonds again, for the first time in 10-plus years, as a true income-delivering alternative to stocks.\r\nIndeed, while investors… [+841 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Growth Stocks Down 30% to 52% to Buy Now",
		"description": "In this video, I will be talking about the three growth stocks I added to my portfolio in November. Tesla (NASDAQ: TSLA) is down 52% year to date and has been underperforming lately because of the Twitter deal. The other two are down 30% and 50%, respectively…",
		"url": "https://biztoc.com/x/978c3a0225dab9c9",
		"urlToImage": "https://c.biztoc.com/p/978c3a0225dab9c9/og.webp",
		"publishedAt": 1670083806000,
		"content": "In this video, I will be talking about the three growth stocks I added to my portfolio in November. Tesla (NASDAQ: TSLA) is down 52% year to date and has been underperforming lately because of the Tw… [+359 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "seekingalpha.com",
		"title": "Wall Street Breakfast: What Moved Markets",
		"description": "Listen on the go! A daily podcast of Wall Street Breakfast will be available this morning on Seeking Alpha, iTunes, Stitcher and Spotify. Stocks cut much of their earlier losses Friday to finish mixed while maintaining weekly gains, after the monthly U.S. job…",
		"url": "https://biztoc.com/x/c976954021dddcef",
		"urlToImage": "https://c.biztoc.com/p/c976954021dddcef/og.webp",
		"publishedAt": 1670083325000,
		"content": "Listen on the go! A daily podcast of Wall Street Breakfast will be available this morning on Seeking Alpha, iTunes, Stitcher and Spotify.\r\nStocks cut much of their earlier losses Friday to finish mix… [+979 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "seekingalpha.com",
		"title": "2 Urgent Dividend Sells And 2 Blue Chip Replacements To Increase Your Income",
		"description": "Summary - As the SPX has risen to 4,000, some stocks have become outrageously expensive. - Others, in the same sector, are still very cheap. - These trades offer opportunities to \"yield up\" and increase your income. - We're currently running a sale at my priv…",
		"url": "https://biztoc.com/x/aabf07779785df5d",
		"urlToImage": "https://c.biztoc.com/p/aabf07779785df5d/og.webp",
		"publishedAt": 1670083324000,
		"content": "Summary\r\n- As the SPX has risen to 4,000, some stocks have become outrageously expensive.\r\n- Others, in the same sector, are still very cheap.\r\n- These trades offer opportunities to \"yield up\" and in… [+968 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Neil Rozenbaum)",
		"title": "3 Growth Stocks Down 30% to 52% to Buy Now",
		"description": "Short-term pain for long-term gains.",
		"url": "https://www.fool.com/investing/2022/12/03/3-growth-stocks-down-30-to-52-to-buy-now/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711573/3-stocks-to-buy.png",
		"publishedAt": 1670083200000,
		"content": "In this video, I will be talking about the three growth stocks I added to my portfolio in November. Tesla (TSLA 0.08%) is down 52% year to date and has been underperforming lately because of the Twit… [+266 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Here's My Top Growth Stock to Buy in December",
		"description": "You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn …",
		"url": "https://biztoc.com/x/97c9d7cf2f75682f",
		"urlToImage": "https://c.biztoc.com/p/97c9d7cf2f75682f/og.webp",
		"publishedAt": 1670082965000,
		"content": "Youre reading a free article with opinions that may differ from The Motley Fools Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations… [+919 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "Stock market outlook: Why Wall Street agrees the S&P 500 will crash 20%",
		"description": "Three major Wall Street banks expect the S&P 500 to tank over 20% at some point next year. - US stocks face a recession, cuts to earnings outlooks and liquidity risks as the Fed hikes rates. - Here's what Morgan Stanley, Bank of America and Deutsche Bank say …",
		"url": "https://biztoc.com/x/9947e21c4a903791",
		"urlToImage": "https://c.biztoc.com/p/9947e21c4a903791/og.webp",
		"publishedAt": 1670082725000,
		"content": "Three major Wall Street banks expect the S&amp;P 500 to tank over 20% at some point next year.\r\n- US stocks face a recession, cuts to earnings outlooks and liquidity risks as the Fed hikes rates.\r\n- … [+991 chars]",
		"titleScore": -1,
		"titleMarketGrams": "Stock market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Parkev Tatevosian, CFA)",
		"title": "Here's My Top Growth Stock to Buy in December",
		"description": "Growth stocks offer investors higher return potential than the average stock.",
		"url": "https://www.fool.com/investing/2022/12/03/heres-my-top-growth-stock-to-buy-in-december/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711639/growthstocks.jpg",
		"publishedAt": 1670082240000,
		"content": "Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Parkev Ta… [+446 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Close Out 2022 With These 3 High-Yield Buys",
		"description": "It's hard to believe 2022 is already drawing to a close. However, with the calendar recently flipping to the December page, it's time to start making year-end investment plans. This month is a great time to buy dividend-paying stocks to boost your passive inc…",
		"url": "https://biztoc.com/x/7b7b7aee9e34aa27",
		"urlToImage": "https://c.biztoc.com/p/7b7b7aee9e34aa27/og.webp",
		"publishedAt": 1670082126000,
		"content": "It's hard to believe 2022 is already drawing to a close. However, with the calendar recently flipping to the December page, it's time to start making year-end investment plans.\r\nThis month is a great… [+950 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Stocks That Are Fantastic Deals Right Now",
		"description": "Operating cash flow (OCF) provides a terrific insight into the health of a stock's underlying business, showing the amount of cash generated before spending on capital expenditures (capex). This figure is instrumental when looking at younger companies still i…",
		"url": "https://biztoc.com/x/4b0b4c2899bb10a0",
		"urlToImage": "https://c.biztoc.com/p/4b0b4c2899bb10a0/og.webp",
		"publishedAt": 1670081286000,
		"content": "Operating cash flow (OCF) provides a terrific insight into the health of a stock's underlying business, showing the amount of cash generated before spending on capital expenditures (capex).\r\nThis fig… [+912 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Matthew DiLallo, Neha Chamaria, and Reuben Gregg Brewer)",
		"title": "Close Out 2022 With These 3 High-Yield Buys",
		"description": "These stocks should provide investors with lots of income in 2023 and beyond.",
		"url": "https://www.fool.com/investing/2022/12/03/close-out-2022-with-these-3-high-yield-buys/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711448/a-person-using-a-pen-to-point-at-a-stock-chart-on-a-tablet.jpg",
		"publishedAt": 1670081220000,
		"content": "It's hard to believe 2022 is already drawing to a close. However, with the calendar recently flipping to the December page, it's time to start making year-end investment plans. \r\nThis month is a grea… [+5385 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Josh Kohn-Lindquist)",
		"title": "3 Stocks That Are Fantastic Deals Right Now",
		"description": "Generating strong operating cash flows, these businesses may be trading at a major discount to their long-term potential.",
		"url": "https://www.fool.com/investing/2022/12/03/3-stocks-that-are-fantastic-deals-right-now/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711211/woman-researching-studying-laptop.jpg",
		"publishedAt": 1670080980000,
		"content": "Operating cash flow (OCF) provides a terrific insight into the health of a stock's underlying business, showing the amount of cash generated before spending on capital expenditures (capex).\r\nThis fig… [+5573 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Beaten-Down Dividend Aristocrats That Are No-Brainer Buys for 2023",
		"description": "In a year where many stocks have been dragged down by the bear market, companies that pay dividends can be especially appealing. Assuming each company has the financial fortitude to continue to pay its dividend through rough times, these businesses can help w…",
		"url": "https://biztoc.com/x/d6dc0a615095fca4",
		"urlToImage": "https://c.biztoc.com/p/d6dc0a615095fca4/og.webp",
		"publishedAt": 1670080454000,
		"content": "In a year where many stocks have been dragged down by the bear market, companies that pay dividends can be especially appealing. Assuming each company has the financial fortitude to continue to pay i… [+942 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Stocks to Be Thankful for and Stocks to Avoid",
		"description": "In this podcast, Motley Fool senior analysts Ron Gross and Jason Moser discuss topics including: - Humble pie, i.e., stocks they were wrong about. - Stocks they are thankful for. - Turkey stocks to avoid. - Financial topics they really hope don't come up this…",
		"url": "https://biztoc.com/x/ba6bd1f46cd24fb8",
		"urlToImage": "https://c.biztoc.com/p/ba6bd1f46cd24fb8/og.webp",
		"publishedAt": 1670080450000,
		"content": "In this podcast, Motley Fool senior analysts Ron Gross and Jason Moser discuss topics including:\r\n- Humble pie, i.e., stocks they were wrong about.\r\n- Stocks they are thankful for.\r\n- Turkey stocks t… [+985 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "These money and investing tips can help you know when the bull market has come back to stay",
		"description": "Don’t miss these top money and investing features: - There’s a strong possibility that the bear market in stocks is over, as investors finally give up hope - More risk doesn’t always mean greater reward. Just look at these imploded tech stocks - Fed ‘pivot’ t…",
		"url": "https://biztoc.com/x/661c28a2ce01b7ca",
		"urlToImage": "https://c.biztoc.com/p/661c28a2ce01b7ca/og.webp",
		"publishedAt": 1670079981000,
		"content": "Dont miss these top money and investing features:\r\n- Theres a strong possibility that the bear market in stocks is over, as investors finally give up hope\r\n- More risk doesnt always mean greater rewa… [+987 chars]",
		"titleScore": 2,
		"titleMarketGrams": "when the bull market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Goldman says buy these five stocks in a weakening macro environment",
		"description": "Analysts at Goldman Sachs named a slew of stocks this week that the firm said are well positioned if market conditions deteriorate. These companies have some defensive qualities and have long-term upside. CNBC Pro combed through Goldman Sachs research to find…",
		"url": "https://biztoc.com/x/965af1675d6be26e",
		"urlToImage": "https://c.biztoc.com/p/965af1675d6be26e/og.webp",
		"publishedAt": 1670079979000,
		"content": "Analysts at Goldman Sachs named a slew of stocks this week that the firm said are well positioned if market conditions deteriorate. These companies have some defensive qualities and have long-term up… [+969 chars]",
		"titleScore": 0,
		"titleMarketGrams": "buy these five stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "Bitcoin bulls lie in wait as US dollar strength hits 5-month lows By Cointelegraph",
		"description": "Bitcoin (BTC) continued to hold key support on Dec. 2 as United States stocks fell on the Wall Street open. Data from Cointelegraph Markets Pro and TradingView followed BTC/USD as bulls bought time between $16,800 and $17,000. Add a Comment Are you sure you w…",
		"url": "https://biztoc.com/x/1370acfb9058ba8e",
		"urlToImage": "https://c.biztoc.com/p/1370acfb9058ba8e/og.webp",
		"publishedAt": 1670079853000,
		"content": "Bitcoin (BTC) continued to hold key support on Dec. 2 as United States stocks fell on the Wall Street open.\r\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as bulls bought time … [+347 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Liz Kiesche",
		"title": "Lufax, Futu, 360 Digitech forged higher in a flat week for financial stocks",
		"description": "Three Chinese fintech stocks topped financial gainers this week as the country's authorities softened their zero-COVID stance, while the financial stock that fell the most is a...",
		"url": "https://seekingalpha.com/news/3913731-lufax-futu-360-digitech-forged-higher-in-a-flat-week-for-financial-stocks",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1373109638/image_1373109638.jpg?io=getty-c-w1280",
		"publishedAt": 1670079780000,
		"content": "Bet_Noire\r\nThree Chinese fintech stocks topped financial gainers this week as the country's authorities softened their zero-COVID stance, while the financial stock that fell the most is a Canadian ba… [+1457 chars]",
		"titleScore": 0,
		"titleMarketGrams": "week for financial stocks \n"
	},
	{
		"source": {
			"id": "bloomberg",
			"name": "Bloomberg"
		},
		"author": "Matt Turner",
		"title": "Crypto Stocks Teeter Near Abyss as Fink’s Warning Adds to Angst",
		"description": "Analysts and investors are struggling to call a bottom in crypto stocks in the wake of a brutal month that ended with the head of BlackRock Inc. saying most digital-asset firms won’t survive.",
		"url": "https://www.bloomberg.com/news/articles/2022-12-03/crypto-stocks-teeter-near-abyss-as-fink-s-warning-adds-to-angst",
		"urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ipfvKrxJ4fdo/v1/1200x800.jpg",
		"publishedAt": 1670079600000,
		"content": "Analysts and investors are struggling to call a bottom in crypto stocks in the wake of a brutal month that ended with the head of \r\nBlackRock Inc. saying most digital-asset firms wont survive. \r\nCryp… [+377 chars]",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Chris Hill)",
		"title": "Stocks to Be Thankful for and Stocks to Avoid",
		"description": "Plus, we talk with Scott Galloway, author of \"Adrift: America in 100 Charts.\"",
		"url": "https://www.fool.com/investing/2022/12/03/stocks-to-be-thankful-for-and-stocks-to-avoid/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/710807/mfm_20221124.png",
		"publishedAt": 1670079600000,
		"content": "In this podcast, Motley Fool senior analysts Ron Gross and Jason Moser discuss topics including:\r\n<ul><li>Humble pie, i.e., stocks they were wrong about.</li><li>Stocks they are thankful for.</li><li… [+38756 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "Industrial Stocks Are Ready to Break Out. Caterpillar, Deere, and More Companies to Watch",
		"description": "Stocks in the industrial sector have been on a tear. In aggregate, they are knocking on the door of reaching new heights. The Industrial Select Sector SPDR ETF (ticker: XLI ), home to Caterpillar (CAT), Deere (DE), Honeywell International (HON), Boeing (BA), …",
		"url": "https://biztoc.com/x/61a85ba84dc00345",
		"urlToImage": "https://c.biztoc.com/p/61a85ba84dc00345/og.webp",
		"publishedAt": 1670079004000,
		"content": "Stocks in the industrial sector have been on a tear. In aggregate, they are knocking on the door of reaching new heights.\r\nThe Industrial Select Sector SPDR ETF (ticker: XLI ), home to Caterpillar (C… [+366 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Why ASML, Applied Materials, and Lam Research Rallied in November",
		"description": "What happened Shares of semiconductor equipment stocks ASML Holdings (ASML -0.91%), Applied Materials (AMAT -0.28%), and Lam Research (LRCX -1.18%) rallied in November, rising 17.4%, 24.1%, and 16.7%, respectively. There were several reasons for the across-th…",
		"url": "https://biztoc.com/x/11dc3cb805d769ae",
		"urlToImage": "https://c.biztoc.com/p/11dc3cb805d769ae/og.webp",
		"publishedAt": 1670078765000,
		"content": "What happened\r\nShares of semiconductor equipment stocks ASML Holdings (ASML -0.91%), Applied Materials (AMAT -0.28%), and Lam Research (LRCX -1.18%) rallied in November, rising 17.4%, 24.1%, and 16.7… [+1011 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Georg Vrba",
		"title": "Expect Further Losses For Stocks But 10-Year Forward Returns Look Better: Update December 2022",
		"description": "The average of S&P 500 for Nov-2022 was 3,917 (16% down from Dec-2021 average of 4,675) and is 385 points higher than the corresponding re-calibrated long-term trend value of 3,532.",
		"url": "https://seekingalpha.com/article/4562169-expect-further-losses-for-stocks-but-10-year-forward-returns-look-better-update-december-2022",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/817578374/image_817578374.jpg?io=getty-c-w750",
		"publishedAt": 1670077795000,
		"content": "gustavofrazao\r\nThis is an update to our series of articles started in 2012 assessing market valuation and estimating forward stock market returns. The most recent previous update was for October 2022… [+5949 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "benzinga.com",
		"title": "Tesla 'Bang For The Buck' Semi Arrives, Ford Is America's Second Best, Lordstown's 'Endurance' Deliveries Begin And More: Week's Biggest EV Stories",
		"description": "Electric vehicle stocks mostly advanced in the week ending Dec. 2, helped by market-wide optimism over a potential Fed pivot and some company-specific catalysts. The Chinese EV trio of Nio, Inc. NIO, XPeng, Inc. XPEV and Li Auto, Inc. LI were among the best p…",
		"url": "https://biztoc.com/x/61d63ff404cb0f31",
		"urlToImage": "https://c.biztoc.com/p/61d63ff404cb0f31/og.webp",
		"publishedAt": 1670077685000,
		"content": "Electric vehicle stocks mostly advanced in the week ending Dec. 2, helped by market-wide optimism over a potential Fed pivot and some company-specific catalysts. The Chinese EV trio of Nio, Inc. NIO,… [+1024 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Billy Duberstein)",
		"title": "Why ASML, Applied Materials, and Lam Research Rallied in November",
		"description": "It was a good month for semiconductor equipment stocks amid analyst days, earnings releases, and Warren Buffett buying into the sector.",
		"url": "https://www.fool.com/investing/2022/12/03/why-asml-applied-materials-and-lam-research-rallie/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711533/silicon-wafers-and-microcircuits-with-automation-system-control-application-semiconductor.jpg",
		"publishedAt": 1670076900000,
		"content": "What happened\r\nShares of semiconductor equipment stocks ASML Holdings(ASML -0.91%), Applied Materials(AMAT -0.28%), and Lam Research(LRCX -1.18%) rallied in November, rising 17.4%, 24.1%, and 16.7%, … [+4228 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "China's COVID policy is top of mind for investors as unrest rattled markets this week. Here are 5 things they're watching as Beijing signals willingness to…",
		"description": "Protesters march in Beijing. Photo by NOEL CELIS/AFP via Getty Images Chinese cities this week loosened COVID restrictions in the wake of mass protests, lifting Chinese stocks. But market watchers are still preparing to see if China is ready to announce a ful…",
		"url": "https://biztoc.com/x/b35a2f341c9e6e40",
		"urlToImage": "https://c.biztoc.com/p/b35a2f341c9e6e40/og.webp",
		"publishedAt": 1670076846000,
		"content": "Protesters march in Beijing.\r\nPhoto by NOEL CELIS/AFP via Getty Images\r\nChinese cities this week loosened COVID restrictions in the wake of mass protests, lifting Chinese stocks. \r\nBut market watcher… [+1000 chars]",
		"titleScore": 4,
		"titleMarketGrams": "as unrest rattled markets \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Financially Free Investor",
		"title": "5 Relatively Safe And Cheap Dividend Stocks To Invest In - December 2022",
		"description": "In this article, we select 5 conservative DGI stocks from more than 7,500 companies that are traded on U.S. exchanges. Learn more about our process and picks here.",
		"url": "https://seekingalpha.com/article/4561808-5-relatively-safe-and-cheap-dividend-stocks-to-invest-in-december-2022",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1249993252/image_1249993252.jpg?io=getty-c-w750",
		"publishedAt": 1670076000000,
		"content": "Olivier Le Moal\r\nThe market sentiment has improved a lot during this past month or so on the renewed optimism of a Fed pivot. In fact, the S&amp;P 500 Index (SP500) has gained over 14% from its lows … [+27791 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "SA Stocks To Watch",
		"title": "Stocks To Watch: Oil Plays, Lowe's, Southwest Airlines And Lululemon In Focus",
		"description": "Get ahead of the market by subscribing to Seeking Alpha's Stocks to Watch, a preview of key events scheduled for the coming week",
		"url": "https://seekingalpha.com/article/4562083-stocks-to-watch-oil-plays-lowes-southwest-airlines-and-lululemon-in-focus",
		"urlToImage": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
		"publishedAt": 1670076000000,
		"content": "Get ahead of the market by subscribing to Seeking Alpha's Stocks to Watch, a preview of key events scheduled for the coming week. The newsletter keeps you informed of the biggest stories set to make … [+8245 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Dow Jones Stocks: Chevron Leads 5 Blue Chips Near Buy Points",
		"description": "Dow Jones stocks Boeing (BA), UnitedHealth (UNH), Caterpillar (CAT), Chevron (CVX) and Goldman Sachs (GS) are in focus this week.X The Dow Jones Industrial Average has been leading the current market rally, hitting a seven-month high recently. While it's made…",
		"url": "https://biztoc.com/x/a55c4a0687d9d1b2",
		"urlToImage": "https://c.biztoc.com/p/a55c4a0687d9d1b2/og.webp",
		"publishedAt": 1670075648000,
		"content": "Dow Jones stocks Boeing (BA), UnitedHealth (UNH), Caterpillar (CAT), Chevron (CVX) and Goldman Sachs (GS) are in focus this week.X\r\nThe Dow Jones Industrial Average has been leading the current marke… [+991 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Stock Split Watch: Is Chipotle Next?",
		"description": "When it comes to stocks with the potential for a stock split, Chipotle Mexican Grill (CMG -1.29%) is one that tops the list. At approximately $1,550 per share, its price potentially places whole shares out of reach for small investors. But does that mean a st…",
		"url": "https://biztoc.com/x/d7f9e7b0ad7128ce",
		"urlToImage": "https://c.biztoc.com/p/d7f9e7b0ad7128ce/og.webp",
		"publishedAt": 1670075406000,
		"content": "When it comes to stocks with the potential for a stock split, Chipotle Mexican Grill (CMG -1.29%) is one that tops the list. At approximately $1,550 per share, its price potentially places whole shar… [+972 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Top Growth Stocks That Are Screaming Buys in December",
		"description": "Growth stocks have taken a beating in 2022, making it easy to find great buying opportunities today. If a stock still has a robust business with healthy growth catalysts in this challenging economy, it can not only bounce back quickly, but also keep outperfor…",
		"url": "https://biztoc.com/x/274a91ba13fd14ec",
		"urlToImage": "https://c.biztoc.com/p/274a91ba13fd14ec/og.webp",
		"publishedAt": 1670075405000,
		"content": "Growth stocks have taken a beating in 2022, making it easy to find great buying opportunities today. If a stock still has a robust business with healthy growth catalysts in this challenging economy, … [+966 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Anders Bylund)",
		"title": "3 Top Growth Stocks That Are Screaming Buys in December",
		"description": "Thanks to undeniable growth catalysts and deeply discounted stock prices, these beaten-down stocks could soar in 2023.",
		"url": "https://www.fool.com/investing/2022/12/03/3-top-growth-stocks-that-are-screaming-buys-in-dec/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711638/money-casting-a-rocket-shadow.jpg",
		"publishedAt": 1670074860000,
		"content": "Growth stocks have taken a beating in 2022, making it easy to find great buying opportunities today. If a stock still has a robust business with healthy growth catalysts in this challenging economy, … [+4684 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "These money and investing tips can help you know when the bull market has come back to stay",
		"description": "Don’t miss these top money and investing features: - There’s a strong possibility that the bear market in stocks is over, as investors finally give up hope - More risk doesn’t always mean greater reward. Just look at these imploded tech stocks - Fed ‘pivot’ t…",
		"url": "https://biztoc.com/x/cf79114379d01ed6",
		"urlToImage": "https://c.biztoc.com/p/cf79114379d01ed6/og.webp",
		"publishedAt": 1670074804000,
		"content": "Dont miss these top money and investing features:\r\n- Theres a strong possibility that the bear market in stocks is over, as investors finally give up hope\r\n- More risk doesnt always mean greater rewa… [+989 chars]",
		"titleScore": 2,
		"titleMarketGrams": "when the bull market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Chip Stocks Will Decline in 2023, but That's Only Part of the Story",
		"description": "You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn …",
		"url": "https://biztoc.com/x/0a053e9a4ed7eb6a",
		"urlToImage": "https://c.biztoc.com/p/0a053e9a4ed7eb6a/og.webp",
		"publishedAt": 1670074566000,
		"content": "Youre reading a free article with opinions that may differ from The Motley Fools Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations… [+917 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Stocks That Could Soar in 2023",
		"description": "The past year was a good reminder that investors always have to be prepared for anything in the markets. While the stock market is one of the greatest wealth-building machines ever created, periods of over exuberance are often followed by market corrections, …",
		"url": "https://biztoc.com/x/663d222e61fbabc2",
		"urlToImage": "https://c.biztoc.com/p/663d222e61fbabc2/og.webp",
		"publishedAt": 1670074565000,
		"content": "The past year was a good reminder that investors always have to be prepared for anything in the markets. While the stock market is one of the greatest wealth-building machines ever created, periods o… [+970 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (John Ballard, Jeremy Bowman, and Jennifer Saibil)",
		"title": "3 Stocks That Could Soar in 2023",
		"description": "Patience with these stocks could lead to a nice payoff.",
		"url": "https://www.fool.com/investing/2022/12/03/3-stocks-that-could-soar-in-2023/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711188/happy-investor-because-the-stock-market-went-up.jpg",
		"publishedAt": 1670074200000,
		"content": "The past year was a good reminder that investors always have to be prepared for anything in the markets. While the stock market is one of the greatest wealth-building machines ever created, periods o… [+6905 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Jacob Sonenshine",
		"title": "Industrial Stocks Are Ready to Break Out. Caterpillar, Deere, and More Companies to Watch.",
		"description": "When stocks reach new highs, it often indicates the start of a new uptrend, even if gains must moderate before reaccelerating.",
		"url": "https://www.barrons.com/articles/caterpillar-deere-industrial-stocks-51670013931",
		"urlToImage": "https://images.barrons.com/im-678142/social",
		"publishedAt": 1670074200000,
		"content": "Stocks in the industrial sector have been on a tear. In aggregate, they are knocking on the door of reaching new heights.The Industrial Select Sector SPDR ETF (ticker: \r\n XLI\r\n ), home to \r\n Caterpil… [+3356 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Jose Najarro and Nicholas Rossolillo)",
		"title": "Chip Stocks Will Decline in 2023, but That's Only Part of the Story",
		"description": "Should semiconductor investors be worried?",
		"url": "https://www.fool.com/investing/2022/12/03/chip-stocks-will-decline-in-2023-but-thats-only-pa/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711628/copy-of-copy-of-jose-najarro-14.png",
		"publishedAt": 1670074200000,
		"content": "In today's video, Jose Najarro and Nick Rossolillo discuss a recent study by Gartner forecasting a decline in the semiconductor market in 2023. Want to know what these two semiconductor investors thi… [+207 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "insider@insider.com (Carla Mozée)",
		"title": "China's COVID policy is top of mind for investors as unrest rattled markets this week. Here are 5 things they're watching as Beijing signals willingness to loosen some restrictions.",
		"description": "From eyeing energy stocks to preparing for Xi Jinping dig in on his COVID policy, here's what some market experts are monitoring.",
		"url": "https://markets.businessinsider.com/news/stocks/china-zero-covid-policy-5-things-investors-markets-xi-investing-2022-12",
		"urlToImage": "https://i.insider.com/626e6d2a86fa90001905f200?width=1200&format=jpeg",
		"publishedAt": 1670074200000,
		"content": "Chinese equities finished higher this week after cities throughout the country relaxed some strict COVID-19 restrictions, but questions remain whether the government will fully scrap the zero-COVID p… [+5066 chars]",
		"titleScore": 4,
		"titleMarketGrams": "as unrest rattled markets \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Ultra-High-Yield Dividend Stocks to Buy This December",
		"description": "With stock prices swooning this year, dividend yields are higher. Because of that, income investors have more options if they're seeking a bigger payout. Three high-yielding dividend stocks some Fool.com contributors really like this month are Postal Realty (…",
		"url": "https://biztoc.com/x/c7d9118845f43ac5",
		"urlToImage": "https://c.biztoc.com/p/c7d9118845f43ac5/og.webp",
		"publishedAt": 1670073726000,
		"content": "With stock prices swooning this year, dividend yields are higher. Because of that, income investors have more options if they're seeking a bigger payout.\r\nThree high-yielding dividend stocks some Foo… [+979 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Matthew DiLallo, Brent Nyitray, CFA, and Marc Rapport)",
		"title": "3 Ultra-High-Yield Dividend Stocks to Buy This December",
		"description": "These companies could supply you with lots of passive income in 2023 and beyond.",
		"url": "https://www.fool.com/investing/2022/12/03/3-ultra-high-yield-dividend-stocks-to-buy-this-dec/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711114/a-rising-red-arrow-with-a-percentage-symbol-on-top-of-a-rising-stack-of-coins-with-a-house-in-the-background.jpg",
		"publishedAt": 1670073360000,
		"content": "With stock prices swooning this year, dividend yields are higher. Because of that, income investors have more options if they're seeking a bigger payout. \r\nThree high-yielding dividend stocks some Fo… [+6093 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Should You Buy the 3 Highest-Yielding Dividend Stocks in the Dow Jones?",
		"description": "During down markets like the one we are going through, investors tend to gravitate more toward income stocks -- stocks that pay out high dividends. Good dividend stocks not only pay you to own them every quarter, but they are also typically those of stable, e…",
		"url": "https://biztoc.com/x/7f462a447a43e5cb",
		"urlToImage": "https://c.biztoc.com/p/7f462a447a43e5cb/og.webp",
		"publishedAt": 1670072887000,
		"content": "During down markets like the one we are going through, investors tend to gravitate more toward income stocks -- stocks that pay out high dividends.\r\nGood dividend stocks not only pay you to own them … [+933 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Growth Stocks That New Investors Should Own for 2023",
		"description": "If you were a new investor in 2022, it was undoubtedly challenging. After years of positive annual returns, 2022 has been way different. The Nasdaq Composite index has fallen nearly 27% year to date, and it's been down as much as 34% at some points this year.…",
		"url": "https://biztoc.com/x/3bff6b2205a5f0b1",
		"urlToImage": "https://c.biztoc.com/p/3bff6b2205a5f0b1/og.webp",
		"publishedAt": 1670072887000,
		"content": "If you were a new investor in 2022, it was undoubtedly challenging. After years of positive annual returns, 2022 has been way different. The Nasdaq Composite index has fallen nearly 27% year to date,… [+976 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Got $1,000? These 2 Stocks Could Be Bargain Buys for 2022 And Beyond",
		"description": "If you looked at share price alone as an indicator of a quality business, you might end up missing out on some wonderful bargains on great companies. Likewise, you could also end up buying stocks just because they're trading down, not necessarily because the …",
		"url": "https://biztoc.com/x/6a502e587568971f",
		"urlToImage": "https://c.biztoc.com/p/6a502e587568971f/og.webp",
		"publishedAt": 1670072886000,
		"content": "If you looked at share price alone as an indicator of a quality business, you might end up missing out on some wonderful bargains on great companies. Likewise, you could also end up buying stocks jus… [+937 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "1 Thing You Need to Know Before You Buy Chip Stocks",
		"description": "You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn …",
		"url": "https://biztoc.com/x/eca470edda610fe7",
		"urlToImage": "https://c.biztoc.com/p/eca470edda610fe7/og.webp",
		"publishedAt": 1670072886000,
		"content": "Youre reading a free article with opinions that may differ from The Motley Fools Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations… [+943 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Jamie Louko)",
		"title": "3 Growth Stocks That New Investors Should Own for 2023",
		"description": "New to investing? If you're looking for individual stocks to buy, these three could be a great start.",
		"url": "https://www.fool.com/investing/2022/12/03/3-growth-stocks-new-investors-should-own-for-2023/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711353/couple-high-five-in-front-of-laptop.jpg",
		"publishedAt": 1670072400000,
		"content": "If you were a new investor in 2022, it was undoubtedly challenging. After years of positive annual returns, 2022 has been way different. The Nasdaq Composite index has fallen nearly 27% year to date,… [+4592 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Investor's Business Daily"
		},
		"author": "Investor's Business Daily",
		"title": "Dow Jones Stocks: Chevron Leads 5 Blue Chips Near Buy Points",
		"description": "Chevron is a blue-chip leader as the Dow leads the market rally.",
		"url": "https://www.investors.com/news/dow-jones-stocks-chevron-leads-5-blue-chips-near-buy-points/",
		"urlToImage": "https://www.investors.com/wp-content/uploads/2021/06/Stock-wallstreetflag-01-adobe.jpg",
		"publishedAt": 1670072400000,
		"content": "Dow Jones stocks Boeing (BA), UnitedHealth (UNH), Caterpillar (CAT), Chevron (CVX) and Goldman Sachs (GS) are in focus this week.\r\nXThe Dow Jones Industrial Average has been leading the current marke… [+9325 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "How to Stack the Odds in Your Favor…",
		"description": "How to Stack the Odds in Your Favor… Most investors have had a rough time in the turbulent 2022 stock market (SPY). Now more than ever they need a reliable way to identify winning stocks regardless of the... Most investors have had a rough time in the turbule…",
		"url": "https://biztoc.com/x/7f0c23e4ead19cd3",
		"urlToImage": "https://c.biztoc.com/p/7f0c23e4ead19cd3/og.webp",
		"publishedAt": 1670072298000,
		"content": "How to Stack the Odds in Your Favor\r\nMost investors have had a rough time in the turbulent 2022 stock market (SPY). Now more than ever they need a reliable way to identify winning stocks regardless o… [+1021 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "thestreet.com",
		"title": "3 Dividend Stocks With Low Volatility and Above-Average Yields",
		"description": "Bear markets, such as 2022, generally leave few places for investors to hide. Most stocks are priced with some level of growth in mind, and therefore, when the fear of recession or higher interest rates strikes, most stocks move lower. However, there are some…",
		"url": "https://biztoc.com/x/43807a3c1cd0ab0c",
		"urlToImage": "https://c.biztoc.com/p/43807a3c1cd0ab0c/og.webp",
		"publishedAt": 1670072284000,
		"content": "Bear markets, such as 2022, generally leave few places for investors to hide. Most stocks are priced with some level of growth in mind, and therefore, when the fear of recession or higher interest ra… [+955 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Dave Kovaleski)",
		"title": "Should You Buy the 3 Highest-Yielding Dividend Stocks in the Dow Jones?",
		"description": "These three stocks all boast high yields, but one looks like the best option for dividend investors.",
		"url": "https://www.fool.com/investing/2022/12/03/should-buy-3-highest-yielding-dividend-stocks-dow/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711472/at-home-index-funds.jpg",
		"publishedAt": 1670072220000,
		"content": "During down markets like the one we are going through, investors tend to gravitate more toward income stocks -- stocks that pay out high dividends.\r\nGood dividend stocks not only pay you to own them … [+4425 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Rachel Warren)",
		"title": "Got $1,000? These 2 Stocks Could Be Bargain Buys for 2022 And Beyond",
		"description": "Don't let recent market events deter you from investing in remarkable businesses.",
		"url": "https://www.fool.com/investing/2022/12/03/got-1000-these-2-stocks-could-be-bargain-buys-for/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711129/dapper-person-smiling-looking-away.jpg",
		"publishedAt": 1670071860000,
		"content": "If you looked at share price alone as an indicator of a quality business, you might end up missing out on some wonderful bargains on great companies. Likewise, you could also end up buying stocks jus… [+6365 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Jose Najarro and Nicholas Rossolillo)",
		"title": "1 Thing You Need to Know Before You Buy Chip Stocks",
		"description": "The consumer market is creating numerous headwinds for the semiconductor sector.",
		"url": "https://www.fool.com/investing/2022/12/03/1-thing-you-need-to-know-before-you-buy-chip-stock/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711627/copy-of-copy-of-jose-najarro-13.png",
		"publishedAt": 1670071500000,
		"content": "In today's video, Jose Najarro and Nick Rossolillo discuss Advanced Micro Devices (AMD -3.23%), Nvidia (NVDA -1.51%), and recent reports regarding the consumer market. Check out the short video to le… [+172 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Stocks to Buy Hand Over Fist in December",
		"description": "High conviction. That's what you want to have with the stocks you buy. Such stocks are ones that you can be enthusiastic about -- and buy heavily. We asked three Motley Fool contributors to identify stocks for which they have high convictions about buying rig…",
		"url": "https://biztoc.com/x/50a1a0ac16dfebd6",
		"urlToImage": "https://c.biztoc.com/p/50a1a0ac16dfebd6/og.webp",
		"publishedAt": 1670071206000,
		"content": "High conviction. That's what you want to have with the stocks you buy. Such stocks are ones that you can be enthusiastic about -- and buy heavily.\r\nWe asked three Motley Fool contributors to identify… [+966 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Got $1,000? 2 Ultra High-Yield Dividend Stocks to Get Your Hands On",
		"description": "When done right and not for the purpose of simply chasing yield, income investing can drastically alter your perspective of the events going on around you. While everyone else panics amid a sell-off in financial markets, you can sleep well at night. This is b…",
		"url": "https://biztoc.com/x/d7c457065352c83e",
		"urlToImage": "https://c.biztoc.com/p/d7c457065352c83e/og.webp",
		"publishedAt": 1670071205000,
		"content": "When done right and not for the purpose of simply chasing yield, income investing can drastically alter your perspective of the events going on around you. While everyone else panics amid a sell-off … [+953 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Adding $500 to These 3 Stocks Would Be a Genius Move Right Now",
		"description": "Buying shares of great companies at a good price is a genius move at any time, and the current market beatdown has left many an equity sitting in what could be prime territory for a long-term buy. I especially favor dividend-paying stocks for their passive in…",
		"url": "https://biztoc.com/x/cdf26407686d62a2",
		"urlToImage": "https://c.biztoc.com/p/cdf26407686d62a2/og.webp",
		"publishedAt": 1670071205000,
		"content": "Buying shares of great companies at a good price is a genius move at any time, and the current market beatdown has left many an equity sitting in what could be prime territory for a long-term buy.\r\nI… [+933 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Keith Speights, David Jagielski, and Prosper Junior Bakiny)",
		"title": "3 Stocks to Buy Hand Over Fist in December",
		"description": "These stocks could be big winners.",
		"url": "https://www.fool.com/investing/2022/12/03/3-stocks-to-buy-hand-over-fist-in-december/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711408/cheering-person-with-laptop.jpg",
		"publishedAt": 1670070660000,
		"content": "High conviction. That's what you want to have with the stocks you buy. Such stocks are ones that you can be enthusiastic about -- and buy heavily.\r\nWe asked three Motley Fool contributors to identify… [+5363 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "247wallst.com",
		"title": "5 Well-Known Buy-Rated Stocks That Were Red-Hot but Now Trade Under $10",
		"description": "While most of Wall Street focuses on large-cap and mega-cap stocks, as they provide a degree of safety and liquidity, many investors are limited in the number of shares they can buy. Many of the biggest public companies, especially the technology giants, trad…",
		"url": "https://biztoc.com/x/ea6169b440c81713",
		"urlToImage": "https://c.biztoc.com/p/ea6169b440c81713/og.webp",
		"publishedAt": 1670070605000,
		"content": "While most of Wall Street focuses on large-cap and mega-cap stocks, as they provide a degree of safety and liquidity, many investors are limited in the number of shares they can buy. Many of the bigg… [+951 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "How to Deduct Stock Losses on Your Taxes",
		"description": "Capital gains and capital losses both have tax implications. When you sell stocks for a profit, you owe taxes on those gains. These taxes are calculated based on capital gains rates. However, when it comes to investments, the IRS taxes you based on your net g…",
		"url": "https://biztoc.com/x/562ffc60fbb69298",
		"urlToImage": "https://c.biztoc.com/p/562ffc60fbb69298/og.webp",
		"publishedAt": 1670070605000,
		"content": "Capital gains and capital losses both have tax implications. When you sell stocks for a profit, you owe taxes on those gains. These taxes are calculated based on capital gains rates. However, when it… [+996 chars]",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Kody Kester)",
		"title": "Got $1,000? 2 Ultra High-Yield Dividend Stocks to Get Your Hands On",
		"description": "These two stocks offer whopping dividend yields ranging from 5.5% to 8%.",
		"url": "https://www.fool.com/investing/2022/12/03/got-1000-2-ultra-high-yield-dividend-stocks-mo-med/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711641/a-businessperson-prepares-a-report.jpg",
		"publishedAt": 1670070600000,
		"content": "When done right and not for the purpose of simply chasing yield, income investing can drastically alter your perspective of the events going on around you. While everyone else panics amid a sell-off … [+3417 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Marc Rapport)",
		"title": "Adding $500 to These 3 Stocks Would Be a Genius Move Right Now",
		"description": "Three REITs, one result: good payback from established players.",
		"url": "https://www.fool.com/investing/2022/12/03/adding-500-to-these-3-stocks-would-be-a-genius-mov/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711262/woman-works-in-data-center-datacenter.jpg",
		"publishedAt": 1670070600000,
		"content": "Buying shares of great companies at a good price is a genius move at any time, and the current market beatdown has left many an equity sitting in what could be prime territory for a long-term buy.\r\nI… [+3110 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "Small-Cap Stocks Are Set for Big Gains. 12 Holiday Bargains",
		"description": "Small-cap stocks are priced for jumbo gains. One money manager predicts that they’ll outshine large-caps by close to four percentage points a year over the next five years. A big investment bank is even more bullish on small-caps for the coming decade. Though…",
		"url": "https://biztoc.com/x/324ee61a5e31fab1",
		"urlToImage": "https://c.biztoc.com/p/324ee61a5e31fab1/og.webp",
		"publishedAt": 1670069764000,
		"content": "Small-cap stocks are priced for jumbo gains. One money manager predicts that theyll outshine large-caps by close to four percentage points a year over the next five years. A big investment bank is ev… [+183 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "My 2 Top Growth Stocks to Buy for 2023 and Beyond",
		"description": "The market has punished growth stocks over the last year, and that trend could continue well into 2023 due to several factors. For instance, the Federal Reserve is planning to further increase benchmark interest rates in its ongoing effort to tame high inflat…",
		"url": "https://biztoc.com/x/2fe4c3a9a6eb8a53",
		"urlToImage": "https://c.biztoc.com/p/2fe4c3a9a6eb8a53/og.webp",
		"publishedAt": 1670069526000,
		"content": "The market has punished growth stocks over the last year, and that trend could continue well into 2023 due to several factors. For instance, the Federal Reserve is planning to further increase benchm… [+960 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Warren Buffett Stocks to Buy Hand Over Fist in December",
		"description": "Berkshire Hathaway (BRK.A 0.07%) (BRK.B 0.10%) is led by arguably the most successful investor of all time, its chairman and chief executive officer Warren Buffett. With a net worth topping $100 billion, the Oracle of Omaha routinely places among the top 10 r…",
		"url": "https://biztoc.com/x/7a3eb8652b13fd1e",
		"urlToImage": "https://c.biztoc.com/p/7a3eb8652b13fd1e/og.webp",
		"publishedAt": 1670069525000,
		"content": "Berkshire Hathaway (BRK.A 0.07%) (BRK.B 0.10%) is led by arguably the most successful investor of all time, its chairman and chief executive officer Warren Buffett. With a net worth topping $100 bill… [+983 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "The Best Stocks to Buy With $500 Right Now in December",
		"description": "Here are two stocks to buy in December if you've got $500 that you're looking to invest in the stock market. *Stock prices used were the afternoon prices of Dec. 2, 2022. The video was published on Dec. 2, 2022. Here are two stocks to buy in December if you'v…",
		"url": "https://biztoc.com/x/c921dfb3a984a2cf",
		"urlToImage": "https://c.biztoc.com/p/c921dfb3a984a2cf/og.webp",
		"publishedAt": 1670069525000,
		"content": "Here are two stocks to buy in December if you've got $500 that you're looking to invest in the stock market.\r\n*Stock prices used were the afternoon prices of Dec. 2, 2022. The video was published on … [+921 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Prosper Junior Bakiny)",
		"title": "My 2 Top Growth Stocks to Buy for 2023 and Beyond",
		"description": "Long-time shareholders of these companies can testify that both have patterns of beating the market.",
		"url": "https://www.fool.com/investing/2022/12/03/my-2-top-growth-stocks-to-buy-for-2023-and-beyond/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/710871/physician-talking-to-patient.jpg",
		"publishedAt": 1670069340000,
		"content": "The market has punished growth stocks over the last year, and that trend could continue well into 2023 due to several factors. For instance, the Federal Reserve is planning to further increase benchm… [+5405 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Kody Kester)",
		"title": "2 Warren Buffett Stocks to Buy Hand Over Fist in December",
		"description": "Berkshire Hathaway owns small stakes in these two blue-chip stocks.",
		"url": "https://www.fool.com/investing/2022/12/03/warren-buffett-stocks-to-buy-in-december/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711220/berkshire-hathaway-chief-executive-officer-warren-buffett.jpg",
		"publishedAt": 1670068800000,
		"content": "Berkshire Hathaway(BRK.A 0.07%) (BRK.B 0.10%) is led by arguably the most successful investor of all time, its chairman and chief executive officer Warren Buffett. With a net worth topping $100 billi… [+3857 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	}
]