[
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Jennifer Saibil)",
		"title": "3 Growth Stocks That Could 5x in 2023",
		"description": "These stocks are cheap or have huge potential or both.",
		"url": "https://www.fool.com/investing/2022/12/03/3-growth-stocks-that-could-5x-in-2023/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/710828/a-person-signing-for-a-package-delivery.jpg",
		"publishedAt": 1670065200000,
		"content": "\n2022 has been a big year for value stocks, many of which are beating the market. Growth investing took a backseat to safer approaches after years of wealth creation while the economy became volatile. But 2023 is on the horizon, and the market could change very quickly. \nAs many sky-high valuations on growth stocks bottom out, these stocks could really start up again in the new year. A responsible approach to growth investing, which takes valuation into account along with growth prospects, could help you achieve your investing goals this year.\nIt's unlikely for any stock to gain five times its value in one year sustainably, but there are those rare stocks out there that appear to be strongly undervalued or have such massive potential that they could really skyrocket. Global-e online (GLBE -2.46%), Revolve Group (RVLV 6.93%), and Portillo's (PTLO 3.26%) are my recommendations for growth stocks that could explode in 2023.\n1. The best e-commerce stock you never heard of\nGlobal-e provides cross-border e-commerce solutions for direct-to-consumer retailers. As a customer, you wouldn't interact with the company directly, but you might use some of its services integrated into a client website.\nIt has an impressive list of partner clients that continues to grow, including names such as Disney, LVMH, and Hugo Boss. Plus, with its recent acquisition of Borderfree, it now has even more marquee clients, like Saks Fifth Avenue and Nordstrom. \nThe company's services add a compelling dimension to a direct-to-consumer growth strategy. It cites many customer success stories: The Native Shoe Company's international conversion rates increased by 87% in one year when it partnered with Global-e, and luggage brand Doughnut increased international orders by 210% in one year. \n\nIt's not surprising that so many companies are signing on, even in the challenging economy. Actually, that might even be more of a reason since retailers facing slowing or declining sales are looking for new ways to invigorate sales rates.\nThat's why even in the third quarter, it demonstrated robust growth.\nSales increased 79% over last year to $621 million. Gross profit increased 92% over last year, and adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) improved from $7.7 million to $12.5 million. Net loss, however, widened from $28.5 million to $64.6 million.\nA big part of that continued to be the amortization of warrants related to Shopify's investment in Global-e, and as that amortizes and the company continues to scale, profitability should improve.\nGlobal-e stock is down 69% in 2022 and still trades at almost nine times trailing-12-month sales, so it's not cheap. But the potential here is enormous, and as sales increase and profitability improves, this stock could be a standout.\n2. The intersection of fashion and technology\nRevolve Group is a fashion company that uses artificial intelligence, technology, and social media to sell clothing and related products. It boasts 70,000 apparel items, and it plans to branch out into beauty, shoes, and accessories, expanding its fashion empire.\nMillennial and Gen-Z fans are hooked. They continue to buy and increase order value despite inflation, so even though Revolve's growth is decelerating in this environment, it's well positioned to maintain its momentum and return to higher growth in better times.\n\nThis is a founder-led company, and its co-CEOs are highly focused on operational excellence and differentiation. They went for a new concept when they created Revolve almost 20 years ago, and traditional fashion retailers are now trying to catch up. \nRevolve's sales increased 10% year over year in the third quarter, and net income decreased by 28%. Revolve's high-fashion site, FWRD, targets a more affluent customer and continues to outperform the rest of the company, posting a 17% sales increase. And the company generated $9 million in free cash flow, a triple-digit increase over last year.\nBecause the company is completely online, it doesn't have to pay for costly store space or hold tons of inventory.\nIt was able to rebalance inventory levels when demand began to decrease in the second quarter, and other companies were left with overflow. That's allowed it to stay profitable and cash-flow positive despite slowing demand. And since it relies on artificial intelligence for critical and current data, it was able to do that while still offering customers the merchandise they were looking for, keeping the sales flow steady. These are qualities that make it a retail superstar.\nRevolve stock is down 55% this year and trades at a price-to-earnings ratio of 24. It's cheap, and it has tons of potential in 2023 and beyond.\n3. Getting a better burger\nPortillo's is a small fast-casual burger chain that says it offers \"unrivaled Chicago street food.\" It's been around as an iconic Chicago emblem since 1963, but it opened its first store outside of Illinois in 2005, with plans for real expansion in 2015. It went public last year, and its stock has been down 49% since then.\nThe restaurant chain now operates 71 stores, which is tiny compared to chains that offer similar fare, like Chipotle Mexican Grill (almost 3,100) and Shake Shack (402).\n\nIt's demonstrating robust growth, with a 10% year-over-year sales increase in the third quarter, including a 6% comparable sales increase. Even better, it's profitable, although net income decreased from $6.5 million last year to $3.2 million this year. Profitability is likely to be variable as the company scales, but posting positive net income at this stage is a great signal of healthy growth.\nOut of the stocks on this list, Portillo's seems to have the most unknowns since it's so new and so small, making it somewhat risky. But it's quite cheap, trading at 1.5 times trailing-12-month sales, and it has serious potential to expand.\nConsidering its valuation, size, and popularity, Portillo's looks like it could be a huge asset to a growth-oriented portfolio, in 2023 and for many years.\n\nJennifer Saibil has positions in Global-e Online and Walt Disney. The Motley Fool has positions in and recommends Chipotle Mexican Grill, Global-e Online, Revolve Group, Shopify, and Walt Disney. The Motley Fool recommends the following options: long January 2023 $1,140 calls on Shopify, long January 2024 $145 calls on Walt Disney, short January 2023 $1,160 calls on Shopify, and short January 2024 $155 calls on Walt Disney. The Motley Fool has a disclosure policy.\n",
		"isFull": true,
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Adria Cimino)",
		"title": "5 Monster Stocks to Buy Before 2023",
		"description": "These companies offer solid buying opportunities right now.",
		"url": "https://www.fool.com/investing/2022/12/03/5-monster-stocks-to-buy-before-2023/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711548/gettyimages-online-shopping-christmas-tree.jpg",
		"publishedAt": 1670065200000,
		"content": "The bear market may not feel like a great time for investing. But here's the thing: It actually is one of the best times to buy stocks. That's because you can pick up stocks that may have been expens… [+6786 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Keith Speights)",
		"title": "12 Top Stocks to Buy in December",
		"description": "Add this dandy dozen to your stocking this month.",
		"url": "https://www.fool.com/investing/2022/12/03/12-top-stocks-to-buy-in-december/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/710761/person-smiling-and-looking-at-laptop.jpg",
		"publishedAt": 1670065020000,
		"content": "The number 12 is tightly linked with December. It's the 12th month, of course. There are 12 days of Christmas, according to the traditional carol. Allow me to add one more connection with 12 to the l… [+5675 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Keith Speights)",
		"title": "73% of Warren Buffett's Portfolio Is in These 5 Stocks as 2022 Winds Down",
		"description": "Three of them have handily beaten the market this year.",
		"url": "https://www.fool.com/investing/2022/12/03/warren-buffett-portfolio-5-stocks-2022-winds-down/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/710760/warren-buffett-tmf.jpg",
		"publishedAt": 1670064900000,
		"content": "What are Warren Buffett's favorite stocks? You could argue for several candidates. However, ultimately, the answer boils down to which stocks he is invested in most heavily.\r\nOn that score, no guessw… [+3320 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Ultra-High-Yield Dividend Stocks That Billionaires Are Buying Hand Over Fist",
		"description": "Any way you look at it, putting your money to work in the stock market has been awfully frightening this year. All three of the major market indexes experienced peak-to-trough declines of more than 20% this year. This has been a rotten year for most of the st…",
		"url": "https://biztoc.com/x/76ae5a28dfaec541",
		"urlToImage": "https://c.biztoc.com/p/76ae5a28dfaec541/og.webp",
		"publishedAt": 1670064485000,
		"content": "Any way you look at it, putting your money to work in the stock market has been awfully frightening this year. All three of the major market indexes experienced peak-to-trough declines of more than 2… [+986 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Daniel Foelber, Scott Levine, and Lee Samaha)",
		"title": "Is Your Investment Portfolio Down Big? 3 Dividend Stocks to Buy Now",
		"description": "This basket of passive income powerhouse stocks blends growth, value, and income.",
		"url": "https://www.fool.com/investing/2022/12/03/investment-portfolio-down-big-dividend-stocks-buy/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711151/a-person-sitting-on-a-tractor-looks-out-into-an-open-field-with-a-setting-sun-over-the-tree-line.jpg",
		"publishedAt": 1670064300000,
		"content": "2022 is on track to be the worst year for the S&amp;P 500, Nasdaq Composite, and Dow Jones Industrial Average since 2008. So it's OK if your investment portfolio is down big.\r\nOne of the best lessons… [+6376 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Cory Renauer)",
		"title": "2 Ultra-High-Yield Dividend Stocks That Billionaires Are Buying Hand Over Fist",
		"description": "Billionaire hedge fund managers aren't letting a bear market stop them from buying up stocks that pay huge dividend yields.",
		"url": "https://www.fool.com/investing/2022/12/03/2-ultra-high-yield-dividend-stocks-that-billionair/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711363/couple-at-home-with-device-getty.jpg",
		"publishedAt": 1670063940000,
		"content": "Any way you look at it, putting your money to work in the stock market has been awfully frightening this year. All three of the major market indexes experienced peak-to-trough declines of more than 2… [+3804 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Here’s why the smart money is betting on value stocks to outperform growth",
		"description": "You should be skeptical of the growth story that periodically captures stock investors’ attention. That’s because the companies that Wall Street believes will grow the fastest in the future rarely live up to the lofty expectations investors put on them. The l…",
		"url": "https://biztoc.com/x/e6f33a881fd867c2",
		"urlToImage": "https://c.biztoc.com/p/e6f33a881fd867c2/og.webp",
		"publishedAt": 1670063884000,
		"content": "You should be skeptical of the growth story that periodically captures stock investors attention. Thats because the companies that Wall Street believes will grow the fastest in the future rarely live… [+995 chars]",
		"titleScore": 3,
		"titleMarketGrams": "betting on value stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Business Today"
		},
		"author": "Prince Tyagi",
		"title": "Nifty and Sensex posted second consecutive weekly gains after hitting all time highs amid signals of cooling off global inflation",
		"description": "As many as 41 stocks in the Nifty 50 index delivered a positive return to investors in the passing week. With a gain of (5.8 per cent), Britannia Industries emerged as the top gainer in the index.",
		"url": "https://www.businesstoday.in/markets/top-story/story/nifty-and-sensex-posted-second-consecutive-weekly-gains-after-hitting-all-time-highs-amid-signals-of-cooling-off-global-inflation-355154-2022-12-03",
		"urlToImage": "https://akm-img-a-in.tosshub.com/businesstoday/images/story/202212/stock-market-2616931_1280-sixteen_nine.jpg",
		"publishedAt": 1670063731000,
		"content": "The Federal Open Market Committee (FOMC) minutes which hinted towards a less hawkish approach in the coming policies are expected to start a rally in global equities. While in the domestic market, In… [+3276 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "Bitcoin Falls as Jobs Report Is a Harsh Reminder of Crypto’s Link to Stocks",
		"description": "Bitcoin and other cryptocurrencies were falling Friday, weakening after a stronger-than-expected U.S. jobs report for November sent both stocks and digital assets lower. It’s a tough reminder of the correlation between equities and cryptos. The price of Bitco…",
		"url": "https://biztoc.com/x/c2673473ca113e9d",
		"urlToImage": "https://c.biztoc.com/p/c2673473ca113e9d/og.webp",
		"publishedAt": 1670063405000,
		"content": "Bitcoin and other cryptocurrencies were falling Friday, weakening after a stronger-than-expected U.S. jobs report for November sent both stocks and digital assets lower. Its a tough reminder of the c… [+565 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "From Bank of America to Morgan Stanley, Wall Street giants are expecting stocks to crash more than 20% next year. Here's what they've been saying",
		"description": "Three major Wall Street banks all see the S&P 500 tanking over 20% next year. Andrew Burton/Getty Images Three major Wall Street banks expect the S&P 500 to tank over 20% at some point next year. US stocks face a recession, cuts to earnings outlooks and liqui…",
		"url": "https://biztoc.com/x/c80652b77270bd1c",
		"urlToImage": "https://c.biztoc.com/p/c80652b77270bd1c/og.webp",
		"publishedAt": 1670063404000,
		"content": "Three major Wall Street banks all see the S&amp;P 500 tanking over 20% next year.\r\nAndrew Burton/Getty Images\r\nThree major Wall Street banks expect the S&amp;P 500 to tank over 20% at some point next… [+996 chars]",
		"titleScore": -2,
		"titleMarketGrams": "giants are expecting stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Top Stocks In Multiple Industries Build Bases As Market Gains Strength",
		"description": "Top IBD 50 stocks in wide-ranging industries are forming cup bases as the stock market surges. Beverage, chip, airline, energy and biotech plays are among these growth stocks to watch, including Celsius (CELH), Genmab (GMAB), Lattice Semiconductor (LSCC), Equ…",
		"url": "https://biztoc.com/x/9d3226ef6f5172e3",
		"urlToImage": "https://c.biztoc.com/p/9d3226ef6f5172e3/og.webp",
		"publishedAt": 1670063046000,
		"content": "Top IBD 50 stocks in wide-ranging industries are forming cup bases as the stock market surges. Beverage, chip, airline, energy and biotech plays are among these growth stocks to watch, including Cels… [+1004 chars]",
		"titleScore": 6,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Nasdaq Bear Market: 5 Impressive Growth Stocks You'll Regret Not Buying on the Dip",
		"description": "The past year has been a night-and-day difference for Wall Street. One year ago, historically low interest rates were fueling a boom in growth stocks that seemed to have no end in sight, and the growth-driven Nasdaq Composite (^IXIC -0.18%) was hitting a fres…",
		"url": "https://biztoc.com/x/c0cda3437b8ceeb9",
		"urlToImage": "https://c.biztoc.com/p/c0cda3437b8ceeb9/og.webp",
		"publishedAt": 1670062805000,
		"content": "The past year has been a night-and-day difference for Wall Street. One year ago, historically low interest rates were fueling a boom in growth stocks that seemed to have no end in sight, and the grow… [+965 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Sean Williams)",
		"title": "Nasdaq Bear Market: 5 Impressive Growth Stocks You'll Regret Not Buying on the Dip",
		"description": "These sensational growth stocks are bargain-priced following a peak decline of 38% for the Nasdaq Composite.",
		"url": "https://www.fool.com/investing/2022/12/03/nasdaq-bear-market-5-growth-stocks-regret-not-buy/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711004/bear-market-stocks-plunge-crash-invest-correction-getty.jpg",
		"publishedAt": 1670061960000,
		"content": "The past year has been a night-and-day difference for Wall Street. One year ago, historically low interest rates were fueling a boom in growth stocks that seemed to have no end in sight, and the grow… [+8409 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "ztayeb@businessinsider.com (Zahra Tayeb)",
		"title": "From Bank of America to Morgan Stanley, Wall Street giants are expecting stocks to crash more than 20% next year. Here's what they've been saying.",
		"description": "The S&P 500 will tank in 2023 as a US recession hits, companies lower their earnings outlooks and the Fed's tightening causes pain, the banks predict.",
		"url": "https://markets.businessinsider.com/news/stocks/stock-market-crash-2023-outlook-morgan-stanley-bofa-deutsche-bank-2022-12",
		"urlToImage": "https://i.insider.com/621608ed081b26001840720c?width=1200&format=jpeg",
		"publishedAt": 1670061600000,
		"content": "Three top Wall Street banks are singing from the same downbeat hymn sheet, as each predicts US stocks could fall by more than 20% next year.\r\nFor Bank of America, a Federal Reserve-induced liquidity … [+4247 chars]",
		"titleScore": -2,
		"titleMarketGrams": "giants are expecting stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Alberto Abaterusso",
		"title": "Why Century Aluminum Company Could Continue To Underperform",
		"description": "Century Aluminum Company is one of the US-listed aluminum stocks. See why I believe that CENX’s revenue and earnings are unlikely to improve.",
		"url": "https://seekingalpha.com/article/4562145-why-century-aluminum-company-could-underperform",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/646996026/image_646996026.jpg?io=getty-c-w750",
		"publishedAt": 1670060374000,
		"content": "Bet_Noire\r\nThe Macroeconomic Situation Does Not Favor the Aluminum Industry\r\n Aluminum is a material widely used in various industries such as infrastructure, construction, electrical and electronics… [+9375 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "Chinese Solar Makers Evaded U.S. Tariffs, Investigation Finds - The New York Times",
		"description": "Chinese Solar Makers Evaded U.S. Tariffs, Investigation FindsThe New York Times Feds find four Chinese solar panel companies have been evading US tariffsCNN Chinese Solar Manufacturers Dodged U.S. Tariffs, Probe FindsThe Wall Street Journal Federal probe find…",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=168607336",
		"urlToImage": null,
		"publishedAt": 1670056363000,
		"content": "When in doubt, mumble; when in trouble, delegate; when in charge, ponder.\r\n-- James H. Boren",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Lance Roberts",
		"title": "Lessons From The 'Nifty Fifty'",
		"description": "The 'Nifty Fifty' refers to the fifty most popular large-cap stocks in the 1960s and '70s.",
		"url": "https://seekingalpha.com/article/4562134-lessons-from-the-nifty-fifty",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/587540824/image_587540824.jpg?io=getty-c-w750",
		"publishedAt": 1670054940000,
		"content": "benjaminec/iStock via Getty Images\r\nRecently, Bank of America discussed the \"5-Lessons From The Nifty Fifty.\" Of course, if you are unfamiliar with the importance of \"The Nifty Fifty,\" it is worth ex… [+7219 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Ozbargain.com.au"
		},
		"author": "HairyChickens",
		"title": "[QLD] 4x Complimentary Tickets to The Tennis United Cup in Brisbane + $4.95 Booking Fee Per Ticket @ Promotix",
		"description": "Realised no one has posted this yet and thought it might benefit some Queensland Tennis fans. More matches than the Sydney one too\n\nFrom Website\n\n\n UNITED CUP TENNIS TOURNAMENT 2023 - Brisbane Series\n In a world first, the United Cup showcases equality at the…",
		"url": "https://www.ozbargain.com.au/node/742980",
		"urlToImage": "https://files.ozbargain.com.au/n/80/742980l.jpg?h=01aedf0e",
		"publishedAt": 1670054661000,
		"content": "Realised no one has posted this yet and thought it might benefit some Queensland Tennis fans. More matches than the Sydney one too\r\nFrom Website\r\nUNITED CUP TENNIS TOURNAMENT 2023 - Brisbane SeriesIn… [+2375 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Solar Stocks Rise as US Probe Findings Better Than Market Feared",
		"description": "Solar Stocks Rise as US Probe Findings Better Than Market Feared Bloomberg",
		"url": "https://biztoc.com/x/a3b04f27d7555719",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670054645000,
		"content": "Solar Stocks Rise as US Probe Findings Better Than Market Feared Bloomberg \r\n This story appeared first on bloomberg.com, 2022-12-02.",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "robinsharma88",
		"title": "Index Contributors",
		"description": "The Index Contributors can be used to determine whether the index is bullish or bearish (Nifty contributors and Banknifty contributors). The index is made up of several equities, and the contribution of each stock depends on its weight. When more stocks are b…",
		"url": "https://slashdot.org/submission/16979582/index-contributors",
		"urlToImage": null,
		"publishedAt": 1670053893000,
		"content": "When in doubt, mumble; when in trouble, delegate; when in charge, ponder.\r\n-- James H. Boren",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Globalsecurity.org"
		},
		"author": "John Pike",
		"title": "Army awards $431 million contract for HIMARS",
		"description": "The U.S. Army awarded a $430,930,711 contract to the Lockheed Martin Corporation yesterday for full-rate production of High Mobility Artillery Rocket Systems M142 launchers to support the Army and various U.S. Foreign Military Sales partners. The contract wil…",
		"url": "https://www.globalsecurity.org/military/library/news/2022/12/mil-221202-army01.htm",
		"urlToImage": null,
		"publishedAt": 1670053778000,
		"content": "By U.S. Army Public Affairs December 2, 2022\r\nWASHINGTON -- The U.S. Army awarded a $430,930,711 contract to the Lockheed Martin Corporation yesterday for full-rate production of High Mobility Artill… [+1727 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Vidya Sreedhar",
		"title": "This smallcase manager is betting on 3 smallcap stocks in tune with India growth themes",
		"description": "Decarbonisation, sustainability, manufacturing and consumption are the themes that have emerged in India in the last two years",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/this-smallcase-manager-is-betting-on-3-smallcap-stocks-in-tune-with-india-growth-themes/articleshow/95957685.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95957673,width-1070,height-580,imgsize-152180,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670053407000,
		"content": "Smallcase manager and founder of Niveshaay Arvind Kothari is betting on smallcap stocks such as Shivalik Bi-metal, , and that could be major beneficiaries in the areas of green energy and manufacturi… [+6796 chars]",
		"titleScore": 2,
		"titleMarketGrams": "on 3 smallcap stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Vidya Sreedhar",
		"title": "Realty stocks lead D-Street investors’ shopping list; risk reward remains favourable",
		"description": "The BSE Realty index clocked over 4% gains, being the top sectoral index gainer for the week.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/realty-stocks-lead-d-street-investors-shopping-list-risk-reward-remains-favourable/articleshow/95956603.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95956623,width-1070,height-580,imgsize-48730,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670049642000,
		"content": "After the recent underperformance, the broader market not only played catch-up, but also managed to outpace benchmark indices in the week gone by. \r\nBut within the midcap and smallcap segments, the s… [+2596 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Realty stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Whatkatewore.com"
		},
		"author": "admin",
		"title": "The Princess Goes Green for Earthshot Prize Awards",
		"description": "The Princess of Wales chose a vivid green gown by Solace London for tonight's Earthshot Prize Awards. \r\n\r\nShe accessorized with glittering emeralds and diamonds. \r\n\r\nRichard Palmer of The Express shared a video of the couple arriving.  \r\n\r\nThe Prince and Prin…",
		"url": "https://whatkatewore.com/2022/12/03/the-princess-goes-green-for-earthshot-prize-awards/",
		"urlToImage": null,
		"publishedAt": 1670049616000,
		"content": "The Princess of Wales chose a vivid green gown by Solace London for tonight’s Earthshot Prize Awards. \r\nShe accessorized with glittering emeralds and diamonds. \r\nRichard Palmer of The Express shared … [+12494 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "S&P 500 ends slightly lower after jobs report - Reuters",
		"description": "S&P 500 ends slightly lower after jobs reportReuters Stock market news live updates: Stocks close little changed after strong jobs reportYahoo Finance S&P 500 and Nasdaq end Friday lower after November jobs report; indexes notch weekly gainsCNBC Jobs report, …",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=168605042",
		"urlToImage": null,
		"publishedAt": 1670047982000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "thestreet.com",
		"title": "Disney Makes Morningstar List of Stocks to Buy Now",
		"description": "With stocks down 15% so far this year, now might be a good time to invest. You might want to consider Morningstar’s list of “the 10 best companies to invest in now.” The investment research firm has a roster of the best 129 stocks to invest in generally. Thes…",
		"url": "https://biztoc.com/x/9b3d75a64808a686",
		"urlToImage": "https://c.biztoc.com/p/9b3d75a64808a686/og.webp",
		"publishedAt": 1670047084000,
		"content": "With stocks down 15% so far this year, now might be a good time to invest.\r\nYou might want to consider Morningstars list of the 10 best companies to invest in now. The investment research firm has a … [+969 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "‘Two steps forward, one step back’ as stocks bemoan yet another strong jobs report: Here’s what experts say about Powell’s next step in the big inflation fight",
		"description": "When a strong jobs report comes across the desk of the Federal Reserve’s chairman, it’s normally cause for celebration. After all, Fed officials have two main duties in their role managing the U.S. central bank—maintain price stability for everything bought a…",
		"url": "https://biztoc.com/x/8cf660ca88124cbc",
		"urlToImage": "https://c.biztoc.com/p/8cf660ca88124cbc/og.webp",
		"publishedAt": 1670046244000,
		"content": "When a strong jobs report comes across the desk of the Federal Reserves chairman, its normally cause for celebration.\r\nAfter all, Fed officials have two main duties in their role managing the U.S. ce… [+979 chars]",
		"titleScore": 2,
		"titleMarketGrams": "step back’ as stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Retirement Weekly: 4 numbers retirement savers need to know heading into 2023",
		"description": "The past couple of years have been challenging for almost everyone invested in stocks or bonds, including anyone saving for retirement through employer-sponsored plans. With markets down across the board and historic inflation squeezing American paychecks by …",
		"url": "https://biztoc.com/x/5b60e72aeef1ba45",
		"urlToImage": "https://c.biztoc.com/p/5b60e72aeef1ba45/og.webp",
		"publishedAt": 1670045527000,
		"content": "The past couple of years have been challenging for almost everyone invested in stocks or bonds, including anyone saving for retirement through employer-sponsored plans. With markets down across the b… [+1030 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Pawan Nahar",
		"title": "Paytm, media among stocks that zoomed up to 18% during the week",
		"description": "On the 500 index, about 400 shares settled in green, whereas more than 100 stocks ended in red. About two dozen counters rose in double digits but none of the stocks dropped more than 7% for the week.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-media-among-stocks-that-zoomed-up-to-18-during-the-week/articleshow/95954670.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95954674,width-1070,height-580,imgsize-851085,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670043320000,
		"content": "New Delhi: Domestic equity markets majorly ended with gains during the week as benchmark indices settled about a per cent higher on a weekly basis.\r\nOptimism over dovish or lesser hawkish stance from… [+3307 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Paytm, media among stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Why October's yield curve inversion might not spell doom for U.S. stocks in 2023",
		"description": "Even with another part of the U.S. Treasury yield curve flashing recession signals, U.S. stocks aren’t necessarily doomed to fall in 2023, according to James Paulsen, chief investment strategist at the Leuthold Group. A usually reliable recession indicator in…",
		"url": "https://biztoc.com/x/4189d3e37f6e427f",
		"urlToImage": "https://c.biztoc.com/p/4189d3e37f6e427f/og.webp",
		"publishedAt": 1670043009000,
		"content": "Even with another part of the U.S. Treasury yield curve flashing recession signals, U.S. stocks arent necessarily doomed to fall in 2023, according to James Paulsen, chief investment strategist at th… [+951 chars]",
		"titleScore": -2,
		"titleMarketGrams": "doom for U.S. stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "There's a strong possibility that the bear market in stocks is over as investors have given up hope",
		"description": "A contrarian case can be made that the stock market rally since the October lows is the beginning of a new bull market. That’s because the criteria for “capitulation” that I laid out in previous columns have been met. Capitulation occurs when investors give u…",
		"url": "https://biztoc.com/x/7abdb5fe2ad82d97",
		"urlToImage": "https://c.biztoc.com/p/7abdb5fe2ad82d97/og.webp",
		"publishedAt": 1670043009000,
		"content": "A contrarian case can be made that the stock market rally since the October lows is the beginning of a new bull market.\r\nThats because the criteria for capitulation that I laid out in previous column… [+202 chars]",
		"titleScore": 4,
		"titleMarketGrams": "that the bear market \n bear market in stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Okta and Atlassian added to ‘zombie’ stocks list by equity research firm New Constructs",
		"description": "Software companies Okta Inc. and Atlassian Corp. have been added to the list of “zombie” stocks compiled by equity research firm New Constructs. Okta OKTA, “Companies with fast-depleting cash reserves are risky investments in any market,” wrote New Constructs…",
		"url": "https://biztoc.com/x/21d8633517985ee7",
		"urlToImage": "https://c.biztoc.com/p/21d8633517985ee7/og.webp",
		"publishedAt": 1670043008000,
		"content": "Software companies Okta Inc. and Atlassian Corp. have been added to the list of zombie stocks compiled by equity research firm New Constructs.\r\nOkta\r\nOKTA,\r\nCompanies with fast-depleting cash reserve… [+944 chars]",
		"titleScore": 0,
		"titleMarketGrams": "added to ‘zombie’ stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "U.S.-traded Chinese stocks clinch best week since at least March as reopening hopes help spark rebound",
		"description": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered from last week’s punishing selloff. The KraneShares CSI Chin…",
		"url": "https://biztoc.com/x/ae5834ad0e4c0f8f",
		"urlToImage": "https://c.biztoc.com/p/ae5834ad0e4c0f8f/og.webp",
		"publishedAt": 1670042885000,
		"content": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered … [+979 chars]",
		"titleScore": 8,
		"titleMarketGrams": "U.S.-traded Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "robinsharma88",
		"title": "Momentum stocks",
		"description": "When a stock has rallied quickly and has the potential to swing either way for a while, it is said to be in momentum stocks. Theoretically, we might presume that a certain stock may continue its trend further if it is gaining momentum. There is a fair chance …",
		"url": "https://slashdot.org/submission/16978720/momentum-stocks",
		"urlToImage": null,
		"publishedAt": 1670042270000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": 0,
		"titleMarketGrams": "Momentum stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Goldman finds prior year's losers tend to beat the market in the first quarter",
		"description": "As investors prepare their portfolios for the new year, Goldman Sachs revisited laggard stocks that have the potential to outperform at the start of 2023. In the past, stocks that lagged the broader market tended to become leaders in the first quarter of the …",
		"url": "https://biztoc.com/x/0fb172a50646db71",
		"urlToImage": "https://c.biztoc.com/p/0fb172a50646db71/og.webp",
		"publishedAt": 1670042169000,
		"content": "As investors prepare their portfolios for the new year, Goldman Sachs revisited laggard stocks that have the potential to outperform at the start of 2023. In the past, stocks that lagged the broader … [+938 chars]",
		"titleScore": 0,
		"titleMarketGrams": "to beat the market \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Kshitij Anand",
		"title": "Nifty@record highs! Time for retail investors to shift from large banks to undervalued IT stocks",
		"description": "“Retail investors may shift from large banks to undervalued IT stocks from a three to five-year perspective. This strategy will most likely create an alpha on their current investment portfolio.”",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/niftyrecord-highs-time-for-retail-investors-to-shift-from-large-banks-to-undervalued-it-stocks/articleshow/95954012.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95954324,width-1070,height-580,imgsize-405694,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670041790000,
		"content": "In an interview with ETMarkets, Amit Jain, Co-founder, Ashika Global Family Office Services, said: Investors may exit from high P/E stocks as they might face some time correction going forward. \r\nEdi… [+3559 chars]",
		"titleScore": 0,
		"titleMarketGrams": "to undervalued IT stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "eNCA"
		},
		"author": null,
		"title": "Global stocks mixed after strong US jobs data",
		"description": "Stock markets were mixed Friday after strong US jobs data raised concerns that the US Federal Reserve may continue to aggressively hike interest rates.",
		"url": "https://www.enca.com/business/global-stocks-mixed-after-strong-us-jobs-data",
		"urlToImage": "https://www.enca.com/sites/default/files/styles/facebook/public/afp/2022-12/doc-32XJ7DN-%40photo0.jpg?h=ab94c40b&itok=oIbsrclL",
		"publishedAt": 1670041282000,
		"content": "NEW YORK - Stock markets were mixed on Friday after strong US jobs data raised concerns that the US Federal Reserve may continue to aggressively hike interest rates to tame inflation.\r\nUS government … [+1199 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Global stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Bureau",
		"title": "Paytm management issues upbeat guidance",
		"description": "Paytm has led the rout in shares of India's new-age businesses last month as investors, predominantly institutional, are dumping their holdings, raising concerns how much more would these stocks fall.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-management-issues-upbeat-guidance/articleshow/95954111.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-95954218,width-1070,height-580,imgsize-38986,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670040912000,
		"content": "Analysts said One 97 Communications, the operator of mobile payment platform Paytm, has issued upbeat guidance saying it remains focused on its path to attaining operating profitability and generatin… [+1926 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Robert & Sam Kovacs",
		"title": "2 Urgent Dividend Sells And 2 Blue Chip Replacements To Increase Your Income",
		"description": "As the SPX has risen to 4,000 some stocks have become outrageously expensive. Here are 2 trades that offer opportunities to \"yield up\" and increase your income.",
		"url": "https://seekingalpha.com/article/4562107-2-urgent-dividend-sell-blue-chip-replacement-increase-income",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/71914670/image_71914670.jpg?io=getty-c-w750",
		"publishedAt": 1670040771000,
		"content": "David Silverman/Getty Images News\r\nIt's only when the tide goes out that you learn who's been swimming naked. - Warren Buffett\r\nWritten by Sam Kovacs\r\n Introduction\r\n Beating the market.\r\n Is it not … [+11438 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "247wallst.com",
		"title": "These Were the Five Best and Worst Performing Mega-Cap Stocks in November 2022",
		"description": "While 2022 has been a dismal year for investors so far, November has offered some respite. In November, all three benchmark indices – The Dow Jones Industrial Average, Nasdaq Composite, and the S&P 500 – reported gains over the last month. Most mega-cap stock…",
		"url": "https://biztoc.com/x/d20278eae3d5baaf",
		"urlToImage": "https://c.biztoc.com/p/d20278eae3d5baaf/og.webp",
		"publishedAt": 1670040369000,
		"content": "While 2022 has been a dismal year for investors so far, November has offered some respite. In November, all three benchmark indices The Dow Jones Industrial Average, Nasdaq Composite, and the S&amp;P… [+980 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "4 numbers retirement savers need to know heading into 2023",
		"description": "The past couple of years have been challenging for almost everyone invested in stocks or bonds, including anyone saving for retirement through employer-sponsored plans. With markets down across the board and historic inflation squeezing American paychecks by …",
		"url": "https://biztoc.com/x/113efe5bb9803d34",
		"urlToImage": "https://c.biztoc.com/p/113efe5bb9803d34/og.webp",
		"publishedAt": 1670040364000,
		"content": "The past couple of years have been challenging for almost everyone invested in stocks or bonds, including anyone saving for retirement through employer-sponsored plans. With markets down across the b… [+1006 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Jim Cramer says these 3 apparel stocks benefit from return to office",
		"description": "CNBC’s Jim Cramer on Friday offered investors a list of clothing stocks that he believes will see upside as workers continue returning to the office. - “After the huge run in the apparel stocks, I recommend ringing the register on the lower quality ones, so t…",
		"url": "https://biztoc.com/x/a691589f0ec3502b",
		"urlToImage": "https://c.biztoc.com/p/a691589f0ec3502b/og.webp",
		"publishedAt": 1670037130000,
		"content": "CNBCs Jim Cramer on Friday offered investors a list of clothing stocks that he believes will see upside as workers continue returning to the office.\r\n- After the huge run in the apparel stocks, I rec… [+954 chars]",
		"titleScore": 2,
		"titleMarketGrams": "these 3 apparel stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "My 3 Highest-Conviction Growth Stocks to Buy Before 2022 Ends",
		"description": "Much of last year was dominated by a global pandemic, so coming out of 2021, investors couldn't have possibly predicted the challenges that were ahead. Now, just 12 months later, supply chain bottlenecks helped fuel 40-year-high inflation, the highest interes…",
		"url": "https://biztoc.com/x/e435fe4268110b30",
		"urlToImage": "https://c.biztoc.com/p/e435fe4268110b30/og.webp",
		"publishedAt": 1670035085000,
		"content": "Much of last year was dominated by a global pandemic, so coming out of 2021, investors couldn't have possibly predicted the challenges that were ahead. Now, just 12 months later, supply chain bottlen… [+935 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Big tech stocks are at historical lows. These names have potential, ‘Halftime Report’ traders say",
		"description": "It's been a brutal year for tech stocks, which means there may be opportunities for investors to scoop up some names at a good price. The tech-heavy Nasdaq Composite is down 26% this year, compared to declines of 14% for the S & P 500 and 5% for the Dow Jones…",
		"url": "https://biztoc.com/x/49ac2e1b2d613ef7",
		"urlToImage": "https://c.biztoc.com/p/49ac2e1b2d613ef7/og.webp",
		"publishedAt": 1670034844000,
		"content": "It's been a brutal year for tech stocks, which means there may be opportunities for investors to scoop up some names at a good price. The tech-heavy Nasdaq Composite is down 26% this year, compared t… [+1031 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Big tech stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Danny Vena)",
		"title": "My 3 Highest-Conviction Growth Stocks to Buy Before 2022 Ends",
		"description": "Want the recipe for a wildly successful investment? Take a large measure of market leadership, add a smidgen of secular tailwinds, and top it off with a large addressable market.",
		"url": "https://www.fool.com/investing/2022/12/02/my-3-highest-conviction-growth-stocks-to-buy-befor/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711686/a-person-cheering-while-looking-at-graphs-on-a-computer-monitor.jpg",
		"publishedAt": 1670034256000,
		"content": "Much of last year was dominated by a global pandemic, so coming out of 2021, investors couldn't have possibly predicted the challenges that were ahead. Now, just 12 months later, supply chain bottlen… [+6171 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Nicholas Jasinski",
		"title": "Stocks Continue to Rally. That Doesn’t Mean the Bear Market Is Going Away.",
		"description": "Cooling inflation and Powell’s talk of moderation sent stocks soaring. But a hot jobs report means rate hikes are still in the cards, and it’s not time to celebrate yet.",
		"url": "https://www.barrons.com/articles/stocks-rise-on-cooling-inflation-and-fed-moderation-that-doesnt-mean-the-bear-market-is-over-51670031802",
		"urlToImage": "https://images.barrons.com/im-677951/social",
		"publishedAt": 1670031780000,
		"content": "Christmas came early this year for the stock market. Is there a Grinch waiting to ruin it? It was a week of surprises both goodFederal Reserve Chairman Jerome Powell essentially confirming a smaller … [+6471 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Why stocks might not be doomed even with a key recession signal flashing warnings",
		"description": "Even with another part of the U.S. Treasury yield curve flashing recession signals, U.S. stocks aren’t necessarily doomed to fall in 2023, according to James Paulsen, chief investment strategist at the Leuthold Group. Here's his chart showing why stocks in th…",
		"url": "https://biztoc.com/x/41eac1e3904a60af",
		"urlToImage": "https://c.biztoc.com/p/41eac1e3904a60af/og.webp",
		"publishedAt": 1670031485000,
		"content": "Even with another part of the U.S. Treasury yield curve flashing recession signals, U.S. stocks arent necessarily doomed to fall in 2023, according to James Paulsen, chief investment strategist at th… [+500 chars]",
		"titleScore": -7,
		"titleMarketGrams": "Why stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Cramer’s week ahead: Markets need a strong job market, tame inflation to stay up",
		"description": "CNBC’s Jim Cramer on Friday told investors that stocks could see another strong week of trading, given the right economic conditions. - He also previewed next week’s slate of earnings. CNBC's Jim Cramer on Friday told investors that stocks could see another s…",
		"url": "https://biztoc.com/x/79eb57b19a4b50e4",
		"urlToImage": "https://c.biztoc.com/p/79eb57b19a4b50e4/og.webp",
		"publishedAt": 1670031485000,
		"content": "CNBCs Jim Cramer on Friday told investors that stocks could see another strong week of trading, given the right economic conditions.\r\n- He also previewed next weeks slate of earnings.\r\nCNBC's Jim Cra… [+986 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Ben Levisohn",
		"title": "When Prices Cool, Some Stocks May Find Themselves in Hot Water. Call Them Overearners.",
		"description": "Companies that thrived during a period of rising prices may find it harder to boost prices and protect margins as inflations continues to slow. That could mean trouble.",
		"url": "https://www.barrons.com/articles/slowing-inflation-stocks-51670030395",
		"urlToImage": "https://s.wsj.net/public/resources/images/BP-AB634_tesla_M_20180801151213.jpg",
		"publishedAt": 1670030460000,
		"content": "Inflation may have peaked, which could be bad news for stocks that have benefited from higher prices. It has taken time, but the market has finally coalesced around the idea that inflation wont get h… [+2913 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Andrew Bary",
		"title": "Housing Stocks Are Down. But There Are Already Signs of a Rebound.",
		"description": "Home builders and suppliers have been hammered by rising mortgage rates. But there’s long-term value in the stocks, and interest rates won’t stay up forever.",
		"url": "https://www.barrons.com/articles/housing-stocks-rebound-51670028487",
		"urlToImage": "https://images.barrons.com/im-677743/social",
		"publishedAt": 1670028900000,
		"content": "Plunging orders. Widespread price discounting. Shrinking profits. These are just some of the factors weighing on home builders after surging mortgage rates burst the pandemic-era real estate boom.Hom… [+9856 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "International Business Times"
		},
		"author": "David Randall",
		"title": "Wall Street Hunts For Recession Plays To Weather Potential 2023 Turbulence",
		"description": "Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal Reserve's interest rate increases will bring on an economic downturn next year.",
		"url": "https://www.ibtimes.com/wall-street-hunts-recession-plays-weather-potential-2023-turbulence-3643058",
		"urlToImage": "https://d.ibtimes.com/en/full/4390055/wall-street-sign-pictured-outside-new-york-stock-exchange-new-york-city.jpg",
		"publishedAt": 1670027253000,
		"content": "A Wall Street sign outside the New York Stock Exchange in New York City, New York, U.S., October 2, 2020. \r\nInvestors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as po… [+4680 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "wsj.com",
		"title": "CSX, AMC, Salesforce: Stocks That Defined the Week",
		"description": "CSX Corp. Lawmakers voted to prevent a nationwide strike by railroad workers. The U.S. Senate agreed to force unions to adopt an earlier labor agreement mediated by the administration—while rejecting a proposal to give workers expanded paid sick leave. The me…",
		"url": "https://biztoc.com/x/113c8fcba0ab1a4f",
		"urlToImage": "https://c.biztoc.com/p/113c8fcba0ab1a4f/og.webp",
		"publishedAt": 1670026924000,
		"content": "CSX Corp.\r\nLawmakers voted to prevent a nationwide strike by railroad workers. The U.S. Senate agreed to force unions to adopt an earlier labor agreement mediated by the administrationwhile rejecting… [+1002 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Jack Hough",
		"title": "Wall Street Isn’t Fond of T. Rowe Price, but Maybe You Should Be",
		"description": "Mutual fund manager T. Rowe Price has had a rough time of late, hurt by the decline in growth stocks. The negativity among analysts could be overdone.",
		"url": "https://www.barrons.com/articles/t-rowe-stock-price-51670023036",
		"urlToImage": "https://images.barrons.com/im-677521/social",
		"publishedAt": 1670026380000,
		"content": "Money manager \r\n T. Rowe Price\r\n Group has fallen way out of favor on Wall Street. There are 15 analysts covering the stock, according to FactSet. None say to buy. More say to sell than hold. Thats a… [+5825 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "U.S.-traded Chinese stocks clinch best week since at least March as reopening hopes help spark rebound",
		"description": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered from last week’s punishing selloff. The KraneShares CSI Chin…",
		"url": "https://biztoc.com/x/1e63e478be1f1544",
		"urlToImage": "https://c.biztoc.com/p/1e63e478be1f1544/og.webp",
		"publishedAt": 1670026216000,
		"content": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered … [+981 chars]",
		"titleScore": 8,
		"titleMarketGrams": "U.S.-traded Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "Wall Street hunts for recession plays to weather potential 2023 turbulence By Reuters",
		"description": "By David Randall NEW YORK (Reuters) - Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal Reserve's interest rate increases will bring on an economic do…",
		"url": "https://biztoc.com/x/e504e6570305e352",
		"urlToImage": "https://c.biztoc.com/p/e504e6570305e352/og.webp",
		"publishedAt": 1670026094000,
		"content": "By David Randall\r\nNEW YORK (Reuters) - Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal R… [+999 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Cramer’s week ahead: Markets need a strong job market, tame inflation to stay up",
		"description": "CNBC’s Jim Cramer on Friday told investors that stocks could see another strong week of trading, given the right economic conditions. - He also previewed next week’s slate of earnings. CNBC's Jim Cramer on Friday told investors that stocks could see another s…",
		"url": "https://biztoc.com/x/bc6f9efee31b3f39",
		"urlToImage": "https://c.biztoc.com/p/bc6f9efee31b3f39/og.webp",
		"publishedAt": 1670026091000,
		"content": "CNBCs Jim Cramer on Friday told investors that stocks could see another strong week of trading, given the right economic conditions.\r\n- He also previewed next weeks slate of earnings.\r\nCNBC's Jim Cra… [+1023 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "CNBC"
		},
		"author": "Krystal Hur",
		"title": "Jim Cramer says these 3 apparel stocks benefit from return to office",
		"description": "Shares of PVH, the parent of Calvin Klein and Tommy Hilfiger, surged on Thursday after the company reported better-than-expected results for its latest quarter.",
		"url": "https://www.cnbc.com/2022/12/02/jim-cramer-says-these-3-apparel-stocks-benefit-from-return-to-office.html",
		"urlToImage": "https://image.cnbcfm.com/api/v1/image/104383432-GettyImages-476433092.jpg?v=1670025992&w=1920&h=1080",
		"publishedAt": 1670025992000,
		"content": "CNBC's Jim Cramer on Friday offered investors a list of clothing stocks that he believes will see upside as workers continue returning to the office.\r\n\"After the huge run in the apparel stocks, I rec… [+1666 chars]",
		"titleScore": 2,
		"titleMarketGrams": "these 3 apparel stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "reuters.com",
		"title": "Wall Street hunts for recession plays to weather potential 2023 turbulence",
		"description": "NEW YORK, Dec 2 (Reuters) - Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal Reserve's interest rate increases will bring on an economic downturn nex…",
		"url": "https://biztoc.com/x/f7c39da6c1ed9dca",
		"urlToImage": "https://c.biztoc.com/p/f7c39da6c1ed9dca/og.webp",
		"publishedAt": 1670025245000,
		"content": "NEW YORK, Dec 2 (Reuters) - Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal Reserve's in… [+988 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "FX Empire"
		},
		"author": "Reuters",
		"title": "Wall Street hunts for recession plays to weather potential 2023 turbulence",
		"description": "By David Randall NEW YORK (Reuters) -   Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal Reserve&#039;s interest rate increases will bring on an econ…",
		"url": "https://www.fxempire.com/news/article/wall-street-hunts-for-recession-plays-to-weather-potential-2023-turbulence-1218469",
		"urlToImage": "https://responsive.fxempire.com/width/600/webp-lossy-70.q50/_fxempire_/2022/12/tagreuters.com2022newsml_LYNXMPEIB113P1.jpg",
		"publishedAt": 1670025101000,
		"content": "Gloomy year-ahead forecasts from Wall Street banks have piled up in the past week, although a strong November jobs report released on Friday undercut the case for an imminent slowdown in the U.S. eco… [+4332 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "reuters",
			"name": "Reuters"
		},
		"author": null,
		"title": "Wall St Week Ahead Wall Street hunts for recession plays to weather potential 2023 turbulence - Reuters",
		"description": "Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal Reserve's interest rate increases will bring on an economic downturn next year.",
		"url": "https://www.reuters.com/markets/us/wall-st-week-ahead-wall-street-hunts-recession-plays-weather-potential-2023-2022-12-02/",
		"urlToImage": "https://www.reuters.com/resizer/r1g6KC4WCuMU7alYtvapGbcZeeo=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/3TK6F4Z3GBNK5L7IDUMU4BGIME.jpg",
		"publishedAt": 1670024700000,
		"content": "NEW YORK, Dec 2 (Reuters) - Investors are eyeing everything from the U.S. healthcare sector to UK stocks and gold as potential havens during a recession, as worries grow that the Federal Reserve's in… [+4680 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "CNBC"
		},
		"author": "Krystal Hur",
		"title": "Cramer’s week ahead: Markets need a strong job market, tame inflation to stay up",
		"description": "Stocks closed up for the week on Friday, marking the first time since October the three major indexes saw consecutive weekly gains.",
		"url": "https://www.cnbc.com/2022/12/02/cramers-week-ahead-markets-need-a-strong-job-market-tame-inflation.html",
		"urlToImage": "https://image.cnbcfm.com/api/v1/image/107076311-1655347405607-IMG_1893rb.jpg?v=1670023979&w=1920&h=1080",
		"publishedAt": 1670023979000,
		"content": "CNBC's Jim Cramer on Friday told investors that stocks could see another strong week of trading, given the right economic conditions.\r\n\"As the year winds down, the holidays will become more and more … [+3864 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Jack Hough",
		"title": "Holiday Sale: Small-Cap Stocks Are at Bargain Levels",
		"description": "Shares of smaller companies are 30% cheaper than those of large-caps, according to one calculation. A dozen ways to invest, in stocks and funds.",
		"url": "https://www.barrons.com/articles/small-cap-stocks-funds-51670023712",
		"urlToImage": "https://images.barrons.com/im-677558/social",
		"publishedAt": 1670023920000,
		"content": "Small-cap stocks are priced for jumbo gains. One money manager predicts that theyll outshine large-caps by close to four percentage points a year over the next five years. A big investment bank is ev… [+10228 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Tae Kim",
		"title": "Another Bad Sign for Tech Stocks—Cloud Spending Is Fading",
		"description": "Cloud stocks were supposed to be immune from the slowdown. It hasn’t turned out that way.",
		"url": "https://www.barrons.com/articles/tech-stocks-valuations-earnings-51670023226",
		"urlToImage": "https://images.barrons.com/im-678429/social",
		"publishedAt": 1670023320000,
		"content": "The move to cloud-native software was supposed to be unstoppable. But this past week, we learned even the best secular trends have their limits and arent completely immune to a slowing global economy… [+4644 chars]",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Mike Zaccardi",
		"title": "IBB: Shares Breaking Out With A Still-Reasonable Valuation",
		"description": "Biotech stocks, while a volatile spot of the broad U.S. market, look good from a risk/reward point of view. Click here to read my analysis of the IBB ETF.",
		"url": "https://seekingalpha.com/article/4562094-ibb-shares-breaking-out-with-a-still-reasonable-valuation",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1354171846/image_1354171846.jpg?io=getty-c-w750",
		"publishedAt": 1670023210000,
		"content": "gorodenkoff\r\nOne of the major areas of relative strength in the last year has been Health Care. Biotech, specifically, shows big alpha over the last six months as the group has rallied in the face of… [+3760 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Jack Hough",
		"title": "Wall Street Isn’t Fond of This Stock. Maybe You Should Be.",
		"description": "Mutual fund manager T. Rowe Price has had a rough time of late, hurt by the decline in growth stocks. The negativity among analysts could be overdone.",
		"url": "https://www.barrons.com/articles/t-rowe-price-stock-looks-cheap-51670023036",
		"urlToImage": "https://images.barrons.com/im-677521/social",
		"publishedAt": 1670023140000,
		"content": "Money manager \r\n T. Rowe Price\r\n Group has fallen way out of favor on Wall Street. There are 15 analysts covering the stock, according to FactSet. None say to buy. More say to sell than hold. Thats a… [+5825 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Kinder Morgan Gets An Even Higher 90+ Composite Rating Upgrade",
		"description": "On Friday, Kinder Morgan (KMI) got an upgrade for its IBD SmartSelect Composite Rating to from 94 to 96. Its RS line is also above 80.X The revised score means the stock currently tops 96% of all other stocks in terms of key performance metrics and technical …",
		"url": "https://biztoc.com/x/a6942fec4440bbc3",
		"urlToImage": "https://c.biztoc.com/p/a6942fec4440bbc3/og.webp",
		"publishedAt": 1670022725000,
		"content": "On Friday, Kinder Morgan (KMI) got an upgrade for its IBD SmartSelect Composite Rating to from 94 to 96. Its RS line is also above 80.X\r\nThe revised score means the stock currently tops 96% of all ot… [+979 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "forbes.com",
		"title": "Best Dividend Stocks For Reliable Income For December 2022",
		"description": "With dividend stocks, there's usually a trade-off between yield and reliability. Said another way, the dividend-payers that generate maximum income for your investment dollar aren't always the most dependable. And the most dependable dividend stocks, well, th…",
		"url": "https://biztoc.com/x/9d05464ab4b480c1",
		"urlToImage": "https://c.biztoc.com/p/9d05464ab4b480c1/og.webp",
		"publishedAt": 1670021165000,
		"content": "With dividend stocks, there's usually a trade-off between yield and reliability. Said another way, the dividend-payers that generate maximum income for your investment dollar aren't always the most d… [+954 chars]",
		"titleScore": 5,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "The Star Online"
		},
		"author": "Pan Lijun",
		"title": "U.S.-listed Chinese firms trade higher",
		"description": "NEW YORK, Dec. 2 (Xinhua) -- U.S.-listed Chinese companies traded higher on Friday, with all the top 10 stocks by weight in the S&P U.S. Listed China 50 index ending the day on an upbeat note. Read full story",
		"url": "https://www.thestar.com.my/news/world/2022/12/03/us-listed-chinese-firms-trade-higher",
		"urlToImage": "https://cdn.thestar.com.my/Themes/img/newTsol_logo_socmedia.png",
		"publishedAt": 1670020980000,
		"content": "NEW YORK, Dec. 2 (Xinhua) -- U.S.-listed Chinese companies traded higher on Friday, with all the top 10 stocks by weight in the S&amp;P U.S. Listed China 50 index ending the day on an upbeat note.\r\n … [+1047 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Why Investors Were High on These 2 Marijuana Stocks Today",
		"description": "What happened Not typically accustomed to positive news about their sector, marijuana stock investors had good occasion to celebrate on Friday. Not only did President Biden sign the nation's first marijuana reform bill into law, a stock analyst also initiated…",
		"url": "https://biztoc.com/x/e7fdc0c3facf5d04",
		"urlToImage": "https://c.biztoc.com/p/e7fdc0c3facf5d04/og.webp",
		"publishedAt": 1670020805000,
		"content": "What happened\r\nNot typically accustomed to positive news about their sector, marijuana stock investors had good occasion to celebrate on Friday.\r\nNot only did President Biden sign the nation's first … [+1028 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Stockcharts.com"
		},
		"author": "Bruce Fraser",
		"title": "Will the QQQ Swing into Gear?",
		"description": "Mega-Cap Growth stocks have led the stock market weakness on the way down in 2022. They have also lagged during the 4th quarter rally. This weakness has been a drag on major stock indexes such as the S&P 500 and the NASDAQ Composite. With the recent rally pha…",
		"url": "https://stockcharts.com/articles/wyckoff/2022/12/will-the-qqq-swing-into-gear-223.html",
		"urlToImage": "https://stockcharts.com/img/articles/2022/12/02/207929d1-90db-4bac-8c66-1b0c9b32e001.jpg",
		"publishedAt": 1670020635000,
		"content": "Mega-Cap Growth stocks have led the stock market weakness on the way down in 2022. They have also lagged during the 4th quarter rally. This weakness has been a drag on major stock indexes such as the… [+2270 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Forbes"
		},
		"author": "Catherine Brock, Contributor, \n Catherine Brock, Contributor\n https://www.forbes.com/sites/wealth-planning-insights/people/catherinebrock/",
		"title": "Best Dividend Stocks For Reliable Income For December 2022",
		"description": "High quality dividend stocks can provide reliable income.",
		"url": "https://www.forbes.com/sites/investor-hub/article/best-dividend-stocks-for-reliable-income-for-december-2022/",
		"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/638a76dfc01b9cf9f8e2e8dd/0x0.jpg?format=jpg&width=1200",
		"publishedAt": 1670020567000,
		"content": "High quality dividend stocks can provide reliable income.\r\ngetty\r\nWhat are some good dividend stocks to buy? The right answer depends on your financial goals.\r\nWith dividend stocks, there's usually a… [+10991 chars]",
		"titleScore": 5,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Eric Volkman)",
		"title": "Why Investors Were High on These 2 Marijuana Stocks Today",
		"description": "Investors reacted to a stroke of President Biden's pen, and a bullish new analyst report.",
		"url": "https://www.fool.com/investing/2022/12/02/why-investors-were-high-on-these-2-marijuana-stock/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711657/person-in-a-field-smoking-a-marijuana-cigarette.jpg",
		"publishedAt": 1670020377000,
		"content": "What happened\r\nNot typically accustomed to positive news about their sector, marijuana stock investors had good occasion to celebrate on Friday.\r\nNot only did President Biden sign the nation's first … [+1979 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "seattlepi.com"
		},
		"author": null,
		"title": "Marvell, Veeva fall; Smartsheet, PagerDuty rise",
		"description": "NEW YORK (AP) - Stocks that traded heavily or had substantial price changes Friday: Marvell Technology Inc., down 68 cents to $44.72.\n\nThe chipmaker gave investors a weak financial forecast.\n\nUiPath Inc., up $1.61 to $14.53.\n\nThe enterprise automation softwar…",
		"url": "https://www.seattlepi.com/business/article/Marvell-Veeva-fall-Smartsheet-PagerDuty-rise-17627542.php",
		"urlToImage": "https://s.hdnux.com/img/modules/siteheader/brand.png",
		"publishedAt": 1670019806000,
		"content": "NEW YORK (AP) Stocks that traded heavily or had substantial price changes Friday:\r\nMarvell Technology Inc., down 68 cents to $44.72.\r\nAdvertisement\r\nArticle continues below this ad\r\nThe chipmaker gav… [+1175 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "U.S.-traded Chinese stocks clinch best week since at least March as reopening hopes help spark rebound",
		"description": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered from last week’s punishing selloff. The KraneShares CSI Chin…",
		"url": "https://biztoc.com/x/483ea7486eaaf247",
		"urlToImage": "https://c.biztoc.com/p/483ea7486eaaf247/og.webp",
		"publishedAt": 1670019365000,
		"content": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered … [+986 chars]",
		"titleScore": 8,
		"titleMarketGrams": "U.S.-traded Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Want to Get Richer? 3 Best Stocks to Buy Now and Hold Forever",
		"description": "With a stock market sell-off in 2022, it has become crucial to buy shares in companies likely to grow over several years. A long-term investment strategy can safeguard you from economic fluctuations, such as a potential recession in 2023. Apple (AAPL -0.34%),…",
		"url": "https://biztoc.com/x/9072985099a0404d",
		"urlToImage": "https://c.biztoc.com/p/9072985099a0404d/og.webp",
		"publishedAt": 1670019125000,
		"content": "With a stock market sell-off in 2022, it has become crucial to buy shares in companies likely to grow over several years. A long-term investment strategy can safeguard you from economic fluctuations,… [+943 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 of the Safest Dividend Stocks On Earth",
		"description": "Owning high-quality dividend stocks has helped me navigate through market volatility over the years, and most especially in 2022. While nobody can be sure where markets will be heading in the next few weeks, months, or years, the direction of great dividend s…",
		"url": "https://biztoc.com/x/1e610affe171ad2f",
		"urlToImage": "https://c.biztoc.com/p/1e610affe171ad2f/og.webp",
		"publishedAt": 1670019125000,
		"content": "Owning high-quality dividend stocks has helped me navigate through market volatility over the years, and most especially in 2022. While nobody can be sure where markets will be heading in the next fe… [+925 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Joseph Adinolfi",
		"title": ": U.S.-traded Chinese stocks clinch best week since at least March as reopening hopes help spark rebound",
		"description": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered from last week's punishing selloff.",
		"url": "https://www.marketwatch.com/story/u-s-traded-chinese-stocks-clinch-best-week-since-at-least-march-as-reopening-hopes-help-spark-rebound-11670018960",
		"urlToImage": "https://images.mktw.net/im-676514/social",
		"publishedAt": 1670018940000,
		"content": "Shares of U.S.-traded Chinese stocks on Friday posted their best week since at least March, with one popular exchange-traded fund clinching its biggest weekly advance since 2011, as shared recovered … [+3632 chars]",
		"titleScore": 8,
		"titleMarketGrams": ": U.S.-traded Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "These resilient stocks that keep expanding margins are Goldman's picks",
		"description": "Investors looking ahead to how they might invest next year should consider companies that have a proven track record of solid profit margins, according to Goldman Sachs. The investment bank expects that next year will bring less pain than 2022, but no meaning…",
		"url": "https://biztoc.com/x/378ecfd1e5a0e837",
		"urlToImage": "https://c.biztoc.com/p/378ecfd1e5a0e837/og.webp",
		"publishedAt": 1670018885000,
		"content": "Investors looking ahead to how they might invest next year should consider companies that have a proven track record of solid profit margins, according to Goldman Sachs. The investment bank expects t… [+924 chars]",
		"titleScore": 0,
		"titleMarketGrams": "These resilient stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Kody Kester)",
		"title": "2 of the Safest Dividend Stocks On Earth",
		"description": "Coca-Cola and Albemarle have decades of dividend growth to their credit.",
		"url": "https://www.fool.com/investing/2022/12/02/2-of-the-safest-dividend-stocks-on-earth/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711431/a-businessperson-works-with-spreadsheets.jpg",
		"publishedAt": 1670018400000,
		"content": "Owning high-quality dividend stocks has helped me navigate through market volatility over the years, and most especially in 2022. While nobody can be sure where markets will be heading in the next fe… [+3552 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Dani Cook)",
		"title": "Want to Get Richer? 3 Best Stocks to Buy Now and Hold Forever",
		"description": "Apple, Nvidia, and AMD are some of the most reliable growth stocks to consider today.",
		"url": "https://www.fool.com/investing/2022/12/02/want-to-get-richer-3-best-stocks-to-buy-now-and-ho/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711192/artificial-intelligence-investing-algorithms.jpg",
		"publishedAt": 1670018400000,
		"content": "With a stock market sell-off in 2022, it has become crucial to buy shares in companies likely to grow over several years. A long-term investment strategy can safeguard you from economic fluctuations,… [+4870 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "ft.com",
		"title": "FTX collapse sends shockwaves through Coinbase’s stocks and bonds",
		"description": "US-listed exchange’s debt is trading at ‘distressed’ level with crypto industry under pressure",
		"url": "https://biztoc.com/x/4fac55063d850514",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670017684000,
		"content": "US-listed exchanges debt is trading at distressed level with crypto industry under pressure \r\n This story appeared first on ft.com, 2022-12-02.",
		"titleScore": -2,
		"titleMarketGrams": "shockwaves through Coinbase’s stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "benzinga.com",
		"title": "Okta, Atlassian Are 'Zombie Stocks' In Danger Of Dropping To $0: Analyst",
		"description": "New Constructs CEO David Trainer added Atlassian Corp TEAM and Okta Inc OKTA to his Zombie Stock list. Atlassian shares are down 63.1% and Okta shares are down 71.1% year-to-date, but Trainer said this week both stocks may still have more pain ahead. Atlassia…",
		"url": "https://biztoc.com/x/b8f426a9c91f44e4",
		"urlToImage": "https://c.biztoc.com/p/b8f426a9c91f44e4/og.webp",
		"publishedAt": 1670017205000,
		"content": "New Constructs CEO David Trainer added Atlassian Corp TEAM and Okta Inc OKTA to his Zombie Stock list. Atlassian shares are down 63.1% and Okta shares are down 71.1% year-to-date, but Trainer said th… [+996 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "U.S. stocks mixed at close of trade; Dow Jones Industrial Average up 0.10% By Investing.com",
		"description": "Investing.com – U.S. stocks were mixed after the close on Friday, as gains in the Basic Materials, Consumer Goods and Industrials sectors led shares higher while losses in the Oil & Gas, Technology and Utilities sectors led shares lower. At the close in NYSE,…",
		"url": "https://biztoc.com/x/f21068af0cf8f76e",
		"urlToImage": "https://c.biztoc.com/p/f21068af0cf8f76e/og.webp",
		"publishedAt": 1670016856000,
		"content": "Investing.com U.S. stocks were mixed after the close on Friday, as gains in the Basic Materials, Consumer Goods and Industrials sectors led shares higher while losses in the Oil &amp; Gas, Technology… [+1008 chars]",
		"titleScore": 0,
		"titleMarketGrams": "U.S. stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "US stocks finish mixed amid fears of more Fed hawkishness after hot jobs report",
		"description": "Trader Leon Montana works on the floor of the New York Stock Exchange stocks NYSE worry AP Photo/Richard Drew US stocks closed mixed on Friday after November's job report clocked in above economists' expectations. The Dow reversed higher as the Fed is still l…",
		"url": "https://biztoc.com/x/167496ccec822f1c",
		"urlToImage": "https://c.biztoc.com/p/167496ccec822f1c/og.webp",
		"publishedAt": 1670016368000,
		"content": "Trader Leon Montana works on the floor of the New York Stock Exchange stocks NYSE worry\r\nAP Photo/Richard Drew\r\nUS stocks closed mixed on Friday after November's job report clocked in above economist… [+992 chars]",
		"titleScore": 0,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "forbes.com",
		"title": "Warren Buffett And David Rolfe Agree On These 6 Stocks",
		"description": "Summary - Both gurus have positions in Kraft Heinz, Taiwan Semiconductor, Apple AAPL, Johnson & Johnson JNJ, Visa Vand U.S. Bancorp TBBK. Warren Buffett (Trades, Portfolio), the legendary investor who leads Berkshire Hathaway Similarly, Wedgewood Partners’ Da…",
		"url": "https://biztoc.com/x/b3e23e9031615a6f",
		"urlToImage": "https://c.biztoc.com/p/b3e23e9031615a6f/og.webp",
		"publishedAt": 1670016125000,
		"content": "Summary\r\n- Both gurus have positions in Kraft Heinz, Taiwan Semiconductor, Apple\r\nAAPL, Johnson &amp; Johnson JNJ, Visa Vand U.S. Bancorp TBBK.\r\nWarren Buffett (Trades, Portfolio), the legendary inve… [+1007 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fastcompany.com",
		"title": "Gen Z traders are choosing alternative assets over stocks in an ‘extremely risky’ trend",
		"description": "It’s hard to blame young investors for losing faith in the stock markets over the past year, given that the S&P 500 is down around 15% year-to-date. Even so, most financial experts would still likely tell millennial and Gen Z investors to trust in the market’…",
		"url": "https://biztoc.com/x/99f304b5984c0fed",
		"urlToImage": "https://c.biztoc.com/p/99f304b5984c0fed/og.webp",
		"publishedAt": 1670016024000,
		"content": "Its hard to blame young investors for losing faith in the stock markets over the past year, given that the S&amp;P 500 is down around 15% year-to-date. Even so, most financial experts would still lik… [+903 chars]",
		"titleScore": 2,
		"titleMarketGrams": "alternative assets over stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "go.com",
		"title": "Marvell, Veeva fall; Smartsheet, PagerDuty rise",
		"description": "NEW YORK -- Stocks that traded heavily or had substantial price changes Friday: Marvell Technology Inc., down 68 cents to $44.72. The chipmaker gave investors a weak financial forecast. UiPath Inc., up $1.61 to $14.53. The enterprise automation software devel…",
		"url": "https://biztoc.com/x/13969ccfd0642ae7",
		"urlToImage": "https://c.biztoc.com/p/13969ccfd0642ae7/og.webp",
		"publishedAt": 1670016017000,
		"content": "NEW YORK -- Stocks that traded heavily or had substantial price changes Friday:\r\nMarvell Technology Inc., down 68 cents to $44.72.\r\nThe chipmaker gave investors a weak financial forecast.\r\nUiPath Inc… [+995 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "zerohedge.com",
		"title": "Stocks, Bonds, Crypto, & Commodities Soar As 'Dovish' Powell Trumps 'Hawkish' Payrolls",
		"description": "Stocks, Bonds, Crypto, & Commodities Soar As 'Dovish' Powell Trumps 'Hawkish' Payrolls A chaotic week of China COVID headlines mixed with OPEC production cut rumors, sprinkled in with ugly economic data (ISM/PMI/Housing) and \"great\" economic data (payrolls an…",
		"url": "https://biztoc.com/x/4210ec492120ae51",
		"urlToImage": "https://c.biztoc.com/p/4210ec492120ae51/og.webp",
		"publishedAt": 1670016016000,
		"content": "Stocks, Bonds, Crypto, &amp; Commodities Soar As 'Dovish' Powell Trumps 'Hawkish' Payrolls\r\nA chaotic week of China COVID headlines mixed with OPEC production cut rumors, sprinkled in with ugly econo… [+988 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "thestreet.com",
		"title": "Profit From the Lithium Boom With These Stocks",
		"description": "The rise of electric vehicles has had a profound impact on a number of industries. The switch from internal combustion to EVs means that demand for oil and gas will decline over time, as will demand for some of the parts of internal combustion vehicles that a…",
		"url": "https://biztoc.com/x/725be00b7e4395d2",
		"urlToImage": "https://c.biztoc.com/p/725be00b7e4395d2/og.webp",
		"publishedAt": 1670016004000,
		"content": "The rise of electric vehicles has had a profound impact on a number of industries. The switch from internal combustion to EVs means that demand for oil and gas will decline over time, as will demand … [+969 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "abc-news",
			"name": "ABC News"
		},
		"author": "The Associated Press",
		"title": "Marvell, Veeva fall; Smartsheet, PagerDuty rise",
		"description": "Stocks that traded heavily or had substantial price changes Friday: Marvell, Veeva fall; Smartsheet, PagerDuty rise",
		"url": "https://abcnews.go.com/Business/wireStory/marvell-veeva-fall-smartsheet-pagerduty-rise-94369873",
		"urlToImage": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
		"publishedAt": 1670015875000,
		"content": "NEW YORK -- Stocks that traded heavily or had substantial price changes Friday:\r\nMarvell Technology Inc., down 68 cents to $44.72.\r\nThe chipmaker gave investors a weak financial forecast.\r\nUiPath Inc… [+981 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "The Star Online"
		},
		"author": "Pan Lijun",
		"title": "U.S. stocks close mixed",
		"description": "NEW YORK, Dec. 2 (Xinhua) -- U.S. stocks ended mixed on Friday. Read full story",
		"url": "https://www.thestar.com.my/news/world/2022/12/03/us-stocks-close-mixed",
		"urlToImage": "https://cdn.thestar.com.my/Themes/img/newTsol_logo_socmedia.png",
		"publishedAt": 1670015820000,
		"content": "NEW YORK, Dec. 2 (Xinhua) -- U.S. stocks ended mixed on Friday.\r\n The Dow rose 0.10 percent to 34,429.88, the S&amp;P 500 was down 0.12 percent to 4,071.70, and the Nasdaq fell 0.18 percent to 11,461… [+3 chars]",
		"titleScore": 0,
		"titleMarketGrams": "U.S. stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Forbes"
		},
		"author": "GuruFocus, Contributor, \n GuruFocus, Contributor\n https://www.forbes.com/sites/gurufocus/",
		"title": "Warren Buffett And David Rolfe Agree On These 6 Stocks",
		"description": "An overview of the gurus' common holdings as of the 3rd quarter",
		"url": "https://www.forbes.com/sites/gurufocus/2022/12/02/warren-buffett-and-david-rolfe-agree-on-these-6-stocks/",
		"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/638a6abc08378cee33e2e8df/0x0.jpg?format=jpg&crop=3818,2148,x0,y348,safe&width=1200",
		"publishedAt": 1670015714000,
		"content": "Summary\r\n<ul><li>Both gurus have positions in Kraft Heinz, Taiwan Semiconductor, AppleAAPL\r\n, Johnson &amp; JohnsonJNJ\r\n, VisaV\r\n and U.S. BancorpTBBK\r\n.</li></ul>Warren Buffett (Trades, Portfolio), … [+10904 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Newser"
		},
		"author": "John Johnson",
		"title": "Stocks Dig Out From Jobs-Related Losses",
		"description": "Worries about inflation put a damper on Wall Street for much of Friday, though the major indexes erased big losses from early in the day. The Dow managed to rise 34 points to 34,429, the S&P 500 fell 4 points to 4,071, and the Nasdaq fell 20 points...",
		"url": "https://www.newser.com/story/328680/stocks-dig-out-from-jobs-related-losses.html",
		"urlToImage": "https://img1-azrcdn.newser.com/image/1446628-12-20221202151557.jpeg",
		"publishedAt": 1670015700000,
		"content": "Worries about inflation put a damper on Wall Street for much of Friday, though the major indexes erased big losses from early in the day. The Dow managed to rise 34 points to 34,429, the S&amp;P 500 … [+1154 chars]",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Brian Stewart",
		"title": "Dow, S&P 500, Nasdaq overcome early weakness to finish mixed following jobs report",
		"description": "Stocks finished mixed on Friday, overcoming an early slide to recover back to the flat line by the close.",
		"url": "https://seekingalpha.com/news/3913669-dow-sp-500-nasdaq-overcome-early-weakness-to-finish-mixed-following-jobs-report",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/668600179/image_668600179.jpg?io=getty-c-w1280",
		"publishedAt": 1670015367000,
		"content": "Stocks finished mixed on Friday, overcoming an early slide to recover back to the flat line by the close. A strong jobs report sparked an initial slide, casting doubt on expectations that the Federal… [+2789 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "International Business Times"
		},
		"author": "Paul Elias",
		"title": "Stock Market Today: Dow Gains After Jobs Report Shows Still-Tight Labor Market",
		"description": "U.S. stocks closed mixed Friday and the Dow Jones Industrial Average rallied.",
		"url": "https://www.ibtimes.com/stock-market-today-dow-gains-after-jobs-report-shows-still-tight-labor-market-3643043",
		"urlToImage": "https://d.ibtimes.com/en/full/3847301/traders-work-trading-floor-new-york-stock-exchange-nyse-manhattan-new-york-city.jpg",
		"publishedAt": 1670015345000,
		"content": "U.S. stocks closed mixed Friday and the Dow Jones Industrial Average rallied after initially declining when the latest jobs report showed a still-tight labor market.\r\nThe Dow Jones Industrial Average… [+1598 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "jsor@insider.com (Jennifer Sor)",
		"title": "US stocks finish mixed amid fears of more Fed hawkishness after hot jobs report",
		"description": "JPMorgan Asset Management's David Kelly said the jobs report was likely distorted, and there's still plenty of room for the Fed to taper rate hikes.",
		"url": "https://markets.businessinsider.com/news/stocks/stock-market-news-today-jobs-report-fed-hawkishness-powell-rate-2022-12",
		"urlToImage": "https://i.insider.com/6165d6a3991f6b0018656ab5?width=1200&format=jpeg",
		"publishedAt": 1670015269000,
		"content": "US stocks closed mixed in volatile trade on Friday after the strong November jobs report triggered an early sell-off on fears the Federal Reserve will have to stay hawkish.\r\nThe addition of 263,000 j… [+1475 chars]",
		"titleScore": 0,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Joy Wiltermuth",
		"title": "Dow ekes out gain Friday, stocks book second week in a row of gains",
		"description": "Major U.S. stock indexes ended a choppy session mixed Friday, while still posting weekly gains, after monthly jobs data showed the Federal Reserve's rapid pace of interest rate hikes has yet to tame the roaring labor market. The Dow Jones Industrial Average r…",
		"url": "https://www.marketwatch.com/story/dow-ekes-out-gain-friday-stocks-book-second-week-in-a-row-of-gains-2022-12-02",
		"urlToImage": "https://s.wsj.net/public/resources/MWimages/MW-GP644_MicroS_ZG_20180906154215.jpg",
		"publishedAt": 1670015041000,
		"content": "Major U.S. stock indexes ended a choppy session mixed Friday, while still posting weekly gains, after monthly jobs data showed the Federal Reserve's rapid pace of interest rate hikes has yet to tame … [+992 chars]",
		"titleScore": 4,
		"titleMarketGrams": "out gain Friday, stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Dealnews.com"
		},
		"author": null,
		"title": "Fidelity® Youth Account: Get a $50 reward w/ new account",
		"description": "Features\r\n <ul> <li>Open a Fidelity® Youth Account for your teen, and we'll drop $50 into their account.</li> <li>Your teen will get a $50 reward once they download the Fidelity mobile app and activate their Youth Account1</li> <li>No monthly fees or account …",
		"url": "https://www.dealnews.com/Fidelity-Youth-Account-Get-a-50-reward-w-new-account/20838659.html",
		"urlToImage": "https://c.dlnws.com/image/upload/f_auto,t_maximum,q_auto/content/mg2jxdrh5zrvpdfjygwl.png",
		"publishedAt": 1670014953000,
		"content": "<ul><li>Open a Fidelity® Youth Account for your teen, and we'll drop $50 into their account.</li><li>Your teen will get a $50 reward once they download the Fidelity mobile app and activate their Yout… [+1899 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Libsyn.com"
		},
		"author": null,
		"title": "More Jobs for Americans, More Confusion for Investors",
		"description": "If you're an investor trying to make sense of the conflicting signals from macroeconomic data, you're not alone. (0:21) Matt Argersinger and Jason Moser discuss:  - A strong jobs report, latest housing data, and contrary indications from the retail industry -…",
		"url": "https://fool.libsyn.com/more-jobs-for-americans-more-confusion-for-investors",
		"urlToImage": null,
		"publishedAt": 1670014800000,
		"content": "If you're an investor trying to make sense of the conflicting signals from macroeconomic data, you're not alone.\r\n(0:21) Matt Argersinger and Jason Moser discuss:- A strong jobs report, latest housin… [+642 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	}
]