[
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Beth Pinsker",
		"title": ": If your crypto is stolen, you’re mostly on your own. These steps can help prevent that from happening",
		"description": "Your cash and stocks are covered by insurance. Digital currencies don't enjoy the same level of protection.",
		"url": "https://www.marketwatch.com/story/if-your-crypto-is-stolen-youre-mostly-on-your-own-these-steps-can-help-prevent-that-from-happening-11670259699",
		"urlToImage": "https://images.mktw.net/im-678177/social",
		"publishedAt": 1670259660000,
		"content": "If only your bitcoin could catch on fire — literally — then it might have a chance of being covered by insurance. For property, fire is a straightforward hazard. But it’s probably the one big thing that can’t befall a digital currency among a host of inflictions — see FTX, BlockFi and other failures. \n       As it stands, there’s not much protection for cryptocurrency — no FDIC or SIPC insurance from the U.S. government to protect against institutional failures, no broad coverage under homeowners insurance as property and very little by way of individual cyber theft coverage. Some exchanges have large policies for themselves.  With established brokerages including Fidelity Investments entering the crypto-selling arena, and discussions about potential regulation by the Securities and Exchange Commission, this situation could change. But for now, you’re the guardian of your crypto, and your best defense is being aware of the potential harms and how you can best protect yourself.  “You’re never going to be able to eliminate all the risks. But you can see if there’s some low-hanging fruit to make it a little bit more safe,” says Michael Menapace, a non-resident scholar at the Insurance Information Institute, and also an attorney and law professor.  Here’s the top things you need to think about in order to protect your crypto: Loss of value Bitcoin \n        BTCUSD,\n        -0.34%\n       and ether \n        ETHUSD,\n        -1.10%\n       are down more than 60% this year, and there’s nothing any insurance can do about that. “Cryptocurrencies are extremely volatile, and investors should only allocate money they are willing to lose,” Fidelity says in a statement to its potential crypto investors.  But you can be strategic about other kinds of crypto-related investments you pick to avoid a complete loss, like sticking to established coins, investing in ETF products related to crypto or employing hedging strategies. Institutional failure FDIC insurance protects individuals from the failure of banks. SIPC insurance, in turn, protects against the failure of securities companies regulated by the SEC.  The way it works at companies such as Robinhood\n        HOOD,\n        -2.35%,\n       Coinbase\n        COIN,\n        -2.02%,\n       Gemini, Fidelity and others is that they partner with regulated financial institutions to provide sweep accounts for cash on hand, which get pass-through FDIC or SIPC coverage, depending on which applies. But that’s only while it’s in cash. Once your assets are in crypto form, they’re not covered for institutional failure. As Fidelity specifies: “FDIC insurance protects against loss in the event of a failure of the cash depository; it does not protect you against loss in the event of a failure of Fidelity Digital Assets.” Still, Menapace sees the coming of major players into the space as a way for individuals to potentially protect themselves. These companies are, regardless of their crypto divisions, “highly regulated, generally liquid companies, that would have assets to pay if something terrible happened,” he says. Institutional theft If your crypto is in the custody of a major financial company and it gets robbed, you may have some relief. Most of the bigger players have cyber theft policies, many underwritten by Lloyd’s of London.  Robinhood, for example, says: “We carry crime insurance that covers a portion of the cryptocurrency held across our storage systems against losses from theft, including cybersecurity breaches.”  But if it’s just you who gets robbed, you’re pretty much on your own.  Coinbase says it “carries crime insurance that protects a portion of digital currencies held across our storage systems against losses from theft, including cybersecurity breaches. However, our policy does not cover any losses resulting from unauthorized access to your personal Coinbase or Coinbase Pro account(s) due to a breach or loss of your credentials.”Direct theft The IRS defines cryptocurrency as property for the purposes of taxation, but that does not extend to homeowner’s insurance, which would cover a stolen television. It also likely wouldn’t extend to the way a homeowner’s policy deals with stolen cash, but it depends on the policy. In any case, stolen cash claims are typically limited to no more than several hundred dollars, which would be a mere fraction of a bitcoin.  Menapace sees the most likely resolution of this situation coming from the SEC, which could eventually designate cryptocurrency to be a security and regulate it the same way as stocks. “That’s not a panacea either,” Menapace says. “The next question is if the SEC regulates cryptocurrency as a security, does that mean they’ll be insurable or not insurable as securities?”  There are some specialty policies for cyber theft, with many caveats. Breach, for one, started offering a Crypto Shield product in February that covers assets held in a qualified exchange if they are stolen outright or subject to a data breach at the custodian. The cost to insure is roughly 1.5% to 2% of holdings, says Eyhab Aejaz, CEO of Breach. A quote on the site for New York coverage of 1 bitcoin is $27 a month for 100% coverage at the day’s value, with a 15% deductible.  If you hold crypto in cold storage — which means it’s in your own custody on a hard drive or similar device, though — you’re on your own. This is where you need common sense the most. Use digital-safety best practices such as enabling two-factor authentication wherever possible. Coinbase recommends a code generator or two-factor key, a strong password, not sharing passwords, making sure you have a legacy plan for your digital wallet information and, maybe most importantly, physically locking your doors. Got a question for “Fix My Portfolio” about the mechanics of investing, how it fits into your overall financial plan and what strategies can help you make the most out of your money? You can write to me at beth.pinsker@marketwatch.com.  More on MarketWatch \n\n\n      ",
		"isFull": true,
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Kim Khan",
		"title": "China stocks get a bullish nod from Morgan Stanley",
		"description": "Morgan Stanley boosted its view on China equities Monday and continues to favor emerging markets over developed markets.",
		"url": "https://seekingalpha.com/news/3913969-china-stocks-get-a-bullish-nod-from-morgan-stanley",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/917311020/image_917311020.jpg?io=getty-c-w1280",
		"publishedAt": 1670259650000,
		"content": "Easyturn\r\nMorgan Stanley boosted its view on China equities Monday and continues to favor emerging markets over developed markets.\r\nStrategist Jonathan Garner upgraded China (NASDAQ:MCHI) (FXI) to Ov… [+1289 chars]",
		"titleScore": 0,
		"titleMarketGrams": "China stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Minneapolis Star Tribune"
		},
		"author": "DAMIAN J. TROISE",
		"title": "US stocks slip as investors weigh economic data, Fed policy",
		"description": "Stocks fell in midday trading on Wall Street Monday and bond yields rose as investors face a mostly quiet week that will be capped by a closely watched update on inflation.",
		"url": "https://www.startribune.com/us-stocks-slip-as-investors-weigh-economic-data-fed-policy/600232993/",
		"urlToImage": "https://www.startribune.com/static/img/branding/logos/strib-social-card.png?d=1670260264",
		"publishedAt": 1670259618000,
		"content": "NEW YORK Stocks fell in midday trading on Wall Street Monday and bond yields rose as investors face a mostly quiet week that will be capped by a closely watched update on inflation.\r\nThe S&amp;P 500 … [+3177 chars]",
		"titleScore": -1,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Jim Cramer's top 10 things to watch in the market Monday: Stocks, China, Apple",
		"description": "1. Morgan Stanley's Mike Wilson says he has seen enough of the rally, and he says it's time to bail. There's less than 2% upside at the high end of his year-end S&P 500 price target of 4,000 to 4,150. Stay with defensive stocks and utilities. The industrials …",
		"url": "https://biztoc.com/x/e72a8be48d9e7ce3",
		"urlToImage": "https://c.biztoc.com/p/e72a8be48d9e7ce3/og.webp",
		"publishedAt": 1670259365000,
		"content": "1. Morgan Stanley's Mike Wilson says he has seen enough of the rally, and he says it's time to bail. There's less than 2% upside at the high end of his year-end S&amp;P 500 price target of 4,000 to 4… [+908 chars]",
		"titleScore": 2,
		"titleMarketGrams": "watch in the market \n"
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Vivien Lou Chen",
		"title": "Currencies: Global financial system vulnerable to $80 trillion-plus problem in FX market, warns BIS",
		"description": "Fabrice Coffrini/Agence France-Presse/Getty ImagesThere’s a “huge, missing and growing” problem inside the round-the-clock foreign-exchange market, and it’s one that can’t be seen. That’s according to the Bank for International Settlements, which cited trilli…",
		"url": "https://www.marketwatch.com/story/global-financial-system-vulnerable-to-80-trillion-plus-problem-in-fx-market-warns-bis-11670259414",
		"urlToImage": "https://images.mktw.net/im-679126/social",
		"publishedAt": 1670259360000,
		"content": "Theres a huge, missing and growing problem inside the round-the-clock foreign-exchange market, and its one that cant be seen. \r\nThats according to the Bank for International Settlements, which cited … [+1697 chars]",
		"titleScore": -6,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "mfox@businessinsider.com (Matthew Fox)",
		"title": "Morgan Stanley's top strategist has turned bearish, and says investors should sell stocks as the latest rally hits a wall",
		"description": "Mike Wilson believes the 17% rally in the S&P 500 rally from its mid-October low is simply a bear-market rally.",
		"url": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-sell-bear-rally-cracks-form-jobs-consumer-2022-12",
		"urlToImage": "https://i.insider.com/62ab88cb384b5400184164c3?width=1200&format=jpeg",
		"publishedAt": 1670258994000,
		"content": "US stocks have had a good run over the past six weeks, with the S&amp;P 500 soaring as much as 17% from its mid-October low.\r\nBut now its time for investors to fade the bear market rally and take pro… [+2568 chars]",
		"titleScore": 2,
		"titleMarketGrams": "investors should sell stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "Denmark stocks higher at close of trade; OMX Copenhagen 20 up 0.22% By Investing.com",
		"description": "Investing.com – Denmark stocks were higher after the close on Monday, as gains in the Consumer Goods, Oil & Gas and Financials sectors led shares higher. The best performers of the session on the OMX Copenhagen 20 were Ambu A/S (CSE:AMBUb), which rose 2.99% o…",
		"url": "https://biztoc.com/x/e78dee73ae6d049e",
		"urlToImage": "https://c.biztoc.com/p/e78dee73ae6d049e/og.webp",
		"publishedAt": 1670258769000,
		"content": "Investing.com Denmark stocks were higher after the close on Monday, as gains in the Consumer Goods, Oil &amp; Gas and Financials sectors led shares higher.\r\nThe best performers of the session on the … [+983 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Denmark stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Could This Beaten-Down Stock Be the Next 100-Bagger?",
		"description": "Many would argue that searching for 100-baggers -- stocks that return $100 for every $1 invested -- is as likely as winning the lottery. It definitely requires some luck. But not that much. Focusing on a few attributes of a business can dramatically increase …",
		"url": "https://biztoc.com/x/92ea19450c6e838b",
		"urlToImage": "https://c.biztoc.com/p/92ea19450c6e838b/og.webp",
		"publishedAt": 1670258645000,
		"content": "Many would argue that searching for 100-baggers -- stocks that return $100 for every $1 invested -- is as likely as winning the lottery. It definitely requires some luck. But not that much. Focusing … [+956 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "We're trimming this oil stock after it climbed more than 50% over the past 3 months",
		"description": "We're selling 300 shares of Halliburton (HAL) at roughly $38.45 a share. Following Monday's trade, Jim Cramer's Charitable Trust will own 2,225 shares of Halliburton, decreasing its weighting in the portfolio to about 3% from 3.38%. Energy stocks were early o…",
		"url": "https://biztoc.com/x/996a9f20054b910a",
		"urlToImage": "https://c.biztoc.com/p/996a9f20054b910a/og.webp",
		"publishedAt": 1670258526000,
		"content": "We're selling 300 shares of Halliburton (HAL) at roughly $38.45 a share. Following Monday's trade, Jim Cramer's Charitable Trust will own 2,225 shares of Halliburton, decreasing its weighting in the … [+980 chars]",
		"titleScore": 0,
		"titleMarketGrams": "trimming this oil stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Joy Wiltermuth",
		"title": "Dow tumbles 300 points, S&P 500 skids 1.3% as investors eye Fed response to strong U.S economic data",
		"description": "U.S. stocks fell Monday to kick off a fresh week, with the S&P 500 and Nasdaq both down more than 1.2% heading into midday. The Dow Jones Industrial Average was down about 299 point, or 0.9%, trading near 34,134, while the S&P 500 index was off 1.2% and the N…",
		"url": "https://www.marketwatch.com/story/dow-tumbles-300-points-sp-500-skids-13-as-investors-eye-fed-response-to-strong-us-economic-data-2022-12-05",
		"urlToImage": "https://s.wsj.net/public/resources/MWimages/MW-GP644_MicroS_ZG_20180906154215.jpg",
		"publishedAt": 1670258380000,
		"content": "U.S. stocks fell Monday to kick off a fresh week, with the S&amp;P 500 and Nasdaq both down more than 1.2% heading into midday. The Dow Jones Industrial Average \r\n DJIA,\r\n -1.06%\r\nwas down about 299 … [+627 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Jacob Sonenshine",
		"title": "'Margin Debt’ Is at Normal Levels Again. That’s Good for Stocks.",
		"description": "Too much debt can exacerbate market losses because it forces stock traders to keep selling. Now, overall margin debt is in line with data going back to the 1990s.",
		"url": "https://www.barrons.com/articles/margin-debt-stocks-fed-51670258200",
		"urlToImage": "https://images.barrons.com/im-679120/social",
		"publishedAt": 1670258220000,
		"content": "Margin debt has plummeted. Cross it off the list of concerns for the stock market right now. For starters, margin debt is a sum of funds that traders borrow from their brokers in order to buy more st… [+2375 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Mark J. Grant",
		"title": "Navigating The Treacherous",
		"description": "This has been a miserable year for both stocks and bonds. No matter what investing strategy that you use, the liquidating values are not showing any joy. Read more here...",
		"url": "https://seekingalpha.com/article/4562390-navigating-treacherous-markets",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/874171760/image_874171760.jpg?io=getty-c-w750",
		"publishedAt": 1670258100000,
		"content": "franckreporter/E+ via Getty Images\r\nBy any stretch of anyone’s imagination, this has been a miserable year for both stocks and bonds. Many portfolios have just taken it on the nose, as “plays for app… [+4208 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "5 Amazing Stocks You Won’t Ever Regret Buying",
		"description": "5 Amazing Stocks You Won’t Ever Regret Buying Easing inflation and the Fed’s indication of slowing the pace of interest rate hikes are raising investors’ sentiments. Moreover, the November job report came in better than expected. While uncertainties... Easing…",
		"url": "https://biztoc.com/x/37758ac4e8489fbb",
		"urlToImage": "https://c.biztoc.com/p/37758ac4e8489fbb/og.webp",
		"publishedAt": 1670257949000,
		"content": "5 Amazing Stocks You Wont Ever Regret Buying\r\nEasing inflation and the Feds indication of slowing the pace of interest rate hikes are raising investors sentiments. Moreover, the November job report c… [+976 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "3 Smart Stocks to Buy Before Your 50th Birthday",
		"description": "3 Smart Stocks to Buy Before Your 50th Birthday November's job growth was better than expected, even after the Federal Reserve’s aggressive action to cool the economy. Moreover, the sound third-quarter GDP growth and analysts predicting a mild recession... No…",
		"url": "https://biztoc.com/x/5f7e63f49310e6c4",
		"urlToImage": "https://c.biztoc.com/p/5f7e63f49310e6c4/og.webp",
		"publishedAt": 1670257947000,
		"content": "3 Smart Stocks to Buy Before Your 50th Birthday\r\nNovember's job growth was better than expected, even after the Federal Reserves aggressive action to cool the economy. Moreover, the sound third-quart… [+1009 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "3 Travel and Leisure Stocks That Are Worthy Bets Right Now",
		"description": "3 Travel and Leisure Stocks That Are Worthy Bets Right Now The growth of the travel and leisure sector is fuelled by increasing per capita disposable income and a rising desire for travel. Given the surge in leisure travel demand, it... The growth of the trav…",
		"url": "https://biztoc.com/x/7ff6065082d3c71d",
		"urlToImage": "https://c.biztoc.com/p/7ff6065082d3c71d/og.webp",
		"publishedAt": 1670257947000,
		"content": "3 Travel and Leisure Stocks That Are Worthy Bets Right Now\r\nThe growth of the travel and leisure sector is fuelled by increasing per capita disposable income and a rising desire for travel. Given the… [+1003 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Peter F. Way",
		"title": "Market-Maker Hedging Foretells Coming DJ Price Gains Over Declines",
		"description": "Continuity of equity market price-posting makes volume block trades in 30 DJ stocks an essential market price-expectation component. Read what investors need to know.",
		"url": "https://seekingalpha.com/article/4562378-market-maker-hedging-foretells-coming-dj-price-gains-over-declines",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1220627489/image_1220627489.jpg?io=getty-c-w750",
		"publishedAt": 1670257865000,
		"content": "Pgiam/iStock via Getty Images\r\nInvesting Thesis\r\n As outlined in the above bullet points, well-informed professional coming price-change expectations are regularly suggested by behavioral actions of … [+1405 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "ValueWalk"
		},
		"author": "Pierre Raymond",
		"title": "Look For Stocks With Leverage Top-Line Growth",
		"description": "The Broad Market Index was up 1.53% last week and 51% of stocks out-performed the index. With the Securities and Exchange Commission (SEC) financial statement update over 90% complete now, we have two slow weeks before the last companies with fiscal quarters …",
		"url": "https://www.valuewalk.com/look-for-stocks-with-leverage-top-line-growth/",
		"urlToImage": "https://www.valuewalk.com/wp-content/uploads/2022/11/SP-500-historical-returns.jpeg",
		"publishedAt": 1670257536000,
		"content": "The Broad Market Index was up 1.53% last week and 51% of stocks out-performed the index.\r\nWith the Securities and Exchange Commission (SEC) financial statement update over 90% complete now, we have t… [+4030 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Tradevestor",
		"title": "The $5 Trillion Fund Favorites: Do The Opposite",
		"description": "We look at the \"desired dozen\" and \"forsaken 23\" stocks and offer our thoughts on which is the best strategy. Click here to read more to see our thoughts.",
		"url": "https://seekingalpha.com/article/4562376-5-trillion-fund-favorites-do-opposite",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1250117100/image_1250117100.jpg?io=getty-c-w750",
		"publishedAt": 1670257534000,
		"content": "DNY59\r\nIt is natural at this time of the year for investment firms and individual analysts to chew on the year that is about to go down and to look forward. Hence, there is nothing abnormal for news … [+6174 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "The S&P 500 could plunge 20% within months as a recession ushers in a market correction, BofA says",
		"description": "Scott Olson/Getty Images Bank of America equity strategists warned that stocks could see a correction in 2023 as a recession looms. Historical trends suggest the S&P 500 bottoms out during a recession, rather than before, which suggests more downside ahead. I…",
		"url": "https://biztoc.com/x/33df53904f24024f",
		"urlToImage": "https://c.biztoc.com/p/33df53904f24024f/og.webp",
		"publishedAt": 1670257445000,
		"content": "Scott Olson/Getty Images\r\nBank of America equity strategists warned that stocks could see a correction in 2023 as a recession looms.\r\nHistorical trends suggest the S&amp;P 500 bottoms out during a re… [+959 chars]",
		"titleScore": -2,
		"titleMarketGrams": "ushers in a market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "US stocks drop and bond yields rise as traders await round of new economic data",
		"description": "Spencer Platt/Getty US stocks fell to start the week, with investors awaiting more economic data after the November jobs report. On tap this week is the latest Producer Price Index Reading on Friday, as well as new consumer sentiment data. Bond yields rose, w…",
		"url": "https://biztoc.com/x/0281715489d5f9f3",
		"urlToImage": "https://c.biztoc.com/p/0281715489d5f9f3/og.webp",
		"publishedAt": 1670257444000,
		"content": "Spencer Platt/Getty\r\nUS stocks fell to start the week, with investors awaiting more economic data after the November jobs report. \r\nOn tap this week is the latest Producer Price Index Reading on Frid… [+1031 chars]",
		"titleScore": -1,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Anuron Mitra",
		"title": "S&P, Nasdaq, Dow fall, yields gain on solid economic data as Fed quiet period begins",
		"description": "U.S. stocks on Monday had bounced off their session lows but were weighed down on stronger than expected economic data which pointed to resilience in the economy despite the...",
		"url": "https://seekingalpha.com/news/3913960-sp500-dow-jones-nasdaq-stock-market-economic-data",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1410837132/image_1410837132.jpg?io=getty-c-w1280",
		"publishedAt": 1670257213000,
		"content": "Spencer Platt/Getty Images News\r\nU.S. stocks on Monday had bounced off their session lows but were weighed down on stronger than expected economic data which pointed to resilience in the economy desp… [+2193 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "We're trimming this oil stock after it climbed more than 50% over the past 3 months",
		"description": "We're selling 300 shares of Halliburton (HAL) at roughly $38.45 a share. Following Monday's trade, Jim Cramer's Charitable Trust will own 2,225 shares of Halliburton, decreasing its weighting in the portfolio to about 3% from 3.38%. Energy stocks were early o…",
		"url": "https://biztoc.com/x/324f43e70e7f17bb",
		"urlToImage": "https://c.biztoc.com/p/324f43e70e7f17bb/og.webp",
		"publishedAt": 1670257087000,
		"content": "We're selling 300 shares of Halliburton (HAL) at roughly $38.45 a share. Following Monday's trade, Jim Cramer's Charitable Trust will own 2,225 shares of Halliburton, decreasing its weighting in the … [+945 chars]",
		"titleScore": 0,
		"titleMarketGrams": "trimming this oil stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "PRNewswire"
		},
		"author": null,
		"title": "What the Hell Is an Economy? 2nd Edition Published by Engineer/Angel Investor",
		"description": "\"Wealth is Not Money, and Money is Not Wealth\" – a New Mantra ASPEN, Colo., Dec. 5, 2022 /PRNewswire/ -- Stocks. Mortgages. Rate hikes. Banks. Inflation. Cryptocurrency. COVID-19. Are you sick of hearing about all of these? Do you know what they all even mean…",
		"url": "https://www.prnewswire.com/news-releases/what-the-hell-is-an-economy-2nd-edition-published-by-engineerangel-investor-301694805.html",
		"urlToImage": null,
		"publishedAt": 1670257080000,
		"content": "\"Wealth is Not Money, and Money is Not Wealth\" a New Mantra\r\nASPEN, Colo., Dec. 5, 2022 /PRNewswire/ -- Stocks. Mortgages. Rate hikes. Banks. Inflation. Cryptocurrency. COVID-19. Are you sick of hear… [+2220 chars]",
		"titleScore": -4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Getty Images",
		"title": "These 7 financial services stocks touch their new 52-week high",
		"description": "The benchmark index Sensex closed a bit lower — about 34 points — to end at 62,834 on Monday. During the trade, 18 stocks from the BSE Financial Services index managed to touch new 52-week highs. To filter the list further, we considered only stocks with a ma…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-financial-services-stocks-touch-their-new-52-week-high/scaling-peaks/slideshow/96009401.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-96009401,width-1070,height-580,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670256731000,
		"content": "The benchmark index Sensex closed a bit lower about 34 points to end at 62,834 on Monday. During the trade, 18 stocks from the BSE Financial Services index managed to touch new 52-week highs. To filt… [+375 chars]",
		"titleScore": 0,
		"titleMarketGrams": "7 financial services stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Boston Herald"
		},
		"author": "Associated Press",
		"title": "Stocks lose ground on Wall Street, crude oil prices climb",
		"description": "NEW YORK (AP) — Stocks fell in morning trading on Wall Street Monday and bond yields rose as investors face a mostly quiet week that will be capped by a closely watched update on inflation.",
		"url": "https://www.bostonherald.com/2022/12/05/stocks-lose-ground-on-wall-street-crude-oil-prices-climb/",
		"urlToImage": "https://www.bostonherald.com/wp-content/uploads/2022/12/Japan_Financial_Markets_07410-1.jpg?w=1024&h=682",
		"publishedAt": 1670256594000,
		"content": "By DAMIAN J. TROISE\r\nNEW YORK (AP) — Stocks fell in morning trading on Wall Street Monday and bond yields rose as investors face a mostly quiet week that will be capped by a closely watched update on… [+2163 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Leo Nelissen",
		"title": "Supply Chains Are Coming Back! 3 Dividend Stocks To Benefit From That",
		"description": "In this article, we look into the long-term supply chain re-shoring trend, and why this benefits North America. Click to read which stocks stand to benefit.",
		"url": "https://seekingalpha.com/article/4562370-supply-chains-coming-back-3-dividend-stocks-benefit",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1332982274/image_1332982274.jpg?io=getty-c-w750",
		"publishedAt": 1670256381000,
		"content": "narvikk\r\nIntroduction\r\n One of the things we will talk a lot about in the future is supply chain reconfiguration. We have discussed it in the past, but we haven't covered a lot of actionable investme… [+19589 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "AllAfrica - Top Africa News"
		},
		"author": "MAP",
		"title": "Casablanca Stock Exchange Starts Slightly Up",
		"description": "[MAP] Casablanca -- The Casablanca Stock Exchange started slightly up on Monday, with the index of all stocks, the MASI, gaining 0.21% to 11,051.27 points (pts).",
		"url": "https://allafrica.com/stories/202212050684.html",
		"urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
		"publishedAt": 1670256257000,
		"content": "Casablanca — The Casablanca Stock Exchange started slightly up on Monday, with the index of all stocks, the MASI, gaining 0.21% to 11,051.27 points (pts).\r\nA few minutes after the opening, the MSI 20… [+237 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "PRNewswire"
		},
		"author": null,
		"title": "Thinking about buying stock in Tilray, Cosmos, IQIYI, Credit Suisse, or EHang?",
		"description": "NEW YORK, Dec. 5, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for TLRY, COSM, IQ, CS, and EH. To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecting…",
		"url": "https://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-tilray-cosmos-iqiyi-credit-suisse-or-ehang-301694771.html",
		"urlToImage": "https://mma.prnewswire.com/media/1333368/InvestorsObserver_Logo.jpg?p=facebook",
		"publishedAt": 1670255760000,
		"content": "NEW YORK, Dec. 5, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for TLRY, COSM, IQ, CS, and EH.\r\nTo see how InvestorsObserver's proprietary scoring system rates these stock… [+794 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Thinking about buying stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "PRNewswire"
		},
		"author": null,
		"title": "Thinking about buying stock in Nio, Lufax, Winc, TOP Ships, or Canopy Growth Corp?",
		"description": "NEW YORK, Dec. 5, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for NIO, LU, WBEV, TOPS, and CGC. To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by selecti…",
		"url": "https://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-nio-lufax-winc-top-ships-or-canopy-growth-corp-301694765.html",
		"urlToImage": "https://mma.prnewswire.com/media/1333368/InvestorsObserver_Logo.jpg?p=facebook",
		"publishedAt": 1670255760000,
		"content": "NEW YORK, Dec. 5, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for NIO, LU, WBEV, TOPS, and CGC.\r\nTo see how InvestorsObserver's proprietary scoring system rates these sto… [+796 chars]",
		"titleScore": 4,
		"titleMarketGrams": "Thinking about buying stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "U.S. stocks lower as investors weigh Fed's next move By Investing.com",
		"description": "By Liz Moyer Investing.com -- U.S. stocks fell after last week’s stronger-than-expected jobs report for last month fueled speculation about the Federal Reserve’s next move on interest rates. At 10:37 ET (15:37 GMT), the Dow Jones Industrial Average was down 2…",
		"url": "https://biztoc.com/x/eb8113ee6b0218ca",
		"urlToImage": "https://c.biztoc.com/p/eb8113ee6b0218ca/og.webp",
		"publishedAt": 1670255426000,
		"content": "By Liz Moyer\r\nInvesting.com -- U.S. stocks fell after last weeks stronger-than-expected jobs report for last month fueled speculation about the Federal Reserves next move on interest rates.\r\nAt 10:37… [+969 chars]",
		"titleScore": 0,
		"titleMarketGrams": "U.S. stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Cannabis stocks rally after President Biden signs research bill and reports of SAFE Banking measure advancing",
		"description": "The AdvisorShares Pure U.S. Cannabis ETF MSOS, +8.25% bucked a down trend in the broad equities market on Monday and rallied 7.8%. The surge came days after President Joe Biden signed legislation Friday to expand cannabis research. Reports have also surfaced …",
		"url": "https://biztoc.com/x/0606df006fd85f9e",
		"urlToImage": "https://c.biztoc.com/p/0606df006fd85f9e/og.webp",
		"publishedAt": 1670254564000,
		"content": "The AdvisorShares Pure U.S. Cannabis ETF\r\nMSOS,\r\n+8.25%\r\nbucked a down trend in the broad equities market on Monday and rallied 7.8%. The surge came days after President Joe Biden signed legislation … [+700 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Cannabis stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Minneapolis Star Tribune"
		},
		"author": "DAMIAN J. TROISE",
		"title": "Stocks lose ground on Wall Street, crude oil prices climb",
		"description": "Stocks fell in morning trading on Wall Street Monday and bond yields rose as investors face a mostly quiet week that will be capped by a closely watched update on inflation.",
		"url": "https://www.startribune.com/stocks-lose-ground-on-wall-street-crude-oil-prices-climb/600232993/",
		"urlToImage": "https://www.startribune.com/static/img/branding/logos/strib-social-card.png?d=1670255754",
		"publishedAt": 1670254501000,
		"content": "NEW YORK Stocks fell in morning trading on Wall Street Monday and bond yields rose as investors face a mostly quiet week that will be capped by a closely watched update on inflation.\r\nThe S&amp;P 500… [+2132 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "Dow Jones Drops 270 Points Amid Economic Data; Tesla Skids On Plans To Cut Production - Investor's Business Daily",
		"description": "Dow Jones Drops 270 Points Amid Economic Data; Tesla Skids On Plans To Cut ProductionInvestor's Business Daily Stock market news live updates: Stocks fall ahead of more economic dataYahoo Finance 5 things to know before the stock market opens MondayCNBC Dow J…",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=168649824",
		"urlToImage": null,
		"publishedAt": 1670254434000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "U.S.-listed Chinese stocks rally as investors turn bullish on reopening shift",
		"description": "Shares of Chinese companies listed in the U.S. erased earlier gains Monday after China loosened more Covid restrictions to accelerate the reopening of the economy. The Invesco Golden Dragon China ETF, which tracks the Nasdaq Golden Dragon China Index, last tr…",
		"url": "https://biztoc.com/x/9734a87dafff75b5",
		"urlToImage": "https://c.biztoc.com/p/9734a87dafff75b5/og.webp",
		"publishedAt": 1670254326000,
		"content": "Shares of Chinese companies listed in the U.S. erased earlier gains Monday after China loosened more Covid restrictions to accelerate the reopening of the economy.\r\nThe Invesco Golden Dragon China ET… [+990 chars]",
		"titleScore": 0,
		"titleMarketGrams": "U.S.-listed Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Stocks Drop Ahead Of Economic Data",
		"description": "The Dow Jones Industrial Average sold off 350 points Monday after a host of November economic data, including the PMI composite, the ISM services index and factory orders. China stocks resumed their rebound on a shift in domestic Covid policy. Tesla stock ski…",
		"url": "https://biztoc.com/x/8d54088c05014103",
		"urlToImage": "https://c.biztoc.com/p/8d54088c05014103/og.webp",
		"publishedAt": 1670253487000,
		"content": "The Dow Jones Industrial Average sold off 350 points Monday after a host of November economic data, including the PMI composite, the ISM services index and factory orders. China stocks resumed their … [+968 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Sristi Suman Jayaswal",
		"title": "5 Amazing Stocks You Won’t Ever Regret Buying",
		"description": "Easing inflation and the Fed’s indication of slowing the pace of interest rate hikes are raising investors’ sentiments. Moreover, the November job report came in better than expected. While uncertainties...",
		"url": "https://stocknews.com/news/pfe-azn-carr-jill-lway-5-amazing-stocks-you-wont-ever-regret-buying/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-440417.jpeg",
		"publishedAt": 1670253115000,
		"content": "Easing inflation and the Feds indication of slowing the pace of interest rate hikes are raising investors sentiments. Moreover, the November job report came in better than expected. While uncertainti… [+12765 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "forbes.com",
		"title": "Positives For Wall Street?",
		"description": "Key Takeaways - Tried and True Stocks - Volatility Falling - A Santa Claus Rally? Friday’s stronger than expected employment report initially sent markets lower. However, by the time the day ended, stocks had recovered much of what had been lost to close rela…",
		"url": "https://biztoc.com/x/76f771769ccfe131",
		"urlToImage": "https://c.biztoc.com/p/76f771769ccfe131/og.webp",
		"publishedAt": 1670253005000,
		"content": "Key Takeaways\r\n- Tried and True Stocks\r\n- Volatility Falling\r\n- A Santa Claus Rally?\r\nFridays stronger than expected employment report initially sent markets lower. However, by the time the day ended… [+989 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "These 2 Nasdaq Stocks Could Make or Break the Market This Week",
		"description": "Investors in the Nasdaq Composite (^IXIC -0.43%) have had a tough 2022, with the index mired in a severe bear market. Even after significant gains in recent weeks, the Nasdaq is far from recovering all of its lost ground, and it appeared that the index would …",
		"url": "https://biztoc.com/x/063e6d2f32a2915e",
		"urlToImage": "https://c.biztoc.com/p/063e6d2f32a2915e/og.webp",
		"publishedAt": 1670252765000,
		"content": "Investors in the Nasdaq Composite (^IXIC -0.43%) have had a tough 2022, with the index mired in a severe bear market. Even after significant gains in recent weeks, the Nasdaq is far from recovering a… [+908 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Dulan Lokuwithana",
		"title": "Verve drops 21% as FDA seeks more data to lift clinical hold on lead asset",
		"description": "Verve Therapeutics (VERV) plunged on Monday, driving down other stocks in gene editing space after the FDA requested more data to lift a clinical hold. Read the full story here.",
		"url": "https://seekingalpha.com/news/3913939-verv-stock-leads-gene-editing-stocks-lower-as-fda-seeks-more-data",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/958260280/image_958260280.jpg?io=getty-c-w1280",
		"publishedAt": 1670252535000,
		"content": "PhonlamaiPhoto\r\nVerve Therapeutics (NASDAQ:VERV) lost ~21% in the morning hours Monday, driving down its peers in the gene editing space after the clinical-stage biotech said that the FDA requested a… [+1336 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Stocks making the biggest moves premarket: Silvergate Capital, MGM Resorts, Bilibili, Murphy Oil & more",
		"description": "Check out the companies making headlines in premarket trading Monday. United Airlines — Shares rose 1% after Morgan Stanley upgraded United Airlines to overweight from equal weight, saying 2023 could be a \"goldilocks\" year for the airline stock. related inves…",
		"url": "https://biztoc.com/x/27aabaaa33087f8f",
		"urlToImage": "https://c.biztoc.com/p/27aabaaa33087f8f/og.webp",
		"publishedAt": 1670252529000,
		"content": "Check out the companies making headlines in premarket trading Monday.\r\nUnited Airlines Shares rose 1% after Morgan Stanley upgraded United Airlines to overweight from equal weight, saying 2023 could … [+969 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "U.S.-listed Chinese stocks rally as investors turn bullish on reopening shift",
		"description": "Shares of Chinese companies listed in the U.S. jumped Monday after China loosened more Covid restrictions to accelerate the reopening of the economy. The Invesco Golden Dragon China ETF, which tracks the Nasdaq Golden Dragon China Index, rallied about 3% Mond…",
		"url": "https://biztoc.com/x/4460c9a1a532c373",
		"urlToImage": "https://c.biztoc.com/p/4460c9a1a532c373/og.webp",
		"publishedAt": 1670252529000,
		"content": "Shares of Chinese companies listed in the U.S. jumped Monday after China loosened more Covid restrictions to accelerate the reopening of the economy.\r\nThe Invesco Golden Dragon China ETF, which track… [+994 chars]",
		"titleScore": 0,
		"titleMarketGrams": "U.S.-listed Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Metals Stocks: Gold retreats from 4-month high as worries about Friday’s U.S. jobs data limit gains",
		"description": "Gold prices declined Monday, after briefly touched a 4-month intraday high, as the U.S. dollar remained near a five month low against major currencies, but worries about hotter-than-expected wage growth reported in Friday’s U.S. November employment report pus…",
		"url": "https://biztoc.com/x/e7f37cbb0fa9eb47",
		"urlToImage": "https://c.biztoc.com/p/e7f37cbb0fa9eb47/og.webp",
		"publishedAt": 1670252527000,
		"content": "Gold prices declined Monday, after briefly touched a 4-month intraday high, as the U.S. dollar remained near a five month low against major currencies, but worries about hotter-than-expected wage gro… [+941 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Nio, Alibaba, Bilibili among China stocks set for another rally as Covid controls ease",
		"description": "U.S.-listed shares of Chinese internet and electric-vehicle stocks are enjoying a sharp rally yet again in premarket trading Monday amid reports that officials in the country were easing pandemic restrictions. China is easing some of the world’s most stringen…",
		"url": "https://biztoc.com/x/5cd900fb78cc9fa2",
		"urlToImage": "https://c.biztoc.com/p/5cd900fb78cc9fa2/og.webp",
		"publishedAt": 1670252526000,
		"content": "U.S.-listed shares of Chinese internet and electric-vehicle stocks are enjoying a sharp rally yet again in premarket trading Monday amid reports that officials in the country were easing pandemic res… [+957 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Bilibili among China stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Boston Herald"
		},
		"author": "Associated Press",
		"title": "Stocks open lower on Wall Street, crude oil prices climb",
		"description": "NEW YORK (AP) — Stocks are opening lower on Wall Street, with the exception of energy companies, which rose along with the price of oil. Crude prices were up almost 3% early Monday after a group of world leaders agreed to a boycott of most Russian oil and Chi…",
		"url": "https://www.bostonherald.com/2022/12/05/stocks-open-lower-on-wall-street-crude-oil-prices-climb-2/",
		"urlToImage": "https://www.bostonherald.com/wp-content/uploads/2022/12/Japan_Financial_Markets_07410-1.jpg?w=1024&h=682",
		"publishedAt": 1670252446000,
		"content": "NEW YORK (AP) — Stocks are opening lower on Wall Street, with the exception of energy companies, which rose along with the price of oil. Crude prices were up almost 3% early Monday after a group of w… [+4632 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "prosen@insider.com (Phil Rosen)",
		"title": "The S&P 500 could plunge 20% within months as a recession ushers in a market correction, BofA says",
		"description": "History suggests stocks bottom out during a recession, not before. So BofA analysts warn the S&P 500 could drop as low as 3,240 by April 2023.",
		"url": "https://www.businessinsider.com/stock-market-outlook-correction-recession-sp500-economy-bofa-investing-2023-2022-12",
		"urlToImage": "https://i.insider.com/638dfe0d2cd2de0018d01dc3?width=1200&format=jpeg",
		"publishedAt": 1670252306000,
		"content": "Aa looming economic downturn could usher in a more dramatic correction in stocks as soon as the first quarter of 2023, even with the S&amp;P 500 already down 15% year-to-date, according to Bank of Am… [+1367 chars]",
		"titleScore": -2,
		"titleMarketGrams": "ushers in a market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "seekingalpha.com",
		"title": "Wall Street Breakfast December 5: Russia Won't Accept G7 Oil Price Cap (Podcast)",
		"description": "Russia won't accept the G7 oil price cap, even if it has to cut output. Tesla (TSLA) to cut production at Shanghai plant amid slow demand - Bloomberg. GM (GM) venture to invest additional $275M to expand a Tennessee battery cell factory for EV. Learn more abo…",
		"url": "https://biztoc.com/x/e710a143a30f19e7",
		"urlToImage": "https://c.biztoc.com/p/e710a143a30f19e7/og.webp",
		"publishedAt": 1670252167000,
		"content": "Russia won't accept the G7 oil price cap, even if it has to cut output. Tesla (TSLA) to cut production at Shanghai plant amid slow demand - Bloomberg. GM (GM) venture to invest additional $275M to ex… [+851 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Steve Gelsi",
		"title": "Cannabis stocks rally after President Biden signs research bill and reports of SAFE Banking measure advancing",
		"description": "The AdvisorShares Pure U.S. Cannabis ETF bucked a down trend in the broad equities market on Monday and rallied 7.8%. The surge came days after President Joe Biden signed legislation Friday to expand cannabis research. Reports have also surfaced in recent day…",
		"url": "https://www.marketwatch.com/story/cannabis-stocks-rally-after-president-biden-signs-research-bill-and-reports-of-safe-banking-measure-advancing-2022-12-05",
		"urlToImage": "https://s.wsj.net/public/resources/MWimages/MW-GP644_MicroS_ZG_20180906154215.jpg",
		"publishedAt": 1670252110000,
		"content": "The AdvisorShares Pure U.S. Cannabis ETF \r\n MSOS,\r\n +7.12%\r\nbucked a down trend in the broad equities market on Monday and rallied 7.8%. The surge came days after President Joe Biden signed legislati… [+511 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Cannabis stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Minneapolis Star Tribune"
		},
		"author": "Star Tribune Staff",
		"title": "Stocks open lower on Wall Street, crude oil prices climb",
		"description": "Stocks are opening lower on Wall Street, with the exception of energy companies, which rose along with the price of oil. Crude prices were up almost 3% early Monday after a group of world leaders agreed to a boycott of most Russian oil and China loosened some…",
		"url": "https://www.startribune.com/stocks-open-lower-on-wall-street-crude-oil-prices-climb/600232993/",
		"urlToImage": "https://www.startribune.com/static/img/branding/logos/strib-social-card.png?d=1670014978",
		"publishedAt": 1670252102000,
		"content": "NEW YORK Stocks are opening lower on Wall Street, with the exception of energy companies, which rose along with the price of oil. Crude prices were up almost 3% early Monday after a group of world le… [+4618 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "‘These Restaurant Stocks Look Tasty’: Jim Cramer Says Now Is the Time to Pull the Trigger",
		"description": "It’s easy to get the appeal of restaurant stocks in a normalizing economy. So believes Jim Cramer, the well-known host of CNBC’s Mad Money. Commenting following Fed Chair Jerome Powell’s speech last week, which indicated a willingness by the policy makers to …",
		"url": "https://biztoc.com/x/643898b8d9f5e1e6",
		"urlToImage": "https://c.biztoc.com/p/643898b8d9f5e1e6/og.webp",
		"publishedAt": 1670252045000,
		"content": "Its easy to get the appeal of restaurant stocks in a normalizing economy. So believes Jim Cramer, the well-known host of CNBCs Mad Money.\r\nCommenting following Fed Chair Jerome Powells speech last we… [+946 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Dan Caplinger)",
		"title": "These 2 Nasdaq Stocks Could Make or Break the Market This Week",
		"description": "The latest financial results from these two companies will give a broad indication of how well key parts of the economy are faring.",
		"url": "https://www.fool.com/investing/2022/12/05/these-2-nasdaq-stocks-could-make-or-break-the-mark/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711788/yoga-gettyimages-1148443257.jpg",
		"publishedAt": 1670252040000,
		"content": "Investors in the Nasdaq Composite (^IXIC -1.12%) have had a tough 2022, with the index mired in a severe bear market. Even after significant gains in recent weeks, the Nasdaq is far from recovering a… [+3948 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "This Beaten-Down Growth Stock Has Up to 60% Upside, According to Wall Street",
		"description": "Like many technology stocks, Intuit (INTU -1.42%) has gotten clobbered this year. The fintech company has lost nearly 40% of its value. Weighing on shares are concerns that a weakening macroeconomic environment will impact the company's growth prospects. With…",
		"url": "https://biztoc.com/x/b875000c1076e441",
		"urlToImage": "https://c.biztoc.com/p/b875000c1076e441/og.webp",
		"publishedAt": 1670251924000,
		"content": "Like many technology stocks, Intuit (INTU -1.42%) has gotten clobbered this year. The fintech company has lost nearly 40% of its value. Weighing on shares are concerns that a weakening macroeconomic … [+961 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Clark Schultz",
		"title": "Watch these hotels stocks to outperform in 2023",
		"description": "Morgan Stanley is positive on the hotel sector with the recovery in travel still underway. Read more.",
		"url": "https://seekingalpha.com/news/3913928-watch-these-hotels-stocks-to-outperform-in-2023",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/171316850/image_171316850.jpg?io=getty-c-w1280",
		"publishedAt": 1670251819000,
		"content": "RiverNorthPhotography\r\nMorgan Stanley is positive on the hotel sector with the recovery in travel still underway. Analyst Stephen Grambling and team believe macro risk is more muted than a typical ec… [+2082 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Watch these hotels stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "China reopening, OPEC+ rollover, Foxconn revenue shock - what's moving markets By Investing.com",
		"description": "By Geoffrey Smith Investing.com -- Chinese assets fly as the country's reopening momentum builds. Oil also rises, after OPEC+ leaves production quotas unchanged as Europe's embargo on Russian crude and products comes into force. Stocks are set to open lower, …",
		"url": "https://biztoc.com/x/d4e56acde0819014",
		"urlToImage": "https://c.biztoc.com/p/d4e56acde0819014/og.webp",
		"publishedAt": 1670251805000,
		"content": "By Geoffrey Smith\r\nInvesting.com -- Chinese assets fly as the country's reopening momentum builds. Oil also rises, after OPEC+ leaves production quotas unchanged as Europe's embargo on Russian crude … [+1006 chars]",
		"titleScore": -2,
		"titleMarketGrams": "- what's moving markets \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Reuters",
		"title": "US stocks open lower ahead of services sector data",
		"description": "The Dow Jones Industrial Average fell 94.1 points, or 0.27%, at the open to 34335.73",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-ahead-of-service-data/articleshow/96007951.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-96007986,width-1070,height-580,imgsize-149550,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670251674000,
		"content": "Wall Street's main indexes opened lower on Monday as investors maintained a cautious stance ahead of data, including a report on the US services sector, to gauge the Federal Reserve's next move at it… [+288 chars]",
		"titleScore": 0,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Mangeet Kaur Bouns",
		"title": "3 Travel and Leisure Stocks That Are Worthy Bets Right Now",
		"description": "The growth of the travel and leisure sector is fuelled by increasing per capita disposable income and a rising desire for travel. Given the surge in leisure travel demand, it...",
		"url": "https://stocknews.com/news/plya-trvg-bvh-3-travel-and-leisure-stocks-that-are-worthy-bets-right/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-440412.jpeg",
		"publishedAt": 1670251598000,
		"content": "The growth of the travel and leisure sector is fuelled by increasing per capita disposable income and a rising desire for travel. Given the surge in leisure travel demand, it could be wise to add fun… [+9375 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "Saudi Arabia stocks lower at close of trade; Tadawul All Share down 2.84% By Investing.com",
		"description": "Investing.com – Saudi Arabia stocks were lower after the close on Monday, as losses in the Financial Services, Energy & Utilities and Media & Publishing sectors led shares lower. The best performers of the session on the Tadawul All Share were Etihad Atheeb T…",
		"url": "https://biztoc.com/x/174e87466cf955bc",
		"urlToImage": "https://c.biztoc.com/p/174e87466cf955bc/og.webp",
		"publishedAt": 1670251213000,
		"content": "Investing.com Saudi Arabia stocks were lower after the close on Monday, as losses in the Financial Services, Energy &amp; Utilities and Media &amp; Publishing sectors led shares lower.\r\nThe best perf… [+1078 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Saudi Arabia stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "Morgan Stanley strategists are stock sellers again as tactical rally plays out By Investing.com",
		"description": "By Investing.com Staff Morgan Stanley equity strategists, who have been prescient with their market calls during this bearish stint in the market, highlight that back-end rates fell as predicted which pushed the tactical stock rally higher, also as predicted.…",
		"url": "https://biztoc.com/x/508408ba8b89000f",
		"urlToImage": "https://c.biztoc.com/p/508408ba8b89000f/og.webp",
		"publishedAt": 1670251213000,
		"content": "By Investing.com Staff\r\nMorgan Stanley equity strategists, who have been prescient with their market calls during this bearish stint in the market, highlight that back-end rates fell as predicted whi… [+890 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Stanley strategists are stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Jim Cramer's top 10 things to watch in the market Monday: Stocks, China, Apple",
		"description": "1. Morgan Stanley's Mike Wilson says he has seen enough of the rally, and he says it's time to bail. There's less than 2% upside at the high end of his year-end S&P 500 price target of 4,000 to 4,150. Stay with defensive stocks and utilities. The industrials …",
		"url": "https://biztoc.com/x/2ad82e4ed81f75b9",
		"urlToImage": "https://c.biztoc.com/p/2ad82e4ed81f75b9/og.webp",
		"publishedAt": 1670251207000,
		"content": "1. Morgan Stanley's Mike Wilson says he has seen enough of the rally, and he says it's time to bail. There's less than 2% upside at the high end of his year-end S&amp;P 500 price target of 4,000 to 4… [+908 chars]",
		"titleScore": 2,
		"titleMarketGrams": "watch in the market \n"
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "madams@businessinsider.com (Max Adams)",
		"title": "US stocks drop and bond yields rise as traders await round of new economic data",
		"description": "US stocks fell to start the week. The market is awaiting new economic data points after the surprisingly strong November jobs report on Friday.",
		"url": "https://markets.businessinsider.com/news/stocks/stock-market-news-today-treasury-bond-yields-sp500-nasdaq-dow-2022-12",
		"urlToImage": "https://i.insider.com/638df8492cd2de0018d01d7c?width=1200&format=jpeg",
		"publishedAt": 1670251109000,
		"content": "US stocks dropped Monday, with traders bracing for more data points this week that will hint at the state of the economy following Friday's surprisingly strong November jobs report. \r\nThe addition of… [+1162 chars]",
		"titleScore": -1,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Top Software Stocks to Buy for the Long Haul",
		"description": "Many software stocks got crushed over the past year amid rising interest rates, geopolitical conflicts, and other macroeconomic headwinds. Some of that sell-off was justified since the buying frenzy in growth stocks throughout 2020 and 2021 propelled the valu…",
		"url": "https://biztoc.com/x/ebec881c21bb50e4",
		"urlToImage": "https://c.biztoc.com/p/ebec881c21bb50e4/og.webp",
		"publishedAt": 1670251085000,
		"content": "Many software stocks got crushed over the past year amid rising interest rates, geopolitical conflicts, and other macroeconomic headwinds. Some of that sell-off was justified since the buying frenzy … [+952 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "Apple, Alibaba, Tesla, and More Stock Market Movers Monday",
		"description": "Stock futures traded lower Monday as investors remained keyed on interest rate policy from the Federal Reserve and as a surge in China stocks over a loosening of Covid-19 restrictions in the country failed to boost U.S. equities. Here are some stocks that cou…",
		"url": "https://biztoc.com/x/041d6aa2a1c08afe",
		"urlToImage": "https://c.biztoc.com/p/041d6aa2a1c08afe/og.webp",
		"publishedAt": 1670250966000,
		"content": "Stock futures traded lower Monday as investors remained keyed on interest rate policy from the Federal Reserve and as a surge in China stocks over a loosening of Covid-19 restrictions in the country … [+155 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Isabel Wang",
		"title": "U.S. stocks open lower as yields rise on hopes of China COVID policy relief",
		"description": "U.S. stock indexes opened lower on Monday as China began easing its COVID-19 restrictions in major cities, while investors awaited more economic data ahead of next week's Federal Reserve policy meeting. The S&P 500 fell 0.6%, while the Dow Jones Industrial Av…",
		"url": "https://www.marketwatch.com/story/us-stocks-open-lower-as-yields-rise-on-hopes-of-china-covid-policy-relief-2022-12-05",
		"urlToImage": "https://s.wsj.net/public/resources/MWimages/MW-GP644_MicroS_ZG_20180906154215.jpg",
		"publishedAt": 1670250904000,
		"content": "U.S. stock indexes opened lower on Monday as China began easing its COVID-19 restrictions in major cities, while investors awaited more economic data ahead of next week's Federal Reserve policy meeti… [+753 chars]",
		"titleScore": 3,
		"titleMarketGrams": "U.S. stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "CNBC"
		},
		"author": "Jim Cramer",
		"title": "Jim Cramer's top 10 things to watch in the market Monday: Stocks, China, Apple",
		"description": "Morgan Stanley's Mike Wilson says he has seen enough of the rally.",
		"url": "https://www.cnbc.com/2022/12/05/jim-cramers-top-10-things-to-watch-in-the-market-monday-stocks-china-apple.html",
		"urlToImage": "https://image.cnbcfm.com/api/v1/image/107160401-1669997168538-nys.jpg?v=1670250403&w=1920&h=1080",
		"publishedAt": 1670250403000,
		"content": "1. Morgan Stanley's Mike Wilson says he has seen enough of the rally, and he says it's time to bail. There's less than 2% upside at the high end of his year-end S&amp;P 500 price target of 4,000 to 4… [+905 chars]",
		"titleScore": 2,
		"titleMarketGrams": "watch in the market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "zerohedge.com",
		"title": "Stocks & Bonds Slide After 'Fed Whisperer' Confirms 'Higher For Longer' Rates",
		"description": "After Powell's words sparked panic-buying - and dramatic easing of financial conditions - some are wondering if The Wall Street Journal's Nick Timiraos' report this morning is an attempt tp jawbone back the market's dovish perception. Federal Reserve official…",
		"url": "https://biztoc.com/x/568392d29590f0ee",
		"urlToImage": "https://c.biztoc.com/p/568392d29590f0ee/og.webp",
		"publishedAt": 1670250369000,
		"content": "After Powell's words sparked panic-buying - and dramatic easing of financial conditions - some are wondering if The Wall Street Journal's Nick Timiraos' report this morning is an attempt tp jawbone b… [+945 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "bloomberg.com",
		"title": "Stocks Slip as Yields Rise",
		"description": "Stocks Slip as Yields Rise Bloomberg #stocksslip #yieldsrisebloomberg",
		"url": "https://biztoc.com/x/ef6b8f884efa41b6",
		"urlToImage": "https://c.biztoc.com/73/og.png",
		"publishedAt": 1670250369000,
		"content": "Stocks Slip as Yields Rise Bloomberg \r\n#stocksslip#yieldsrisebloomberg\r\n This story appeared first on bloomberg.com, 2022-12-05.",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "zerohedge.com",
		"title": "US Futures Drop As Chinese Stocks Soar On Reopening Optimism",
		"description": "US Futures Drop As Chinese Stocks Soar On Reopening Optimism US stock futures fell on Monday as investors weighed the outlook for economic growth against the possibility of a softening in the Federal Reserve’s policy, or in other words, whether bad news is ag…",
		"url": "https://biztoc.com/x/c7dbe0f19315daad",
		"urlToImage": "https://c.biztoc.com/p/c7dbe0f19315daad/og.webp",
		"publishedAt": 1670250367000,
		"content": "US Futures Drop As Chinese Stocks Soar On Reopening Optimism\r\nUS stock futures fell on Monday as investors weighed the outlook for economic growth against the possibility of a softening in the Federa… [+948 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Vasily Zyryanov",
		"title": "RHS: A Smart Beta Defensive Play",
		"description": "RHS ETF is essentially an equally-weighted portfolio of the bellwether U.S. consumer staples stocks. Click here to read why we think RHS deserves a Hold rating.",
		"url": "https://seekingalpha.com/article/4562355-rhs-a-smart-beta-defensive-play",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1371687139/image_1371687139.jpg?io=getty-c-w750",
		"publishedAt": 1670250320000,
		"content": "Amax Photo/E+ via Getty Images\r\nInvestors who are searching for a portfolio of better-priced defensive equities have reasons to turn to smart beta funds like the Invesco S&amp;P 500 Equal Weight Cons… [+10184 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Leo Sun)",
		"title": "2 Top Software Stocks to Buy for the Long Haul",
		"description": "Microsoft and IBM stocks could head much higher over the next few years.",
		"url": "https://www.fool.com/investing/2022/12/05/2-top-software-stocks-to-buy-for-the-long-haul/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711728/woman-tablet-window.jpg",
		"publishedAt": 1670250254000,
		"content": "Many software stocks got crushed over the past year amid rising interest rates, geopolitical conflicts, and other macroeconomic headwinds. Some of that sell-off was justified since the buying frenzy … [+3904 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Top Growth Stocks Down 61% and 75% to Buy Before They Rebound",
		"description": "As investors, maintaining a long-term focus is never more important than when the stock market is in decline. High-quality companies are often swept up in broad-based selling, even if their underlying businesses are firing on all cylinders. That's certainly t…",
		"url": "https://biztoc.com/x/b8c2553b080798c3",
		"urlToImage": "https://c.biztoc.com/p/b8c2553b080798c3/og.webp",
		"publishedAt": 1670250248000,
		"content": "As investors, maintaining a long-term focus is never more important than when the stock market is in decline. High-quality companies are often swept up in broad-based selling, even if their underlyin… [+894 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Unstoppable Growth Stocks I'm Buying Before 2022 Ends",
		"description": "The start of December brought news that could indicate growth stocks might turn around before 2022 is up. First, U.S. third-quarter GDP growth came in at 2.9% -- a reversal from the negative growth the U.S. experienced in Q1 and Q2. That means the U.S. may ha…",
		"url": "https://biztoc.com/x/e4279f6e85661966",
		"urlToImage": "https://c.biztoc.com/p/e4279f6e85661966/og.webp",
		"publishedAt": 1670250247000,
		"content": "The start of December brought news that could indicate growth stocks might turn around before 2022 is up. First, U.S. third-quarter GDP growth came in at 2.9% -- a reversal from the negative growth t… [+965 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Kritika Sarmah",
		"title": "3 Smart Stocks to Buy Before Your 50th Birthday",
		"description": "November's job growth was better than expected, even after the Federal Reserve’s aggressive action to cool the economy. Moreover, the sound third-quarter GDP growth and analysts predicting a mild recession...",
		"url": "https://stocknews.com/news/mcd-ci-orly-3-smart-stocks-to-buy-before-your-50th-birthday/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-440411.jpeg",
		"publishedAt": 1670250188000,
		"content": "November's job growth was better than expected, even after the Federal Reserves aggressive action to cool the economy. Moreover, the sound third-quarter GDP growth and analysts predicting a mild rece… [+7428 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Steve Gelsi",
		"title": "Exxon CEO gets 10% base pay raise",
		"description": "Exxon Mobil Corp. said Monday its compensation committee approved an increase in the annual salary for chairman and CEO Darren W. Woods to $1.875 million per year in 2023, up from $1.703 million for 2022. CFO Kathryn A. Mikells will receive an annual base sal…",
		"url": "https://www.marketwatch.com/story/exxon-ceo-gets-10-base-pay-raise-2022-12-05",
		"urlToImage": "https://s.wsj.net/public/resources/MWimages/MW-GP644_MicroS_ZG_20180906154215.jpg",
		"publishedAt": 1670250100000,
		"content": "Exxon Mobil Corp. \r\n XOM,\r\n +0.82%\r\nsaid Monday its compensation committee approved an increase in the annual salary for chairman and CEO Darren W. Woods to $1.875 million per year in 2023, up from $… [+261 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Anthony Di Pizio)",
		"title": "2 Top Growth Stocks Down 61% and 75% to Buy Before They Rebound",
		"description": "There's a disconnect between the strong performance of these two businesses and their languishing stock prices.",
		"url": "https://www.fool.com/investing/2022/12/05/2-top-growth-stocks-down-61-75-buy-before-rebound/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711700/two-people-standing-inside-a-data-center-looking-at-a-laptop-computer.jpg",
		"publishedAt": 1670249700000,
		"content": "As investors, maintaining a long-term focus is never more important than when the stock market is in decline. High-quality companies are often swept up in broad-based selling, even if their underlyin… [+4637 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Futures Drop Ahead Of Economic Data",
		"description": "Dow Jones futures dropped Monday morning ahead of a slug of November economic data, including the PMI composite, the ISM services index and factory orders. China stocks resumed their rebound on a shift in domestic Covid policy. Tesla stock briefly skidded mor…",
		"url": "https://biztoc.com/x/d075861aed8a56c5",
		"urlToImage": "https://c.biztoc.com/p/d075861aed8a56c5/og.webp",
		"publishedAt": 1670249530000,
		"content": "Dow Jones futures dropped Monday morning ahead of a slug of November economic data, including the PMI composite, the ISM services index and factory orders. China stocks resumed their rebound on a shi… [+1007 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Keithen Drury)",
		"title": "2 Unstoppable Growth Stocks I'm Buying Before 2022 Ends",
		"description": "With GDP growth returning and the Federal Reserve potentially slowing the pace of rate hikes, growth stocks are looking good.",
		"url": "https://www.fool.com/investing/2022/12/05/2-unstoppable-growth-stocks-im-buying-before-2022/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/710973/person-looking-at-a-laptop-at-a-desk.jpg",
		"publishedAt": 1670249220000,
		"content": "The start of December brought news that could indicate growth stocks might turn around before 2022 is up. First, U.S. third-quarter GDP growth came in at 2.9% -- a reversal from the negative growth t… [+4117 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Nio, Alibaba, Bilibili among China stocks set for another rally as Covid controls ease",
		"description": "U.S.-listed shares of Chinese internet and electric-vehicle stocks are enjoying a sharp rally yet again in premarket trading Monday amid reports that officials in the country were easing pandemic restrictions. China is easing some of the world’s most stringen…",
		"url": "https://biztoc.com/x/c721302a5268add5",
		"urlToImage": "https://c.biztoc.com/p/c721302a5268add5/og.webp",
		"publishedAt": 1670248684000,
		"content": "U.S.-listed shares of Chinese internet and electric-vehicle stocks are enjoying a sharp rally yet again in premarket trading Monday amid reports that officials in the country were easing pandemic res… [+965 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Bilibili among China stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Metals Stocks: Gold retreats from 4-month high as worries about Friday’s U.S. jobs data limit gains",
		"description": "Gold prices briefly touched a 4-month high on Monday as the U.S. dollar remained near a five month low against major currencies, but worries about hotter-than-expected wage growth reported in Friday’s U.S. November employment report pushed up Treasury yields …",
		"url": "https://biztoc.com/x/4af654559c4fe179",
		"urlToImage": "https://c.biztoc.com/p/4af654559c4fe179/og.webp",
		"publishedAt": 1670248684000,
		"content": "Gold prices briefly touched a 4-month high on Monday as the U.S. dollar remained near a five month low against major currencies, but worries about hotter-than-expected wage growth reported in Fridays… [+933 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Jesse Redmond",
		"title": "How I've Been Betting On SAFE Banking",
		"description": "The prolonged decline in cannabis stocks started with an exaggerated runup following the democratic sweep in the 2020 elections.",
		"url": "https://seekingalpha.com/article/4562348-how-ive-been-betting-safe-banking",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1399322768/image_1399322768.jpg?io=getty-c-w750",
		"publishedAt": 1670248080000,
		"content": "PrathanChorruangsak\r\nOriginally posted on December 4, 2022\r\n I recently watched the movie 21 on Netflix. Inspired by the New York Times best-selling book Bringing Down the House, it tells the story o… [+5341 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Nio, Alibaba, Bilibili among China stocks set for another rally as Covid controls ease",
		"description": "U.S.-listed shares of Chinese internet and electric-vehicle stocks are enjoying a sharp rally yet again in premarket trading Monday amid reports that officials in the country were easing pandemic restrictions. China is easing some of the world’s most stringen…",
		"url": "https://biztoc.com/x/20c02f76e2ef46d7",
		"urlToImage": "https://c.biztoc.com/p/20c02f76e2ef46d7/og.webp",
		"publishedAt": 1670247844000,
		"content": "U.S.-listed shares of Chinese internet and electric-vehicle stocks are enjoying a sharp rally yet again in premarket trading Monday amid reports that officials in the country were easing pandemic res… [+965 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Bilibili among China stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Tesla Falls, XPeng Jumps in China's Key EV Market",
		"description": "Wall Street prepared for a slightly lower open on Monday morning, as investors seemed ready to take a pause after a solid performance last week. Stock market futures were down about half a percent, falling back from gains that had taken the S&P 500 to its bes…",
		"url": "https://biztoc.com/x/1b3e92ce7044c4aa",
		"urlToImage": "https://c.biztoc.com/p/1b3e92ce7044c4aa/og.webp",
		"publishedAt": 1670247726000,
		"content": "Wall Street prepared for a slightly lower open on Monday morning, as investors seemed ready to take a pause after a solid performance last week. Stock market futures were down about half a percent, f… [+923 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "32% of My Retirement Portfolio Is in These 5 Stocks: Here's Why I Believe They're Winners for 2023 and Beyond",
		"description": "Latin American e-commerce giant MercadoLibre (MELI 0.43%), law enforcement technology company Axon Enterprise (AXON 1.77%), shoe maker Crocs (CROX 4.31%), equipment rental provider United Rentals (URI 0.04%), and retail landlord Tanger Factory Outlet Centers …",
		"url": "https://biztoc.com/x/8496556df3644780",
		"urlToImage": "https://c.biztoc.com/p/8496556df3644780/og.webp",
		"publishedAt": 1670247725000,
		"content": "Latin American e-commerce giant MercadoLibre (MELI 0.43%), law enforcement technology company Axon Enterprise (AXON 1.77%), shoe maker Crocs (CROX 4.31%), equipment rental provider United Rentals (UR… [+944 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "benzinga.com",
		"title": "Meta Platforms, This Biotech ETF And These China Plays Are CNBC's 'Final Trades'",
		"description": "The iShares Biotechnology ETF IBB, which includes several large cap biotechs, has recently narrowed its year-to-date loss to around 10%. On CNBC’s “Halftime Report Final Trades,” Jeffrey Mills of Bryn Mawr Trust recommended going long on biotech stocks. Steve…",
		"url": "https://biztoc.com/x/c38c6d3aabb3720e",
		"urlToImage": "https://c.biztoc.com/p/c38c6d3aabb3720e/og.webp",
		"publishedAt": 1670247367000,
		"content": "The iShares Biotechnology ETF IBB, which includes several large cap biotechs, has recently narrowed its year-to-date loss to around 10%.\r\nOn CNBCs Halftime Report Final Trades, Jeffrey Mills of Bryn … [+741 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "ETF Trends"
		},
		"author": "Tom Lydon",
		"title": "Tech Tailwinds Could Reappear for QQQ in 2023 - ETF Trends",
		"description": "The technology sector was a major contributor to the more than decade-long growth-fueled bull market that expired last year. A reversal in accommodative policy is hindering growth stocks this year, weighing on exchange traded funds such as the Invesco QQQ Tru…",
		"url": "https://www.etftrends.com/etf-education-channel/tech-tailwinds-could-reappear-for-qqq-in-2023/",
		"urlToImage": "https://www.etftrends.com/wp-content/uploads/2022/12/Tech-Tailwinds-Could-Reappear-for-QQQ-in-2023.jpg",
		"publishedAt": 1670247196000,
		"content": "The technology sector was a major contributor to the more than decade-long growth-fueled bull market that expired last year. A reversal in accommodative policy is hindering growth stocks this year, w… [+2868 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Jon Quast)",
		"title": "32% of My Retirement Portfolio Is in These 5 Stocks: Here's Why I Believe They're Winners for 2023 and Beyond",
		"description": "My confidence in these companies is high enough to warrant their outsize positions.",
		"url": "https://www.fool.com/investing/2022/12/05/5-stocks-why-theyre-winners-in-2023-and-beyond/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/708229/investor-smiles-largely-with-hand-on-head-while-looking-at-computer.jpg",
		"publishedAt": 1670247000000,
		"content": "Latin American e-commerce giant MercadoLibre(MELI 0.43%), law enforcement technology company Axon Enterprise(AXON 1.77%), shoe maker Crocs(CROX 4.31%), equipment rental provider United Rentals(URI 0.… [+8712 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "PRNewswire"
		},
		"author": null,
		"title": "Thinking about buying stock in Iovance Biotherapeutics, Bilibili, Dada Nexus, Xpeng, or GDS Holdings?",
		"description": "NEW YORK, Dec. 5, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for IOVA, BILI, DADA, XPEV, and GDS. To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by sele…",
		"url": "https://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-iovance-biotherapeutics-bilibili-dada-nexus-xpeng-or-gds-holdings-301694573.html",
		"urlToImage": "https://mma.prnewswire.com/media/1333368/InvestorsObserver_Logo.jpg?p=facebook",
		"publishedAt": 1670247000000,
		"content": "NEW YORK, Dec. 5, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for IOVA, BILI, DADA, XPEV, and GDS.\r\nTo see how InvestorsObserver's proprietary scoring system rates these … [+799 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Thinking about buying stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Ahan Vashi",
		"title": "Pair Trade: Buy Oil (USO), Short Oil Stocks (XLE)",
		"description": "Historically, oil and oil stocks tend to move in lock-step. Learn more about the high-conviction pair trade of buy oil (USO) and short oil stocks (XLE).",
		"url": "https://seekingalpha.com/article/4561954-pair-trade-buy-oil-uso-short-oil-stocks-xle",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1218851416/image_1218851416.jpg?io=getty-c-w750",
		"publishedAt": 1670247000000,
		"content": "MicroStockHub\r\nIntro: A Rare Divergence In Oil Stocks And Oil Prices Is Creating An Investment Opportunity\r\n The XLE ETF (XLE) is a market-cap-weighted, exchange-traded fund that invests primarily in… [+11197 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Morgan Stanley’s Michael Wilson Is a Seller of Stocks Again",
		"description": "(Bloomberg) -- Morgan Stanley strategist Michael Wilson is returning to the bear camp. Most Read from Bloomberg The strategist, one of the US stock market’s most vocal skeptics, has seen enough of the recent rally that he’d predicted and says investors are be…",
		"url": "https://biztoc.com/x/b3d8433c5902d16a",
		"urlToImage": "https://c.biztoc.com/p/b3d8433c5902d16a/og.webp",
		"publishedAt": 1670246767000,
		"content": "(Bloomberg) -- Morgan Stanley strategist Michael Wilson is returning to the bear camp.\r\nMost Read from Bloomberg\r\nThe strategist, one of the US stock markets most vocal skeptics, has seen enough of t… [+1026 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "forbes.com",
		"title": "Chinese Stocks Rally As Beijing Signals Reopening",
		"description": "Topline Chinese and Hong Kong stocks rallied on Monday and the renminbi jumped against the dollar, a positive sign of returning investor confidence amid rising public discontent and ongoing economic turmoil from years of strict lockdown, though experts are no…",
		"url": "https://biztoc.com/x/34a5314a823219cd",
		"urlToImage": "https://c.biztoc.com/p/34a5314a823219cd/og.webp",
		"publishedAt": 1670246285000,
		"content": "Topline\r\nChinese and Hong Kong stocks rallied on Monday and the renminbi jumped against the dollar, a positive sign of returning investor confidence amid rising public discontent and ongoing economic… [+957 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "3 Upgraded Stocks to Add to Your Watchlist This Week",
		"description": "3 Upgraded Stocks to Add to Your Watchlist This Week Fed Chair Jerome Powell recently hinted at a rate-hike slowdown but cautioned that the fight against inflation is far from over. Furthermore, some market experts predict the economy will enter... Fed Chair …",
		"url": "https://biztoc.com/x/f3b674f606c088f2",
		"urlToImage": "https://c.biztoc.com/p/f3b674f606c088f2/og.webp",
		"publishedAt": 1670246182000,
		"content": "3 Upgraded Stocks to Add to Your Watchlist This Week\r\nFed Chair Jerome Powell recently hinted at a rate-hike slowdown but cautioned that the fight against inflation is far from over. Furthermore, som… [+1006 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "U.S.-listed Chinese stocks rally as investors turn bullish on reopening shift",
		"description": "Shares of Chinese companies listed in the U.S. jumped Monday after China loosened more Covid restrictions to accelerate the reopening of the economy. The Invesco Golden Dragon China ETF, which tracks the Nasdaq Golden Dragon China Index, rallied nearly 6% in …",
		"url": "https://biztoc.com/x/60416828d7624ca7",
		"urlToImage": "https://c.biztoc.com/p/60416828d7624ca7/og.webp",
		"publishedAt": 1670246169000,
		"content": "Shares of Chinese companies listed in the U.S. jumped Monday after China loosened more Covid restrictions to accelerate the reopening of the economy.\r\nThe Invesco Golden Dragon China ETF, which track… [+993 chars]",
		"titleScore": 0,
		"titleMarketGrams": "U.S.-listed Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Brian Stewart",
		"title": "4 stocks to watch on Monday: Apple, Tesla and more",
		"description": "Apple (AAPL), Tesla (TSLA), Starbucks (SBUX) and Activision (ATVI) are among the stocks to watch on Monday.",
		"url": "https://seekingalpha.com/news/3913868-4-stocks-to-watch-on-monday-apple-tesla-and-more",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458644979/image_458644979.jpg?io=getty-c-w1280",
		"publishedAt": 1670246079000,
		"content": "Stocks look poised for a dip at the start of Monday's trading as Wall Street begins to look ahead to next week's Federal Reserve meeting. Here are some stocks to watch for Monday:\r\n<ul><li>Apple (NAS… [+1490 chars]",
		"titleScore": 0,
		"titleMarketGrams": "4 stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Why Baidu Soared 41.8% in November",
		"description": "What happened Shares of Chinese search and artificial intelligence (AI) giant Baidu (BIDU 4.72%) roared 41.8% in November, according to data from S&P Global Market Intelligence. Many Chinese stocks had an awfully good November, even as the country erupted in …",
		"url": "https://biztoc.com/x/f30e88c1dd7c0a84",
		"urlToImage": "https://c.biztoc.com/p/f30e88c1dd7c0a84/og.webp",
		"publishedAt": 1670246046000,
		"content": "What happened\r\nShares of Chinese search and artificial intelligence (AI) giant Baidu (BIDU 4.72%) roared 41.8% in November, according to data from S&amp;P Global Market Intelligence.\r\nMany Chinese st… [+916 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Nasdaq Bear Market: 2 Once-In-a-Decade Buying Opportunities for Growth Stock Investors",
		"description": "Warren Buffett once said: \"All there is to investing is picking good stocks at good times and staying with them as long as they remain good companies.\" That advice is especially relevant right now. The Nasdaq Composite has slipped into a bear market, and many…",
		"url": "https://biztoc.com/x/a069a72cc57e9231",
		"urlToImage": "https://c.biztoc.com/p/a069a72cc57e9231/og.webp",
		"publishedAt": 1670246045000,
		"content": "Warren Buffett once said: \"All there is to investing is picking good stocks at good times and staying with them as long as they remain good companies.\" That advice is especially relevant right now. T… [+954 chars]",
		"titleScore": 4,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Slashdot.org"
		},
		"author": "feedfeeder",
		"title": "Stocks making the biggest moves premarket: Silvergate Capital, MGM Resorts, Bilibili, Murphy Oil & more - CNBC",
		"description": "Stocks making the biggest moves premarket: Silvergate Capital, MGM Resorts, Bilibili, Murphy Oil &amp; moreCNBC  Apple, Alibaba, Tesla, and More Stock Market Movers MondayBarron's  Stocks to Watch: Tesla, Delta, Apple, Credit SuisseThe Wall Street Journal   V…",
		"url": "https://slashdot.org/firehose.pl?op=view&amp;id=168647868",
		"urlToImage": null,
		"publishedAt": 1670246041000,
		"content": "The Fine Print: The following comments are owned by whoever posted them. We are not responsible for them in any way.",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Forbes"
		},
		"author": "Robert Hart, Forbes Staff, \n Robert Hart, Forbes Staff\n https://www.forbes.com/sites/roberthart/",
		"title": "Chinese Stocks Rally As Beijing Signals Reopening—But Economists Divided Over Covid Rebound",
		"description": "Investors are increasingly optimistic over China’s anticipated exit from zero-Covid, though others warn the country is poorly placed to manage the wave of infections that is sure to follow.",
		"url": "https://www.forbes.com/sites/roberthart/2022/12/05/chinese-stocks-rally-as-beijing-signals-reopening-but-economists-divided-over-covid-rebound/",
		"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/638dec2a7d03f5f8c955d44f/0x0.jpg?format=jpg&crop=1639,921,x0,y65,safe&width=1200",
		"publishedAt": 1670246026000,
		"content": "Chinese and Hong Kong stocks rallied on Monday and the renminbi jumped against the dollar, a positive sign of returning investor confidence amid rising public discontent and ongoing economic turmoil … [+4086 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Stocks making the biggest moves premarket: Silvergate Capital, MGM Resorts, Bilibili, Murphy Oil & more",
		"description": "Check out the companies making headlines in premarket trading Monday. United Airlines — Shares rose 1% after Morgan Stanley upgraded United Airlines to overweight from equal weight, saying 2023 could be a \"goldilocks\" year for the airline stock. Starbucks — S…",
		"url": "https://biztoc.com/x/35a785fcfe8ab96b",
		"urlToImage": "https://c.biztoc.com/p/35a785fcfe8ab96b/og.webp",
		"publishedAt": 1670245925000,
		"content": "Check out the companies making headlines in premarket trading Monday.\r\nUnited Airlines Shares rose 1% after Morgan Stanley upgraded United Airlines to overweight from equal weight, saying 2023 could … [+970 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Rappler"
		},
		"author": "Reuters",
		"title": "Investors bet China’s rally on easing COVID-19 curbs will be furious but fleeting",
		"description": "Investors have snapped up Chinese tourism, leisure, retailing, and food and beverage stocks",
		"url": "https://www.rappler.com/business/investors-bet-china-rally-easing-covid-19-curbs-furious-but-fleeting/",
		"urlToImage": "https://www.rappler.com/tachyon/2022/12/china-stock-market-august-3-2022-reuters-002.jpg",
		"publishedAt": 1670245800000,
		"content": "Investors piling into China‘s tourism, catering, and beverage stocks as Beijing eases strict COVID-19 curbs are also keeping an eye on the exits, factoring in risks of a surge in infections early nex… [+2903 chars]",
		"titleScore": -3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Emily Bary",
		"title": ": Nio, Alibaba, Bilibili among China stocks set for another rally as Covid controls ease",
		"description": "U.S.-listed shares of Chinese internet stocks are enjoying a sharp rally yet again in premarket trading Monday.",
		"url": "https://www.marketwatch.com/story/nio-alibaba-bilibili-among-china-stocks-set-for-another-rally-as-covid-controls-ease-11670245594",
		"urlToImage": "https://images.mktw.net/im-333090/social",
		"publishedAt": 1670245560000,
		"content": "U.S.-listed shares of Chinese internet and electric-vehicle stocks are enjoying a sharp rally yet again in premarket trading Monday amid reports that officials in the country were easing pandemic res… [+2173 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Bilibili among China stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Billy Duberstein)",
		"title": "Why Baidu Soared 41.8% in November",
		"description": "Baidu's solid earnings came amid a good month for beaten-down Chinese tech stocks.",
		"url": "https://www.fool.com/investing/2022/12/05/why-baidu-soared-418-in-november/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711714/artificial-intelligence-ai-on-cloud-circuit-board.jpg",
		"publishedAt": 1670245500000,
		"content": "What happened\r\nShares of Chinese search and artificial intelligence (AI) giant Baidu(BIDU 4.72%) roared 41.8% in November, according to data from S&amp;P Global Market Intelligence.\r\nMany Chinese sto… [+2968 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Stocks making the biggest moves premarket: Silvergate Capital, MGM Resorts, Bilibili, Murphy Oil & more",
		"description": "Check out the companies making headlines in premarket trading Monday. United Airlines — Shares rose 1% after Morgan Stanley upgraded United Airlines to overweight from equal weight, saying 2023 could be a \"goldilocks\" year for the airline stock. Starbucks — S…",
		"url": "https://biztoc.com/x/93046602560ef069",
		"urlToImage": "https://c.biztoc.com/p/93046602560ef069/og.webp",
		"publishedAt": 1670245326000,
		"content": "Check out the companies making headlines in premarket trading Monday.\r\nUnited Airlines Shares rose 1% after Morgan Stanley upgraded United Airlines to overweight from equal weight, saying 2023 could … [+957 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	}
]