[
	{
		"source": {
			"id": null,
			"name": "CNBC"
		},
		"author": "Carmen Reinicke",
		"title": "Stocks making the biggest moves midday: Textron, Charter, Estee Lauder, Signet and more",
		"description": "These are the stocks posting the largest moves in midday trading.",
		"url": "https://www.cnbc.com/2022/12/06/stocks-making-the-biggest-moves-midday-textron-charter-estee-lauder-signet-and-more.html",
		"urlToImage": "https://image.cnbcfm.com/api/v1/image/106450643-1584562917871gettyimages-984384122.jpeg?v=1670349576&w=1920&h=1080",
		"publishedAt": 1670349576000,
		"content": "Beechcraft King Air turboprop aircraft are seen on the assembly line at the Textron Aviation Inc. production facility in Wichita, Kansas, on Thursday, June 7, 2018.Luke Sharett | Bloomberg | Getty ImagesCheck out the companies making headlines in midday trading.Textron – Shares of Textron jumped 6% after the company won a U.S. Army contract that could be worth $70 billion to provide next-generation helicopters.Charter Communications – Charter Communications fell 5% after analysts at Citi added a negative catalyst watch to the company heading into its analyst day.Paramount -- Shares of media company Paramount slipped 7.5% after the CEO said it projects fourth quarter advertising revenue to be lower than the third quarter. It also weighed on other media names such as Disney, which shed about 2%.Estee Lauder – Estee Lauder's stock added 2% after Deutsche Bank upgraded shares of the cosmetics company to a buy from a hold rating, saying the stock should benefit when China eases Covid-19 restrictions.Signet Jewelers – Shares of Signet Jewelers surged 18% after the company announced earnings results that beat Wall Street's expectations before the market open Tuesday.General Electric – Shares of the industrial giant rose about 1% after Oppenheimer upgraded the stock to outperform from perform. The Wall Street firm said several factors are boosting confidence in the stock next year, including a planned spinoff of its health care division and strong momentum for its aviation business.NRG Energy – Shares of NRG Energy slid more than 13% in midday trading after the company announced it will acquire Vivint Smart Home for $12 per share, or $2.8 billion. NRG said it plans to complete its existing $1 billion share repurchase program over the near term, and expects to use excess free cash flow to fund the Vivint acquisition, reduce acquisition-related debt, and maintain its common stock dividend growth policy.Enphase – Shares of Enphase slid 6% a day after the company reached a new all-time high.Meta Platforms – The Facebook parent company saw shares fall more than 4% after an Oversight Board report found a special-track content review platform for VIPs and businesses promoted an unequal system that offered \"certain users greater protection than others,\" potentially prioritizing Meta business concerns over the protection of safe and fair speech.SVB Financial Group – Shares of SVB Financial slid nearly 4%, reaching a 52-week low earlier in the day. The bank was downgraded on Monday by Morgan Stanley to underweight from equal weight. Morgan Stanley also cut its price target to $186 from $253, implying 11% downside from Monday's close.Autozone – Autozone's stock dropped more than 5% after reporting its inventory increased 17.6% over the same period last year. However, the automotive replacement parts retailer's earnings-per-share and revenue beat Wall Street's expectationsLucid Group – Shares of Lucid Group fell more than 7.8% as investors worry about how higher interest rates and a tighter economy will hit the electric automaker's growth.SL Green Realty – Shares of SL Green Realty slumped 5.4% to a 52-week low after analysts at BMO Harris downgraded the company to market perform from outperform, citing demand uncertainty.Goldman Sachs – Shares of Goldman Sachs slipped 2.27% after a Reuters report said the bank plans to spend tens of millions of dollars on buying or investing in bargain crypto companies after the collapse of FTX hit valuations.Royal Caribbean – The cruise line dropped 4.5% following JPMorgan's double-downgrade to \"underweight\" from \"overweight.\" The firm noted the cruise line was in a less favorable position compared to competitors due to its financial commitments.Axon Enterprises – The Taser maker fell 6.8% after announcing a $500 million convertible notes offering.Herbalife Nutrition – Shares of Herbalife slumped 20% after the company announced a $250 million convertible debt offering, the proceeds of which will be used for general corporate purchases and to buy back existing debt.Semiconductor stocks – Semi stocks Advanced Micro Devices and Nvidia fell 4% and 3.1% respectively amid a broader selloff in the Nasdaq.GitLab – Shares of GitLab rose 5% after the company reported better-than-expected earnings with a smaller loss than Wall Street anticipated. The company also issued a rosy outlook.— CNBC's Yun Li, Alexander Harring, Samantha Subin and Michelle Fox contributed reporting",
		"isFull": true,
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "mchittum@insider.com (Morgan Chittum)",
		"title": "Robinhood is pivoting to retirement accounts as novice traders shun the get-rich-quick appeal of meme stocks",
		"description": "The popular stock-trading service says that it will match 1% of what customers put it into their Roth or traditional IRAs.",
		"url": "https://markets.businessinsider.com/news/stocks/robinhood-retirement-accounts-retail-trading-meme-stocks-slumps-roth-ira-2022-12",
		"urlToImage": "https://i.insider.com/638f5ddb57aefa0018eb9eee?width=1200&format=jpeg",
		"publishedAt": 1670349521000,
		"content": "Robinhood Markets Inc. will soon offer its customers retirement account services, according to a company announcement. The retail trading platform popular with meme-stock enthusiasts launched the wai… [+1866 chars]",
		"titleScore": 0,
		"titleMarketGrams": "appeal of meme stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "City A.M."
		},
		"author": "Jack Barnett",
		"title": "FTSE 100 dragged down by strike sensitive stocks tumbling",
		"description": "London’s FTSE 100 was dragged down today by companies that will likely suffer amid additional rail strikes over Christmas. The capital’s premier index dropped 0.61 per cent to 7,521.39 points, while the domestically-focused mid-cap FTSE 250 index, which is mo…",
		"url": "https://www.cityam.com/ftse-100-dragged-down-by-strike-sensitive-stocks-tumbling/",
		"urlToImage": "https://www.cityam.com/wp-content/uploads/2022/12/GettyImages-1445564871.jpg",
		"publishedAt": 1670349402000,
		"content": "Tuesday 06 December 2022 5:56 pm\r\nThe capitals premier index dropped 0.61 per cent to 7,521.39 points, while the domestically-focused mid-cap FTSE 250 index, which is more aligned with the health of … [+1556 chars]",
		"titleScore": -2,
		"titleMarketGrams": "by strike sensitive stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Why Rivian, Lucid, and Blink Charging Stocks Plunged Today",
		"description": "What happened Technology stocks are leading the market lower Tuesday morning, and names in the electric vehicle (EV) sector are showing some of the largest drops. Shares of Rivian Automotive (RIVN -5.08%), Lucid Group (LCID -8.22%), and Blink Charging (BLNK -…",
		"url": "https://biztoc.com/x/e672ab44e63f0b01",
		"urlToImage": "https://c.biztoc.com/p/e672ab44e63f0b01/og.webp",
		"publishedAt": 1670349364000,
		"content": "What happened\r\nTechnology stocks are leading the market lower Tuesday morning, and names in the electric vehicle (EV) sector are showing some of the largest drops. Shares of Rivian Automotive (RIVN -… [+931 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Jack Denton",
		"title": "JPMorgan Chase Gets a Big Upgrade. It Looks Like a Recession-Proof Bank Stock.",
		"description": "Analysts are nervy about what tight Federal Reserve policy means for bank stocks. State Street and Bank of New York Mellon were both downgraded.",
		"url": "https://www.barrons.com/articles/jpmorgan-chase-upgrade-bank-morgan-stanley-51670348888",
		"urlToImage": "https://images.barrons.com/im-446692/social",
		"publishedAt": 1670348940000,
		"content": "JPMorgan Chase\r\n looks more recession-proof than its peers, analysts at \r\n Morgan Stanley\r\n said Tuesday, double-upgrading the bank stock even as they remained cautious on the sector until the end of… [+3604 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "Stocks Look To Rebound After Market Sell-Off",
		"description": "The Dow Jones Industrial Average fell 150 points Tuesday morning, as the major stock indexes threatened to add to losses from Monday's stock market sell-off. Dow Jones financial giant JPMorgan jumped after being double upgraded ahead of the market open.X Auto…",
		"url": "https://biztoc.com/x/759345397561fb75",
		"urlToImage": "https://c.biztoc.com/p/759345397561fb75/og.webp",
		"publishedAt": 1670348169000,
		"content": "The Dow Jones Industrial Average fell 150 points Tuesday morning, as the major stock indexes threatened to add to losses from Monday's stock market sell-off. Dow Jones financial giant JPMorgan jumped… [+964 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "Markets are wrong in thinking the Fed would step in to boost falling stock prices, and investors should prepare for a volatile January, Bank of America's…",
		"description": "Traders work on the floor of the New York Stock Exchange (NYSE) in New York, U.S., March 9, 2020. Bryan R Smith/Reuters The Fed won't step back from hawkish policy if stocks are crashing, according to BofA's Savita Subramanian. \"The higher the market goes in …",
		"url": "https://biztoc.com/x/2eb22acfdb414137",
		"urlToImage": "https://c.biztoc.com/p/2eb22acfdb414137/og.webp",
		"publishedAt": 1670348168000,
		"content": "Traders work on the floor of the New York Stock Exchange (NYSE) in New York, U.S., March 9, 2020.\r\nBryan R Smith/Reuters\r\nThe Fed won't step back from hawkish policy if stocks are crashing, according… [+1007 chars]",
		"titleScore": -2,
		"titleMarketGrams": "to boost falling stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "Stocks aren't pricing in the potential for a significant slowdown in the economy as the Fed will have to keep pushing interest rates higher, Goldman Sachs says",
		"description": "Federal Reserve Board Chairman Jerome Powell. Yuri Gripas/Reuters The Federal Reserve will hold rates at about 5% for an extended time, Goldman Sachs multi-asset solutions co-CIO, Maria Vassalou, said. Markets haven't fully priced in the potential for a signi…",
		"url": "https://biztoc.com/x/657b461ebcb25ace",
		"urlToImage": "https://c.biztoc.com/p/657b461ebcb25ace/og.webp",
		"publishedAt": 1670348166000,
		"content": "Federal Reserve Board Chairman Jerome Powell.\r\nYuri Gripas/Reuters\r\nThe Federal Reserve will hold rates at about 5% for an extended time, Goldman Sachs multi-asset solutions co-CIO, Maria Vassalou, s… [+1000 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "The 4 Best Holiday Stocks to Buy Before It's Too Late",
		"description": "The 4 Best Holiday Stocks to Buy Before It's Too Late Despite economic uncertainties, retail sales have remained resilient lately. Since the Fed is expected to slow the rate hikes with inflation showing signs of cooling down, holiday sales are expected... Des…",
		"url": "https://biztoc.com/x/f74b35566c92587d",
		"urlToImage": "https://c.biztoc.com/p/f74b35566c92587d/og.webp",
		"publishedAt": 1670347924000,
		"content": "The 4 Best Holiday Stocks to Buy Before It's Too Late\r\nDespite economic uncertainties, retail sales have remained resilient lately. Since the Fed is expected to slow the rate hikes with inflation sho… [+1008 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "How to Invest in Marijuana Stocks",
		"description": "Global marijuana markets are growing like a weed. The value of the worldwide legal cannabis market is projected to increase by a compound annual growth rate of 26.3% and to reach $91.5 billion by 2028, according to Grand View Market Research. With this impres…",
		"url": "https://biztoc.com/x/93be48ecd67d0570",
		"urlToImage": "https://c.biztoc.com/p/93be48ecd67d0570/og.webp",
		"publishedAt": 1670347685000,
		"content": "Global marijuana markets are growing like a weed. The value of the worldwide legal cannabis market is projected to increase by a compound annual growth rate of 26.3% and to reach $91.5 billion by 202… [+968 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "independent",
			"name": "Independent"
		},
		"author": "August Graham",
		"title": "Banks save FTSE from big falls as global stocks drop",
		"description": "Lloyds, Barclays, and NatWest all managed to register small but significant rises on Tuesday.",
		"url": "https://www.independent.co.uk/business/banks-save-ftse-from-big-falls-as-global-stocks-drop-b2240045.html",
		"urlToImage": "https://static.independent.co.uk/2022/12/06/17/405505ea8dfeabdf6d3d49f0d89f100eY29udGVudHNlYXJjaGFwaSwxNjcwNDMyNzcx-2.69063694.jpg?quality=75&width=1200&auto=webp",
		"publishedAt": 1670347551000,
		"content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails\r\nSign up to our free breaking news emails\r\nThe damage caused to the FTSE 100 by falls in the sh… [+2987 chars]",
		"titleScore": 2,
		"titleMarketGrams": "falls as global stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Independent.ie"
		},
		"author": "By August Graham, PA Business Reporter",
		"title": "Banks save FTSE from big falls as global stocks drop",
		"description": "The damage caused to the FTSE 100 by falls in the share prices of the UK&rsquo;s biggest utility companies was offset by the rises in bank shares as a global sell-off continued on Tuesday.",
		"url": "https://www.independent.ie/world-news/banks-save-ftse-from-big-falls-as-global-stocks-drop-42199808.html",
		"urlToImage": "https://www.independent.ie/world-news/93216/42199807.ece/AUTOCROP/w1240h700/ipanews_ee18cd0b-936f-4ea9-8154-a46c64b83989_1",
		"publishedAt": 1670347551000,
		"content": "The damage caused to the FTSE 100 by falls in the share prices of the UKs biggest utility companies was offset by the rises in bank shares as a global sell-off continued on Tuesday.\r\nLloyds, Barclays… [+2838 chars]",
		"titleScore": 2,
		"titleMarketGrams": "falls as global stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Rich Smith)",
		"title": "Why Taiwan Semiconductor Manufacturing Stock Dropped Today",
		"description": "Sometimes, value stocks really are as good as they look.",
		"url": "https://www.fool.com/investing/2022/12/06/why-taiwan-semiconductor-manufacturing-stock-dropp/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711961/1-blue-semiconductor-computer-chip.jpg",
		"publishedAt": 1670347331000,
		"content": "What happened\r\nShares of Taiwan Semiconductor Manufacturing (TSM -2.01%) -- the most valuable semiconductor company in the world -- became just the tiniest bit less valuable on Tuesday, as the stock … [+1882 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "BS Web Team",
		"title": "India emerging as key investment destination amid China's zero-Covid policy",
		"description": "As foreign investors pumped money in stocks in India over the last week, Indian benchmark Indices, the BSE Sensex and NSE Nifty, reached new highs, despite economic chaos at the global level",
		"url": "https://www.business-standard.com/article/economy-policy/india-emerging-as-key-investment-destination-amid-china-s-zero-covid-rule-122120601227_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-02/24/full/1645704199-7903.jpg",
		"publishedAt": 1670346840000,
		"content": "Amid restrictions in view of the Covid-19 pandemic in China, India seems to be emerging as a key investment destination for multinational corporations, according to a Financial Times report. This has… [+1771 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "3 Stocks That Know How to Pack Long-Term Gains",
		"description": "3 Stocks That Know How to Pack Long-Term Gains Despite the pandemic-led supply chain disruptions, the packaging industry’s prospects look bright. Rising consumer purchasing power and technological investments are expected to drive growth. Therefore, packaging…",
		"url": "https://biztoc.com/x/d76b3f638e38e699",
		"urlToImage": "https://c.biztoc.com/p/d76b3f638e38e699/og.webp",
		"publishedAt": 1670345405000,
		"content": "3 Stocks That Know How to Pack Long-Term Gains\r\nDespite the pandemic-led supply chain disruptions, the packaging industrys prospects look bright. Rising consumer purchasing power and technological in… [+987 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Jim Cramer's top 10 things to watch in the market Tuesday: JPMorgan double upgrade, oil prices dip to $75",
		"description": "1. U.S. stock futures point to a mixed open after Monday's sharp selloff. December tends to be seasonally strong, especially late in the month when historically Wall Street looks for the Santa Claus rally. In a commentary, we looked at which Club stocks have …",
		"url": "https://biztoc.com/x/5a79a140533089f7",
		"urlToImage": "https://c.biztoc.com/p/5a79a140533089f7/og.webp",
		"publishedAt": 1670345292000,
		"content": "1. U.S. stock futures point to a mixed open after Monday's sharp selloff. December tends to be seasonally strong, especially late in the month when historically Wall Street looks for the Santa Claus … [+521 chars]",
		"titleScore": 2,
		"titleMarketGrams": "watch in the market \n"
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "prosen@insider.com (Phil Rosen)",
		"title": "Stocks aren't pricing in the potential for a significant slowdown in the economy as the Fed will have to keep pushing interest rates higher, Goldman Sachs says",
		"description": "\"What the market is pricing in, in terms of terminal rate, may actually be way too optimistic,\" Goldman Sachs' Maria Vassalou said Tuesday.",
		"url": "https://www.businessinsider.com/fed-rates-economic-slowdown-goldman-sachs-finance-investing-markets-inflation-2022-12",
		"urlToImage": "https://i.insider.com/638f50be8580f70019f7a248?width=1200&format=jpeg",
		"publishedAt": 1670344940000,
		"content": "Federal Reserve policymakers will have to keep benchmark rates elevated for an extended stretch of time, and markets haven't priced that in, according to Goldman Sachs' multiasset solutions co-CIO, M… [+1502 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "benzinga.com",
		"title": "If You Invested $1,000 In Visa Stock At Its COVID-19 Pandemic Low, Here's How Much You'd Have Now",
		"description": "Investors who bought stocks during the COVID-19 market crash in 2020 have generally experienced some big gains in the past two years. But there is no question some big-name stocks performed better than others since the pandemic bottom. Visa's Bumpy Ride: One …",
		"url": "https://biztoc.com/x/339b006cf405f05c",
		"urlToImage": "https://c.biztoc.com/p/339b006cf405f05c/og.webp",
		"publishedAt": 1670344805000,
		"content": "Investors who bought stocks during the COVID-19 market crash in 2020 have generally experienced some big gains in the past two years. But there is no question some big-name stocks performed better th… [+889 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "zerohedge.com",
		"title": "Dow, S&P Plunge Erases All Post-Powell Gains",
		"description": "Dow, S&P Plunge Erases All Post-Powell Gains All of the US majors are in the red today led by the Nasdaq puking, hurt by Meta's slide... The Dow and the S&P 500 have joined the Russell 2000 in the red, erasing all of the massive gains from the post-Powell 'do…",
		"url": "https://biztoc.com/x/4bcda8ce19d800d3",
		"urlToImage": "https://c.biztoc.com/p/4bcda8ce19d800d3/og.webp",
		"publishedAt": 1670344446000,
		"content": "Dow, S&amp;P Plunge Erases All Post-Powell Gains\r\nAll of the US majors are in the red today led by the Nasdaq puking, hurt by Meta's slide...\r\nThe Dow and the S&amp;P 500 have joined the Russell 2000… [+581 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Why Marijuana Stocks Tanked Today",
		"description": "What happened Bad news for investors in marijuana stocks on Tuesday: According to cannabis reporter Marijuana Moment, the SAFE Banking Act may be in trouble. The new law, which has been under consideration for more than a year now, and which would finally mak…",
		"url": "https://biztoc.com/x/f2e18523c62d3c55",
		"urlToImage": "https://c.biztoc.com/p/f2e18523c62d3c55/og.webp",
		"publishedAt": 1670344324000,
		"content": "What happened\r\nBad news for investors in marijuana stocks on Tuesday: According to cannabis reporter Marijuana Moment, the SAFE Banking Act may be in trouble.\r\nThe new law, which has been under consi… [+988 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "benzinga.com",
		"title": "'3-Legged Stool' Hedge Fund Upped Its Stake In 2 Dividend Stocks - The Next Compounding Machine?",
		"description": "Akre Capital uses an investment strategy called the “three-legged stool” approach, describing what the Middleburg, Virginia-based company looks for in an investment: - Extraordinary business - Talented management - Great reinvestment opportunities and histori…",
		"url": "https://biztoc.com/x/ded52e0b0e07aa15",
		"urlToImage": "https://c.biztoc.com/p/ded52e0b0e07aa15/og.webp",
		"publishedAt": 1670343964000,
		"content": "Akre Capital uses an investment strategy called the three-legged stool approach, describing what the Middleburg, Virginia-based company looks for in an investment:\r\n- Extraordinary business\r\n- Talent… [+989 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Malaika Alphonsus",
		"title": "The 4 Best Holiday Stocks to Buy Before It's Too Late",
		"description": "Despite economic uncertainties, retail sales have remained resilient lately. Since the Fed is expected to slow the rate hikes with inflation showing signs of cooling down, holiday sales are expected...",
		"url": "https://stocknews.com/news/wmt-hsy-dds-mov-the-4-best-holiday-stocks-to-buy-before-its-too/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-440522.jpeg",
		"publishedAt": 1670343683000,
		"content": "Despite economic uncertainties, retail sales have remained resilient lately. Since the Fed is expected to slow the rate hikes with inflation showing signs of cooling down, holiday sales are expected … [+10009 chars]",
		"titleScore": 3,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Metals Stocks: Gold trades just below key $1,800 level as U.S. dollar softens",
		"description": "Gold futures staged a partial rebound Tuesday, but held below $1,800 an ounce, helped by some weakness in the U.S. dollar and Treasury yields after the metal’s losses in the previous session. Price action - Gold prices due in February GC00, +0.30%GCG23, +0.30…",
		"url": "https://biztoc.com/x/f49a2b410ef3acf0",
		"urlToImage": "https://c.biztoc.com/p/f49a2b410ef3acf0/og.webp",
		"publishedAt": 1670343622000,
		"content": "Gold futures staged a partial rebound Tuesday, but held below $1,800 an ounce, helped by some weakness in the U.S. dollar and Treasury yields after the metals losses in the previous session.\r\nPrice a… [+985 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "ValueWalk"
		},
		"author": "Aman Jain",
		"title": "These Are The Five Best And Worst Performing Large-Cap Stocks In November 2022",
		"description": "The S&P 500, which is made up entirely of large-cap U.S. stocks and adequately reflects the U.S. economy, has just managed to come out of the bear market this year so far. In November, the S&P 500 gained 5.4%, a good sign for investors hoping for a recovery i…",
		"url": "https://www.valuewalk.com/best-worst-performing-large-cap-stocks-in-november-2022/",
		"urlToImage": "https://www.valuewalk.com/wp-content/uploads/2022/12/3-simple-things-you-can-do-today-to-improve-your-finances.jpeg",
		"publishedAt": 1670343599000,
		"content": "The S&amp;P 500, which is made up entirely of large-cap U.S. stocks and adequately reflects the U.S. economy, has just managed to come out of the bear market this year so far. In November, the S&amp;… [+6202 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "These 2 Stocks Hit Wall Street's Radar Tuesday",
		"description": "The stock market was trying to bounce back on Tuesday morning from the walloping it took on Monday, but bullish investors seemed hesitant to take a big stand right out of the gate. Shortly after the market opened, most stock market indexes were down slightly,…",
		"url": "https://biztoc.com/x/27f93414ba44327a",
		"urlToImage": "https://c.biztoc.com/p/27f93414ba44327a/og.webp",
		"publishedAt": 1670343485000,
		"content": "The stock market was trying to bounce back on Tuesday morning from the walloping it took on Monday, but bullish investors seemed hesitant to take a big stand right out of the gate. Shortly after the … [+950 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "3 Stocks to Buy Before 2023 That Can Set You Up for Life",
		"description": "Given all the market uncertainty this year and the downward trend of the major indices, it's no surprise that some investors are hesitant to buy right now. Knowing the right time to pull the trigger on a stock purchase (or a sale) is often one of the hardest …",
		"url": "https://biztoc.com/x/045a1c8c09d079c8",
		"urlToImage": "https://c.biztoc.com/p/045a1c8c09d079c8/og.webp",
		"publishedAt": 1670343485000,
		"content": "Given all the market uncertainty this year and the downward trend of the major indices, it's no surprise that some investors are hesitant to buy right now. Knowing the right time to pull the trigger … [+992 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Cheap Growth Stocks to Buy Before 2022 Is Over",
		"description": "After one of the worst markets in many years, investors are hoping for a change in 2023. Although there has been a slight improvement over the past few weeks, the S&P 500 remains down 15% in 2022. Nobody likes to see value erased from their portfolios, but ta…",
		"url": "https://biztoc.com/x/3be275fe6f3efe32",
		"urlToImage": "https://c.biztoc.com/p/3be275fe6f3efe32/og.webp",
		"publishedAt": 1670343484000,
		"content": "After one of the worst markets in many years, investors are hoping for a change in 2023. Although there has been a slight improvement over the past few weeks, the S&amp;P 500 remains down 15% in 2022… [+961 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Rich Smith)",
		"title": "Why Marijuana Stocks Tanked Today",
		"description": "Marijuana legalization is a dance of two steps forward, one step back -- and maybe even two steps back.",
		"url": "https://www.fool.com/investing/2022/12/06/why-marijuana-stocks-tanked-today/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711947/1-red-arrow-going-down-crosses-1-green-arrow-going-up.jpg",
		"publishedAt": 1670343255000,
		"content": "What happened\r\nBad news for investors in marijuana stocks on Tuesday: According to cannabis reporter Marijuana Moment, the SAFE Banking Act may be in trouble.  \r\nThe new law, which has been under con… [+2716 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Anuron Mitra",
		"title": "S&P, Nasdaq, Dow extend previous day's fall as investors stay cautious ahead of Fed meet",
		"description": "U.S. stocks on Tuesday extended their decline from the previous session, as a sense of caution remained among investors a day after stronger than expected economic data indicated...",
		"url": "https://seekingalpha.com/news/3914381-sp500-dow-jones-nasdaq-stock-market-fed-meeting",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/926069614/image_926069614.jpg?io=getty-c-w1280",
		"publishedAt": 1670343227000,
		"content": "lucky-photographer\r\nU.S. stocks on Tuesday extended their decline from the previous session, as a sense of caution remained among investors a day after stronger than expected economic data indicated … [+2251 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Stock market news live updates: Stocks fall after Monday's market rout",
		"description": "U.S. stocks fell Tuesday morning as investors digest new readings on October's trade balance and await results from the Georgia Senate runoff election. The S&P 500 (^GSPC) was down 0.9%, while the Dow Jones Industrial Average (^DJI) edged lower 0.4%. The tech…",
		"url": "https://biztoc.com/x/2a12640f6a9cb39f",
		"urlToImage": "https://c.biztoc.com/p/2a12640f6a9cb39f/og.webp",
		"publishedAt": 1670343005000,
		"content": "U.S. stocks fell Tuesday morning as investors digest new readings on October's trade balance and await results from the Georgia Senate runoff election.\r\nThe S&amp;P 500 (^GSPC) was down 0.9%, while t… [+969 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Stock market \n fall after Monday's market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "forbes.com",
		"title": "Fade The Recent Rally In Stocks",
		"description": "The S&P 500 Index rallied 14.1% from its low of 3,577 on October 12 to last Thursday’s close of 4,080. It has slipped 81 points since then or 2% to 3,999 as of yesterday’s close, which leaves it almost 12% above the October high. As Mike O’Rourke at Jones tra…",
		"url": "https://biztoc.com/x/fa6b7ac2cdffa5eb",
		"urlToImage": "https://c.biztoc.com/p/fa6b7ac2cdffa5eb/og.webp",
		"publishedAt": 1670343005000,
		"content": "The S&amp;P 500 Index rallied 14.1% from its low of 3,577 on October 12 to last Thursdays close of 4,080. It has slipped 81 points since then or 2% to 3,999 as of yesterdays close, which leaves it al… [+980 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Forbes"
		},
		"author": "Chuck Jones, Senior Contributor, \n Chuck Jones, Senior Contributor\n https://www.forbes.com/sites/chuckjones/",
		"title": "Fade The Recent Rally In Stocks",
		"description": "November’s stock market rally seems to be running out of steam.",
		"url": "https://www.forbes.com/sites/chuckjones/2022/12/06/fade-the-recent-rally-in-stocks/",
		"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/617f3e1ee8eac43cd8ecc29a/0x0.jpg?format=jpg&width=1200",
		"publishedAt": 1670342824000,
		"content": "Bull and Bear on stock market prices\r\ngetty\r\nThe S&amp;P 500 Index rallied 14.1% from its low of 3,577 on October 12 to last Thursdays close of 4,080. It has slipped 81 points since then or 2% to 3,9… [+3794 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Why this cruise stock remains JPMorgan’s favorite as leisure travel keeps roaring",
		"description": "The outlook for cruise stocks is still “more positive than not,” according to JPMorgan analyst Daniel Adam, but given macroeconomic and financial concerns in the sector, not all names are worth buying. He assumed coverage of cruise stocks Tuesday, keeping an …",
		"url": "https://biztoc.com/x/24dbb8ab81ebad5d",
		"urlToImage": "https://c.biztoc.com/p/24dbb8ab81ebad5d/og.webp",
		"publishedAt": 1670342765000,
		"content": "The outlook for cruise stocks is still more positive than not, according to JPMorgan analyst Daniel Adam, but given macroeconomic and financial concerns in the sector, not all names are worth buying.… [+948 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Why this cruise stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "Wharton professor Jeremy Siegel says stocks are set for a big rally in 2023 as productivity rises and interest rates fall",
		"description": "Jeremy Siegel Getty Images Jeremy Siegel expects a rising stock market in 2023 as interest rates finally reverse part of their 2022 gains. Additionally, he expects economic productivity to increase as companies get more efficient. \"Productivity is going to go…",
		"url": "https://biztoc.com/x/192b311c19e5d252",
		"urlToImage": "https://c.biztoc.com/p/192b311c19e5d252/og.webp",
		"publishedAt": 1670342289000,
		"content": "Jeremy Siegel\r\nGetty Images\r\nJeremy Siegel expects a rising stock market in 2023 as interest rates finally reverse part of their 2022 gains.\r\nAdditionally, he expects economic productivity to increas… [+956 chars]",
		"titleScore": 3,
		"titleMarketGrams": "Jeremy Siegel says stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Moneycontrol"
		},
		"author": "Sunil Shankar Matkar",
		"title": "Trade setup for Wednesday: Top 15 things to know before the opening bell",
		"description": "Based on the open interest future percentage, a short build-up is seen in 62 stocks, including IRCTC, Colgate Palmolive, Dr Reddy#39;s Laboratories, Tata Chemicals, and Crompton Greaves Consumer Electrical",
		"url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-wednesday-top-15-things-to-know-before-the-opening-bell-15-9661101.html",
		"urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/11/market-data2-770x433.jpg",
		"publishedAt": 1670342124000,
		"content": "The market corrected a third of a percent amid consolidation and a rangebound session on December 6, as traders looked cautious ahead of the Reserve Bank of India Monetary Policy Committee's interest… [+10161 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (David Jagielski)",
		"title": "3 Stocks to Buy Before 2023 That Can Set You Up for Life",
		"description": "These stocks are already good buys right now.",
		"url": "https://www.fool.com/investing/2022/12/06/stocks-to-buy-before-2023-can-set-you-up-fof-life/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711507/a-family-reviewing-financial-results-with-an-advisor.jpg",
		"publishedAt": 1670342032000,
		"content": "Given all the market uncertainty this year and the downward trend of the major indices, it's no surprise that some investors are hesitant to buy right now. Knowing the right time to pull the trigger … [+4749 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "wsj.com",
		"title": "Stocks Fall After Strong Data Raises Rate Fears",
		"description": "U.S. stock indexes declined Tuesday as investors weighed fears about the outlook for interest rates against optimism surrounding China’s reopening. The S&P 500 dropped 0.6%, while the Dow Jones Industrial Average fell 0.3% and the technology-heavy Nasdaq Comp…",
		"url": "https://biztoc.com/x/0e2aae3f9caaefae",
		"urlToImage": "https://c.biztoc.com/p/0e2aae3f9caaefae/og.webp",
		"publishedAt": 1670341928000,
		"content": "U.S. stock indexes declined Tuesday as investors weighed fears about the outlook for interest rates against optimism surrounding Chinas reopening.\r\nThe S&amp;P 500 dropped 0.6%, while the Dow Jones I… [+576 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "PRNewswire"
		},
		"author": null,
		"title": "Thinking about buying stock in Summit Therapeutics, Gossamer Bio, Xpeng, BioNano Genomics, or Canopy Growth Corp?",
		"description": "NEW YORK, Dec. 6, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for SMMT, GOSS, XPEV, BNGO, and CGC. To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by sele…",
		"url": "https://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-summit-therapeutics-gossamer-bio-xpeng-bionano-genomics-or-canopy-growth-corp-301695999.html",
		"urlToImage": "https://mma.prnewswire.com/media/1333368/InvestorsObserver_Logo.jpg?p=facebook",
		"publishedAt": 1670341860000,
		"content": "NEW YORK, Dec. 6, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for SMMT, GOSS, XPEV, BNGO, and CGC.\r\nTo see how InvestorsObserver's proprietary scoring system rates these … [+799 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Thinking about buying stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Dan Caplinger)",
		"title": "These 2 Stocks Hit Wall Street's Radar Tuesday",
		"description": "With markets likely to open flat, good news from these two companies is getting a lot of attention.",
		"url": "https://www.fool.com/investing/2022/12/06/these-2-stocks-hit-wall-streets-radar-tuesday/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711939/radar-screen-getty.jpg",
		"publishedAt": 1670341620000,
		"content": "The stock market was trying to bounce back on Tuesday morning from the walloping it took on Monday, but bullish investors seemed hesitant to take a big stand right out of the gate. Shortly after the … [+3346 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Jennifer Saibil)",
		"title": "2 Cheap Growth Stocks to Buy Before 2022 Is Over",
		"description": "These opportunities may not come back anytime soon.",
		"url": "https://www.fool.com/investing/2022/12/06/2-cheap-growth-stocks-to-buy-before-2022-is-over/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711732/people-putting-together-packages-in-a-warehouse.jpg",
		"publishedAt": 1670341500000,
		"content": "After one of the worst markets in many years, investors are hoping for a change in 2023. Although there has been a slight improvement over the past few weeks, the S&amp;P 500 remains down 15% in 2022… [+4412 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "European markets muted as global sentiment remains subdued; ADP down 13%",
		"description": "European markets were slightly lower on Tuesday, with global sentiment subdued this week. The pan-European Stoxx 600 was down 0.3% by mid-afternoon, with oil and gas stocks shedding 1.4% to lead losses while insurance stocks added 0.5%. The muted trade in Eur…",
		"url": "https://biztoc.com/x/44d8a35466fcd9d8",
		"urlToImage": "https://c.biztoc.com/p/44d8a35466fcd9d8/og.webp",
		"publishedAt": 1670341328000,
		"content": "European markets were slightly lower on Tuesday, with global sentiment subdued this week.\r\nThe pan-European Stoxx 600 was down 0.3% by mid-afternoon, with oil and gas stocks shedding 1.4% to lead los… [+971 chars]",
		"titleScore": 0,
		"titleMarketGrams": "European markets \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "AMD, Nvidia, and 3 More Chip Stocks to Buy That Have ‘Priced In’ the Downturn",
		"description": "Advanced Micro Devices and four other chip stocks are considered buying opportunities by KeyBanc Capital Markets after the semiconductor sector’s big drop in share prices this year. The iShares Semiconductor (ticker: SOXX) exchange-traded fund, which tracks t…",
		"url": "https://biztoc.com/x/a9acde5355f6ec41",
		"urlToImage": "https://c.biztoc.com/p/a9acde5355f6ec41/og.webp",
		"publishedAt": 1670341325000,
		"content": "Advanced Micro Devices and four other chip stocks are considered buying opportunities by KeyBanc Capital Markets after the semiconductor sectors big drop in share prices this year.\r\nThe iShares Semic… [+394 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Seeking Alpha"
		},
		"author": "Ivan Martchev",
		"title": "We Are Reaching A Possible Inflection Point In Both Stocks And Bonds",
		"description": "As Treasury yields have declined by a similar magnitude as to what they did last summer, stocks have rallied by a similar magnitude. Click here to read more.",
		"url": "https://seekingalpha.com/article/4562628-reaching-a-possible-inflection-point-in-both-stocks-and-bonds",
		"urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458530679/image_458530679.jpg?io=getty-c-w750",
		"publishedAt": 1670341260000,
		"content": "DNY59\r\nThe investment strategist, by definition, tries to look beyond the short term to see the intermediate and longer-term trends and be aware of how the investment environment is changing. Twenty … [+3744 chars]",
		"titleScore": 1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "3 Tech Stocks to Buy This Week Without Hesitation",
		"description": "3 Tech Stocks to Buy This Week Without Hesitation Despite the macroeconomic headwinds, the tech industry is well-positioned for long-term growth, thanks to growing dependency on tech products and services, the introduction of advanced technologies, and increa…",
		"url": "https://biztoc.com/x/5c818f6a978982cd",
		"urlToImage": "https://c.biztoc.com/p/5c818f6a978982cd/og.webp",
		"publishedAt": 1670341096000,
		"content": "3 Tech Stocks to Buy This Week Without Hesitation\r\nDespite the macroeconomic headwinds, the tech industry is well-positioned for long-term growth, thanks to growing dependency on tech products and se… [+994 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "Coca-Cola and 3 Other High-Quality Stocks to Buy This December",
		"description": "Coca-Cola and 3 Other High-Quality Stocks to Buy This December Recent positive economic data indicate that the U.S. economy is not cooling despite the Fed’s aggressive monetary policy since March. This could prompt the Fed to continue its supersized rate... R…",
		"url": "https://biztoc.com/x/5eae05c8115f49f8",
		"urlToImage": "https://c.biztoc.com/p/5eae05c8115f49f8/og.webp",
		"publishedAt": 1670341096000,
		"content": "Coca-Cola and 3 Other High-Quality Stocks to Buy This December\r\nRecent positive economic data indicate that the U.S. economy is not cooling despite the Feds aggressive monetary policy since March. Th… [+1006 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "mfox@businessinsider.com (Matthew Fox)",
		"title": "Wharton professor Jeremy Siegel says stocks are set for a big rally in 2023 as productivity rises and interest rates fall",
		"description": "\"Firms are going to be firing people who don't work. Productivity is going to go up, that improves margins and that's good for profits,\" Siegel said.",
		"url": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-jeremy-siegel-2023-gains-interest-rates-fall-2022-12",
		"urlToImage": "https://i.insider.com/638f59688580f70019f7a4b5?width=1200&format=jpeg",
		"publishedAt": 1670340630000,
		"content": "US stocks are poised to reverse at least some of their losses seen in 2022 and rise next year as interest rates fall and economic productivity increases, Jeremy Siegel said in an interview with CNBC … [+2515 chars]",
		"titleScore": 3,
		"titleMarketGrams": "Jeremy Siegel says stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Minneapolis Star Tribune"
		},
		"author": "DAMIAN J. TROISE",
		"title": "US stocks lose ground as markets ponder the Fed's next moves",
		"description": "Stocks fell in morning trading on Wall Street Tuesday as markets ponder the Federal Reserve's next moves on fighting inflation.",
		"url": "https://www.startribune.com/us-stocks-lose-ground-as-markets-ponder-the-feds-next-moves/600233340/",
		"urlToImage": "https://chorus.stimg.co/23342332/merlin_67025154.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
		"publishedAt": 1670340601000,
		"content": "NEW YORK Stocks fell in morning trading on Wall Street Tuesday as markets ponder the Federal Reserve's next moves on fighting inflation.\r\nThe S&amp;P 500 fell 0.9% as of 10:15 a.m. Eastern. The Dow J… [+2374 chars]",
		"titleScore": 0,
		"titleMarketGrams": "US stocks \n lose ground as markets \n"
	},
	{
		"source": {
			"id": null,
			"name": "ActionNewsJax.com"
		},
		"author": "DAMIAN J. TROISE",
		"title": "Stocks open lower as markets ponder the Fed's next moves",
		"description": "Stocks are off to a lower start and Treasury yields are holding steady as markets ponder the Federal Reserve's next moves on fighting inflation",
		"url": "https://www.actionnewsjax.com/news/us-stocks-lose/E6YTRWLK4UHCCMFTKXKK4L6KHQ/",
		"urlToImage": "https://cmg-cmg-tv-10050-prod.cdn.arcpublishing.com/resizer/3zY4bps36xFYNvJleqSYDoxtt50=/1440x810/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/cmg/42QTVBHHBXQN2LGPCINHVQTA7Y.jpg",
		"publishedAt": 1670340326000,
		"content": "NEW YORK — (AP) Stocks fell in morning trading on Wall Street Tuesday as markets ponder the Federal Reserves next moves on fighting inflation.\r\nThe S&amp;P 500 fell 0.9% as of 10:15 a.m. Eastern. The… [+2530 chars]",
		"titleScore": 0,
		"titleMarketGrams": "open lower as markets \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investing.com",
		"title": "U.S. stocks are falling as investors look ahead to Fed meeting By Investing.com",
		"description": "By Liz Moyer Investing.com -- U.S. stocks were trading lower as investors pause before next week’s interest rate decision by the Federal Reserve. At 9:47 ET (14:47 GMT), the Dow Jones Industrial Average was down 74 points or 0.2%, while the S&P 500 was down 0…",
		"url": "https://biztoc.com/x/b6684538a74f2976",
		"urlToImage": "https://c.biztoc.com/p/b6684538a74f2976/og.webp",
		"publishedAt": 1670340258000,
		"content": "By Liz Moyer\r\nInvesting.com -- U.S. stocks were trading lower as investors pause before next weeks interest rate decision by the Federal Reserve.\r\nAt 9:47 ET (14:47 GMT), the Dow Jones Industrial Ave… [+993 chars]",
		"titleScore": -1,
		"titleMarketGrams": "U.S. stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "10 High-Dividend Stocks to Consider, From Target (TGT) to McDonald's (MCD)",
		"description": "If you’re looking to invest money, you may want to consider high-dividend stocks. Dividends are regular distributions that companies dole out to their shareholders. High dividends simply mean that whatever money is returned to shareholders, generally each qua…",
		"url": "https://biztoc.com/x/23e261fd49d6eb37",
		"urlToImage": "https://c.biztoc.com/p/23e261fd49d6eb37/og.webp",
		"publishedAt": 1670340245000,
		"content": "If youre looking to invest money, you may want to consider high-dividend stocks. Dividends are regular distributions that companies dole out to their shareholders. High dividends simply mean that wha… [+958 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Tech Rebound: 1 Growth Stock to Buy, and 1 to Sell",
		"description": "The Nasdaq-100 technology index has jumped by 7.4% over the past 30 days. There have been some early signs that economic pressures are easing, including a gradual decline in inflation, which could spur a resurgence in high-growth stocks into the new year. Des…",
		"url": "https://biztoc.com/x/90a038a01080aab1",
		"urlToImage": "https://c.biztoc.com/p/90a038a01080aab1/og.webp",
		"publishedAt": 1670340125000,
		"content": "The Nasdaq-100 technology index has jumped by 7.4% over the past 30 days. There have been some early signs that economic pressures are easing, including a gradual decline in inflation, which could sp… [+942 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Risky Stocks That Could Soar in 2023",
		"description": "First, let's get one thing out of the way. Investing in small-cap stocks can be very risky. These companies aren't worth much for a reason; most investors don't see them as attractive options. And while the majority isn't always right, it is still worth it to…",
		"url": "https://biztoc.com/x/8081da9bc231855f",
		"urlToImage": "https://c.biztoc.com/p/8081da9bc231855f/og.webp",
		"publishedAt": 1670340125000,
		"content": "First, let's get one thing out of the way. Investing in small-cap stocks can be very risky. These companies aren't worth much for a reason; most investors don't see them as attractive options. And wh… [+953 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Komal Bhattar",
		"title": "3 Stocks That Know How to Pack Long-Term Gains",
		"description": "Despite the pandemic-led supply chain disruptions, the packaging industry’s prospects look bright. Rising consumer purchasing power and technological investments are expected to drive growth. Therefore, packaging stocks Sealed Air Corporation...",
		"url": "https://stocknews.com/news/see-bery-gef-3-stocks-that-know-how-to-pack-long-term-gains/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-440514.jpeg",
		"publishedAt": 1670340042000,
		"content": "Despite the pandemic-led supply chain disruptions, the packaging industrys prospects look bright. Rising consumer purchasing power and technological investments are expected to drive growth. Therefor… [+7422 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Why this cruise stock remains JPMorgan's favorite as leisure travel keeps roaring",
		"description": "The outlook for cruise stocks is still “more positive than not,” according to JPMorgan analyst Daniel Adam, but given macroeconomic and financial concerns in the sector, not all names are worth buying. He assumed coverage of cruise stocks Tuesday, keeping an …",
		"url": "https://biztoc.com/x/8a9ede6462f15afc",
		"urlToImage": "https://c.biztoc.com/p/8a9ede6462f15afc/og.webp",
		"publishedAt": 1670339529000,
		"content": "The outlook for cruise stocks is still more positive than not, according to JPMorgan analyst Daniel Adam, but given macroeconomic and financial concerns in the sector, not all names are worth buying.… [+948 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Why this cruise stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "Stock market news live updates: Stocks flat after Monday's market rout",
		"description": "U.S. stocks were little changed Tuesday morning as Wall Street continued a sluggish start to the week, as investors digest new readings on October's trade balance and await results from the Georgia Senate runoff election. The S&P 500 (^GSPC), the Dow Jones In…",
		"url": "https://biztoc.com/x/e013b6693674e282",
		"urlToImage": "https://c.biztoc.com/p/e013b6693674e282/og.webp",
		"publishedAt": 1670339405000,
		"content": "U.S. stocks were little changed Tuesday morning as Wall Street continued a sluggish start to the week, as investors digest new readings on October's trade balance and await results from the Georgia S… [+960 chars]",
		"titleScore": 0,
		"titleMarketGrams": "Stock market \n flat after Monday's market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Stocks making the biggest moves in the premarket: Herbalife, GitLab, Textron and more",
		"description": "Take a look at some of the biggest movers in the premarket: Herbalife Nutrition (HLF) – Herbalife tumbled 9.8% in premarket trading after the nutrition and health products company announced a $250 million convertible note offering. Herbalife plans to use the …",
		"url": "https://biztoc.com/x/74ddbfbf841e17af",
		"urlToImage": "https://c.biztoc.com/p/74ddbfbf841e17af/og.webp",
		"publishedAt": 1670339293000,
		"content": "Take a look at some of the biggest movers in the premarket:\r\nHerbalife Nutrition (HLF) Herbalife tumbled 9.8% in premarket trading after the nutrition and health products company announced a $250 mil… [+959 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Traders are watching this group of stocks to gauge how much investors really fear a recession",
		"description": "After what happened with bank stocks Monday, investor attention is going to shift to the Goldman Sachs US Financial Services Conference that opens today. The S & P 500 was down 1.8% yesterday but regional bank stocks were among the worst performers: Zions Ban…",
		"url": "https://biztoc.com/x/d299ecdae2458756",
		"urlToImage": "https://c.biztoc.com/p/d299ecdae2458756/og.webp",
		"publishedAt": 1670339292000,
		"content": "After what happened with bank stocks Monday, investor attention is going to shift to the Goldman Sachs US Financial Services Conference that opens today. The S &amp; P 500 was down 1.8% yesterday but… [+960 chars]",
		"titleScore": -4,
		"titleMarketGrams": "this group of stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "These stocks should do even better than the S&P 500 once the Fed pivots to lower interest rates",
		"description": "Investing in the S&P 500 Index SPX, But another category of stocks is quite likely to be an even better performer for a U.S. dollar-based investor. I’m referring to international equities. It’s a good bet that the U.S. dollar’s strength against other currenci…",
		"url": "https://biztoc.com/x/8f47219336e899ba",
		"urlToImage": "https://c.biztoc.com/p/8f47219336e899ba/og.webp",
		"publishedAt": 1670339286000,
		"content": "Investing in the S&amp;P 500 Index\r\nSPX,\r\nBut another category of stocks is quite likely to be an even better performer for a U.S. dollar-based investor.\r\nIm referring to international equities. Its … [+975 chars]",
		"titleScore": 3,
		"titleMarketGrams": "These stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "2 Beaten-Down Stocks to Watch Closely Next Year",
		"description": "Some biotech stocks are positioned to deliver outsized returns in a short period, but those that do generally come with a healthy amount of risk. Consider, for instance, Editas Medicine (EDIT 5.14%) and BioXcel Therapeutics (BTAI 0.59%). These two small-cap b…",
		"url": "https://biztoc.com/x/78955670b1cf9626",
		"urlToImage": "https://c.biztoc.com/p/78955670b1cf9626/og.webp",
		"publishedAt": 1670339285000,
		"content": "Some biotech stocks are positioned to deliver outsized returns in a short period, but those that do generally come with a healthy amount of risk.\r\nConsider, for instance, Editas Medicine (EDIT 5.14%)… [+950 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Prosper Junior Bakiny)",
		"title": "2 Risky Stocks That Could Soar in 2023",
		"description": "These \"exciting\" companies aren't for everyone.",
		"url": "https://www.fool.com/investing/2022/12/06/2-risky-stocks-that-could-soar-in-2023/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711617/patient-sitting-on-hospital-bed.jpg",
		"publishedAt": 1670339220000,
		"content": "First, let's get one thing out of the way. Investing in small-cap stocks can be very risky. These companies aren't worth much for a reason; most investors don't see them as attractive options. And wh… [+4970 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "newsBTC"
		},
		"author": "Reynaldo Marquez",
		"title": "Santa Came Early In Crypto? Bitcoin Rally May Have Passed",
		"description": "Bitcoin saw positive price action recently but failed to follow through and could remain rangebound for December. The cryptocurrency rose from a new yearly low at $15,500, and market participants were expecting further profits, but the market has stalled.  Re…",
		"url": "https://newsbtc.com/news/bitcoin/santa-came-early-in-crypto-bitcoin-rally-may-have-passed/",
		"urlToImage": "https://newsbtc.com/wp-content/uploads/2022/12/traxer-w3taNRpCl9M-unsplash.jpg",
		"publishedAt": 1670339159000,
		"content": "Bitcoin saw positive price action recently but failed to follow through and could remain rangebound for December. The cryptocurrency rose from a new yearly low at $15,500, and market participants wer… [+2538 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Reuters",
		"title": "Foreign inflows in Indian equities jump in Nov as stocks hit new highs",
		"description": "Analysts said that foreign interest in domestic equities would continue due to India's favourable fiscal policies, growth outlook and moderation in inflation.",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-inflows-in-indian-equities-jump-in-nov-as-stocks-hit-new-highs/articleshow/96035367.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-96035502,width-1070,height-580,imgsize-37598,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670338947000,
		"content": "Foreign portfolio investors (FPIs) bought Indian stocks worth 362.38 billion rupees ($4.4 billion) in November, marking the second best month of overseas inflows into equities this year, data from th… [+1764 chars]",
		"titleScore": 0,
		"titleMarketGrams": "in Nov as stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "US stocks trade mixed as resilient economy casts doubt on Fed easing rate hikes",
		"description": "Michael M. Santiago/Getty Images US stocks were mixed on Tuesday as investors cast doubt on the Fed easing rate hikes. The Fed is expected to raise interest rates by 50 basis points next week, rather than its recent 75-basis-point rate hikes. But a strong Nov…",
		"url": "https://biztoc.com/x/526080723083606a",
		"urlToImage": "https://c.biztoc.com/p/526080723083606a/og.webp",
		"publishedAt": 1670338928000,
		"content": "Michael M. Santiago/Getty Images\r\nUS stocks were mixed on Tuesday as investors cast doubt on the Fed easing rate hikes.\r\nThe Fed is expected to raise interest rates by 50 basis points next week, rath… [+995 chars]",
		"titleScore": -1,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Emily Bary",
		"title": "The Ratings Game: Why this cruise stock remains JPMorgan’s favorite as leisure travel keeps roaring",
		"description": "The outlook for cruise stocks is still \"more positive than not,\" according to a JPMorgan analyst, but not all names are worth buying.",
		"url": "https://www.marketwatch.com/story/why-this-cruise-stock-remains-jpmorgans-favorite-as-leisure-travel-keeps-roaring-11670338937",
		"urlToImage": "https://images.mktw.net/im-382363/social",
		"publishedAt": 1670338920000,
		"content": "The outlook for cruise stocks is still more positive than not, according to JPMorgan analyst Daniel Adam, but given macroeconomic and financial concerns in the sector, not all names are worth buying.… [+2569 chars]",
		"titleScore": 2,
		"titleMarketGrams": "Why this cruise stock \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "seekingalpha.com",
		"title": "Wall Street Breakfast December 6: Taiwan Semiconductor Lifts Chip Investment In Arizona (Podcast)",
		"description": "Taiwan Semiconductor (TSM) lifts chip investment in Arizona to $40B. Job cuts at PepsiCo (PEP) and GameStop (GME). NBCU (CMCSA) CEO: Peacock has 18M subs; expecting 'big check' from Disney (DIS) for Hulu. Learn more about these stocks with a free trial of See…",
		"url": "https://biztoc.com/x/1c0ae028b0eda999",
		"urlToImage": "https://c.biztoc.com/p/1c0ae028b0eda999/og.webp",
		"publishedAt": 1670338686000,
		"content": "Taiwan Semiconductor (TSM) lifts chip investment in Arizona to $40B. Job cuts at PepsiCo (PEP) and GameStop (GME). NBCU (CMCSA) CEO: Peacock has 18M subs; expecting 'big check' from Disney (DIS) for … [+830 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "seekingalpha.com",
		"title": "5 Dividend Stocks Set To Soar And 1 You Should Ignore",
		"description": "Summary - The stock market is likely to fall 17% to 29% in the first half of 2023, possibly in the 1st quarter of the year. - A brand new hedge fund promises to be the best way to hedge against market crashes but is too new and stock heavy to recommend now. -…",
		"url": "https://biztoc.com/x/f4fabc938f24a463",
		"urlToImage": "https://c.biztoc.com/p/f4fabc938f24a463/og.webp",
		"publishedAt": 1670338685000,
		"content": "Summary\r\n- The stock market is likely to fall 17% to 29% in the first half of 2023, possibly in the 1st quarter of the year.\r\n- A brand new hedge fund promises to be the best way to hedge against mar… [+1015 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "yahoo.com",
		"title": "‘Stay defensively oriented in healthcare, staples, and utilities stocks’: Morgan Stanley suggests 3 names to buy",
		"description": "Don’t get fooled into thinking the stock market’s recent positive action has legs. Morgan Stanley’s Chief U.S. Equity Strategist Mike Wilson thinks it’s time to take profits “before the Bear returns in earnest.” Wilson notes that his team’s tactical targets h…",
		"url": "https://biztoc.com/x/ad5167cd07b97e07",
		"urlToImage": "https://c.biztoc.com/p/ad5167cd07b97e07/og.webp",
		"publishedAt": 1670338568000,
		"content": "Dont get fooled into thinking the stock markets recent positive action has legs. Morgan Stanleys Chief U.S. Equity Strategist Mike Wilson thinks its time to take profits before the Bear returns in ea… [+947 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Minneapolis Star Tribune"
		},
		"author": "Star Tribune Staff",
		"title": "Stocks open lower as markets ponder the Fed's next moves",
		"description": "Stocks are off to a lower start and Treasury yields are holding steady as markets ponder the Federal Reserve's next moves on fighting inflation. The mixed trading comes a day after stocks pulled back as stronger-than-expected readings on the economy raised wo…",
		"url": "https://www.startribune.com/stocks-open-lower-as-markets-ponder-the-feds-next-moves/600233340/",
		"urlToImage": "https://www.startribune.com/static/img/branding/logos/strib-social-card.png?d=1670286178",
		"publishedAt": 1670338503000,
		"content": "NEW YORK Stocks are off to a lower start and Treasury yields are holding steady as markets ponder the Federal Reserve's next moves on fighting inflation. The mixed trading comes a day after stocks pu… [+4465 chars]",
		"titleScore": 0,
		"titleMarketGrams": "open lower as markets \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "Down 76% This Year, Is This Growth Stock Now a Screaming Buy?",
		"description": "When shares of innovative growth stocks like Ginkgo Bioworks (DNA -0.28%) plummet, cunning investors know that there could be opportunity in the air. So even if a company like Ginkgo is down by more than 76% in 2022, it's a good time to take a closer look. In…",
		"url": "https://biztoc.com/x/1e4f1783d183a382",
		"urlToImage": "https://c.biztoc.com/p/1e4f1783d183a382/og.webp",
		"publishedAt": 1670338445000,
		"content": "When shares of innovative growth stocks like Ginkgo Bioworks (DNA -0.28%) plummet, cunning investors know that there could be opportunity in the air. So even if a company like Ginkgo is down by more … [+896 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "fool.com",
		"title": "My 3 Top-Performing Stocks of 2022, and Why I'm Still Buying 2 of Them for 2023",
		"description": "There's less than a month to go until 2022 is over, and good riddance. As of this writing, the S&P 500 Index is sporting almost a negative 15% return for the year. The Nasdaq Composite index is down nearly 27%. It hasn't been all bad, though. A few stocks in …",
		"url": "https://biztoc.com/x/030284b836ac64fe",
		"urlToImage": "https://c.biztoc.com/p/030284b836ac64fe/og.webp",
		"publishedAt": 1670338444000,
		"content": "There's less than a month to go until 2022 is over, and good riddance. As of this writing, the S&amp;P 500 Index is sporting almost a negative 15% return for the year. The Nasdaq Composite index is d… [+958 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "reuters",
			"name": "Reuters"
		},
		"author": null,
		"title": "Foreign inflows in Indian equities jump in Nov as stocks hit new highs - Reuters.com",
		"description": "Foreign portfolio investors (FPIs) bought Indian stocks worth 362.38 billion rupees ($4.4 billion) in November, marking the second best month of overseas inflows into equities this year, data from the National Securities Depository Ltd showed.",
		"url": "https://www.reuters.com/markets/asia/foreign-inflows-indian-equities-jump-nov-stocks-hit-new-highs-2022-12-06/",
		"urlToImage": "https://www.reuters.com/resizer/-zn8FQsER9rt2JEHg89pTuDg7Ko=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/AGGZLFDJZFKD3HWUSHYMMQYWCM.jpg",
		"publishedAt": 1670338440000,
		"content": "BENGALURU, Dec 6 (Reuters) - Foreign portfolio investors (FPIs) bought Indian stocks worth 362.38 billion rupees ($4.4 billion) in November, marking the second best month of overseas inflows into equ… [+1990 chars]",
		"titleScore": 0,
		"titleMarketGrams": "in Nov as stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Prosper Junior Bakiny)",
		"title": "2 Beaten-Down Stocks to Watch Closely Next Year",
		"description": "These biotechs could skyrocket in 2023, but only if they can execute their plans.",
		"url": "https://www.fool.com/investing/2022/12/06/2-beaten-down-stocks-to-watch-closely-next-year/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711241/pharmacist-talking-to-patient.jpg",
		"publishedAt": 1670338380000,
		"content": "Some biotech stocks are positioned to deliver outsized returns in a short period, but those that do generally come with a healthy amount of risk.\r\nConsider, for instance, Editas Medicine(EDIT 6.05%) … [+5220 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "coindesk.com",
		"title": "Stocks Have Overshot Fundamentals, Crypto Trading Firm QCP Says As Bitcoin Underperforms S&P 500",
		"description": "According to QCP Capital, stocks have overtaken fundamentals and could soon fall back. \"We say this because the two-year Treasury yield, which has been a reliable indicator of the market's direction all year, is, in fact, moving in line with BTC and ETH, whil…",
		"url": "https://biztoc.com/x/a8a4cb515989e02a",
		"urlToImage": "https://c.biztoc.com/p/a8a4cb515989e02a/og.webp",
		"publishedAt": 1670337965000,
		"content": "According to QCP Capital, stocks have overtaken fundamentals and could soon fall back.\r\n\"We say this because the two-year Treasury yield, which has been a reliable indicator of the market's direction… [+961 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "reuters.com",
		"title": "Stocks slide, dollar clings on as data challenges Fed pause hopes",
		"description": "SINGAPORE/LONDON, Dec 6 (Reuters) - Global stocks headed for a third straight day of losses on Tuesday and the dollar held most of its gains from the previous day after U.S. data drove speculation the Federal Reserve will stick longer with aggressive interest…",
		"url": "https://biztoc.com/x/1ba81838b711257b",
		"urlToImage": "https://c.biztoc.com/p/1ba81838b711257b/og.webp",
		"publishedAt": 1670337854000,
		"content": "SINGAPORE/LONDON, Dec 6 (Reuters) - Global stocks headed for a third straight day of losses on Tuesday and the dollar held most of its gains from the previous day after U.S. data drove speculation th… [+981 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Investopedia"
		},
		"author": "Nathan Reiff",
		"title": "The Top (and Bottom) Five Stocks of 2022",
		"description": "Occidental Petroleum, Constellation Energy, Antero Resources, Texas Pacific Land, and Signify Health are the top stocks of the year. The bottom five are Affirm Holdings, AppLovin, Wayfair, Coinbase Global, and Twilio.",
		"url": "https://www.investopedia.com/top-bottom-stocks-2022-6834734",
		"urlToImage": "https://www.investopedia.com/thmb/JxnWeOxvIfEBRJP-HYS5daIDQvI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1358789346-3a60486f697a4ea7beaabb243d47ecb0.jpg",
		"publishedAt": 1670337798000,
		"content": "Occidental Petroleum was the top stock of 2022 in a list loaded with energy firms, while Affirm Holdings led losers a more diverse bottom five.\r\n<ul><li>The market as a whole, as measured by the Russ… [+8674 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "entrepreneur.com",
		"title": "4 Chip Stocks That Are Down and out This December",
		"description": "4 Chip Stocks That Are Down and out This December Macroeconomic headwinds and recently imposed regulations on chip sales have marred the chip and semiconductor industry’s performance. In this backdrop, it could be wise to avoid chip stocks NVIDIA (NVDA),... M…",
		"url": "https://biztoc.com/x/e196ec67f3c86f9e",
		"urlToImage": "https://c.biztoc.com/p/e196ec67f3c86f9e/og.webp",
		"publishedAt": 1670337734000,
		"content": "4 Chip Stocks That Are Down and out This December\r\nMacroeconomic headwinds and recently imposed regulations on chip sales have marred the chip and semiconductor industrys performance. In this backdro… [+985 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "investors.com",
		"title": "8 Stocks You'll Wish You Own When The Recession Hits",
		"description": "Recessions aren't fun to live through. But if you're prepared, they don't have to be painful for your S&P 500 portfolio, either.X Eight stocks in the S&P 500, including information technology plays F5 (FFIV) and Tyler Technologies (TYL) plus consumer discreti…",
		"url": "https://biztoc.com/x/8016b88104feeb25",
		"urlToImage": "https://c.biztoc.com/p/8016b88104feeb25/og.webp",
		"publishedAt": 1670337725000,
		"content": "Recessions aren't fun to live through. But if you're prepared, they don't have to be painful for your S&amp;P 500 portfolio, either.X\r\nEight stocks in the S&amp;P 500, including information technolog… [+1021 chars]",
		"titleScore": -1,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "mfox@businessinsider.com (Matthew Fox)",
		"title": "US stocks trade mixed as resilient economy casts doubt on Fed easing rate hikes",
		"description": "The Federal Reserve Bank of Atlanta's GDPNow forecast sees 2.8% GDP growth in the fourth-quarter, showcasing the resilient growth of the US economy.",
		"url": "https://markets.businessinsider.com/news/stocks/stock-market-news-today-resilient-economy-doubt-fed-rate-hikes-2022-12",
		"urlToImage": "https://i.insider.com/638f4e8657aefa0018eb9b1c?width=1200&format=jpeg",
		"publishedAt": 1670337690000,
		"content": "US stocks were mixed on Tuesday as investors continue to question whether the Federal Reserve's upcoming interest rate hikes will actually ease in the face of resilient economic data.\r\nThe Fed is lar… [+1259 chars]",
		"titleScore": -1,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Motley Fool"
		},
		"author": "newsfeedback@fool.com (Nicholas Rossolillo)",
		"title": "My 3 Top-Performing Stocks of 2022, and Why I'm Still Buying 2 of Them for 2023",
		"description": "It's been an ugly year for many stocks, but not all of them.",
		"url": "https://www.fool.com/investing/2022/12/06/my-3-top-performing-stocks-of-2022-and-why-im-stil/",
		"urlToImage": "https://g.foolcdn.com/editorial/images/711780/electric-vehicles-evs-charging-station-battery-technology_TGjiLAQ.jpg",
		"publishedAt": 1670337420000,
		"content": "There's less than a month to go until 2022 is over, and good riddance. As of this writing, the S&amp;P 500 Index is sporting almost a negative 15% return for the year. The Nasdaq Composite index is d… [+6813 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "Reuters",
		"title": "US stocks edge lower at open after selloff on Fed worries",
		"description": "Focus shifted to Georgia runoff election that could decide the fate of the Senate",
		"url": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-edge-lower-at-open-after-selloff-on-fed-worries/articleshow/96034912.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-96034980,width-1070,height-580,imgsize-60218,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670337361000,
		"content": "US. stock indexes inched lower at open on Tuesday after a selloff in the prior session on fears the Federal Reserve could persist with interest rate hikes for longer, while focus shifted to Georgia r… [+323 chars]",
		"titleScore": -3,
		"titleMarketGrams": "US stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "MarketWatch"
		},
		"author": "Christine Idzelis",
		"title": "U.S. stocks open lower, with Dow down slightly from Monday's slump",
		"description": "U.S. stocks opened slightly lower Tuesday, with the S&P 500 and Nasdaq Composite trading about flat after Monday's sharp selloff. The Dow Jones Industrial Average was down about 0.1% soon after the opening bell, while the S&P 500 slipped about 0.1% and the Na…",
		"url": "https://www.marketwatch.com/story/us-stocks-open-lower-with-dow-down-slightly-from-mondays-slump-2022-12-06",
		"urlToImage": "https://s.wsj.net/public/resources/MWimages/MW-GP644_MicroS_ZG_20180906154215.jpg",
		"publishedAt": 1670337211000,
		"content": "U.S. stocks opened slightly lower Tuesday, with the S&amp;P 500 and Nasdaq Composite trading about flat after Monday's sharp selloff. The Dow Jones Industrial Average \r\n DJIA,\r\n +0.05%\r\nwas down abou… [+501 chars]",
		"titleScore": 0,
		"titleMarketGrams": "U.S. stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "CoinDesk"
		},
		"author": "Omkar Godbole",
		"title": "Bitcoin Underperforms S&P 500 as Stocks Have Overshot Fundamentals, Crypto Trading Firm QCP Says",
		"description": "Stocks have overtaken fundamentals and could soon fall back, QCP said.",
		"url": "https://www.coindesk.com/markets/2022/12/06/stocks-have-overshot-fundamentals-crypto-trading-firm-qcp-says-as-bitcoin-underperforms-sp-500/",
		"urlToImage": "https://www.coindesk.com/resizer/foLCxlN5v0NdBpeZdpdoGFpqDY8=/1200x628/center/middle/cloudfront-us-east-1.images.arcpublishing.com/coindesk/Q756AEECIJAFTL4KCSAM5LLI4A.jpg",
		"publishedAt": 1670337133000,
		"content": "While some expect bitcoin (BTC) to catch up with the recent rally in stocks, Singapore-based crypto options trading firm QCP Capital suggests otherwise.\r\nAccording to QCP Capital, stocks have overtak… [+2556 chars]",
		"titleScore": -2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "forbes.com",
		"title": "FTSE 250 Stocks Round-Up: Tritax Eurobox, SSP Group",
		"description": "FTSE 250 shares Tritax EuroBox and SSP Group have both gained value following fresh trading statements on Tuesday. Here are the key takeaways from their latest updates. Tritax Eurobox Real estate stock Tritax EuroBox has risen 1% to 67.4p per share following …",
		"url": "https://biztoc.com/x/edd48526eb508322",
		"urlToImage": "https://c.biztoc.com/p/edd48526eb508322/og.webp",
		"publishedAt": 1670337125000,
		"content": "FTSE 250 shares Tritax EuroBox and SSP Group have both gained value following fresh trading statements on Tuesday. Here are the key takeaways from their latest updates.\r\nTritax Eurobox\r\nReal estate s… [+966 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Jim Cramer's top 10 things to watch in the market Tuesday: JPMorgan double upgrade, oil prices dip to $75",
		"description": "1. U.S. stock futures point to a mixed open after Monday's sharp selloff. December tends to be seasonally strong, especially late in the month when historically Wall Street looks for the Santa Claus rally. In a commentary, we looked at which Club stocks have …",
		"url": "https://biztoc.com/x/70a39671d481ef3c",
		"urlToImage": "https://c.biztoc.com/p/70a39671d481ef3c/og.webp",
		"publishedAt": 1670336891000,
		"content": "1. U.S. stock futures point to a mixed open after Monday's sharp selloff. December tends to be seasonally strong, especially late in the month when historically Wall Street looks for the Santa Claus … [+521 chars]",
		"titleScore": 2,
		"titleMarketGrams": "watch in the market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "cnbc.com",
		"title": "Op-ed: Investors need to wait it out before snatching up software stocks",
		"description": "A few industries are still likely to take on further losses down the road. Software is one of them. - A de-risking event during the late winter or early spring of 2023 will spark more declines for software firms. That's when investors should think about buyin…",
		"url": "https://biztoc.com/x/a4b7ee3bc7d675bb",
		"urlToImage": "https://c.biztoc.com/p/a4b7ee3bc7d675bb/og.webp",
		"publishedAt": 1670336890000,
		"content": "A few industries are still likely to take on further losses down the road. Software is one of them.\r\n- A de-risking event during the late winter or early spring of 2023 will spark more declines for s… [+986 chars]",
		"titleScore": 0,
		"titleMarketGrams": "snatching up software stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "Forbes"
		},
		"author": "Royston Wild, Contributor, \n Royston Wild, Contributor\n https://www.forbes.com/sites/roystonwild/",
		"title": "FTSE 250 Stocks Round-Up: Tritax Eurobox, SSP Group",
		"description": "Both FTSE 250 companies have risen following the release of full-year trading news.",
		"url": "https://www.forbes.com/sites/roystonwild/2022/12/06/ftse-250-stocks-round-up-tritax-eurobox-ssp-group/",
		"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/638f4fc0340dad466e93c5c5/0x0.jpg?format=jpg&width=1200",
		"publishedAt": 1670336480000,
		"content": "Photographer: Chris Ratcliffe/Bloomberg\r\n© 2016 Bloomberg Finance LP\r\nFTSE 250 shares Tritax EuroBox and SSP Group have both gained value following fresh trading statements on Tuesday. Here are the k… [+3091 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Mangeet Kaur Bouns",
		"title": "3 Tech Stocks to Buy This Week Without Hesitation",
		"description": "Despite the macroeconomic headwinds, the tech industry is well-positioned for long-term growth, thanks to growing dependency on tech products and services, the introduction of advanced technologies, and increasing corporate and...",
		"url": "https://stocknews.com/news/pstg-dbx-ttmi-3-tech-stocks-to-buy-this-week-without-hesitation/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-440505.jpeg",
		"publishedAt": 1670336446000,
		"content": "Despite the macroeconomic headwinds, the tech industry is well-positioned for long-term growth, thanks to growing dependency on tech products and services, the introduction of advanced technologies, … [+8807 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "marketwatch.com",
		"title": "Metals Stocks: Gold trades just below key $1,800 level as U.S. dollar softens",
		"description": "Gold futures were treading water just below the $1,800 per ounce level on Tuesday as precious metals advanced, helped by a modest pullback in the U.S. dollar. Price action - Gold prices due in February GC00, +0.47%GCG23, +0.47%advanced $10.90, or 0.6%, to $1,…",
		"url": "https://biztoc.com/x/c1dcc4788b50d4dc",
		"urlToImage": "https://c.biztoc.com/p/c1dcc4788b50d4dc/og.webp",
		"publishedAt": 1670336165000,
		"content": "Gold futures were treading water just below the $1,800 per ounce level on Tuesday as precious metals advanced, helped by a modest pullback in the U.S. dollar.\r\nPrice action\r\n-\r\nGold prices due in Feb… [+939 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "barrons.com",
		"title": "AMD, Nvidia, and 3 More Chip Stocks to Buy That Have ‘Priced In’ the Downturn",
		"description": "Advanced Micro Devices and four other chip stocks are considered buying opportunities by KeyBanc Capital Markets after the semiconductor sector’s big drop in share prices this year. The iShares Semiconductor (ticker: SOXX) exchange-traded fund, which tracks t…",
		"url": "https://biztoc.com/x/a5a0d20cee6b6a67",
		"urlToImage": "https://c.biztoc.com/p/a5a0d20cee6b6a67/og.webp",
		"publishedAt": 1670336045000,
		"content": "Advanced Micro Devices and four other chip stocks are considered buying opportunities by KeyBanc Capital Markets after the semiconductor sectors big drop in share prices this year.\r\nThe iShares Semic… [+394 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "fortune",
			"name": "Fortune"
		},
		"author": "Mia Taylor",
		"title": "How to invest for income",
		"description": "Income investment options include dividend stocks, bonds, money market funds, and real estate.",
		"url": "https://fortune.com/recommends/article/what-is-income-investing/",
		"urlToImage": "https://content.fortune.com/wp-content/uploads/2022/11/Recommends_what-is-income-investing.jpg?resize=1200,600",
		"publishedAt": 1670336040000,
		"content": "A thoughtfully created investment portfolio can accomplish multiple financial goals. In addition to creating a retirement nest egg, for instance, your investment portfolio can also be used to generat… [+7937 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "StockNews.com"
		},
		"author": "Kritika Sarmah",
		"title": "Coca-Cola and 3 Other High-Quality Stocks to Buy This December",
		"description": "Recent positive economic data indicate that the U.S. economy is not cooling despite the Fed’s aggressive monetary policy since March. This could prompt the Fed to continue its supersized rate...",
		"url": "https://stocknews.com/news/msft-ko-kr-osg-coca-cola-and-3-other-high-quality-stocks-to-buy-this-december/",
		"urlToImage": "https://assets.entrepreneur.com/providers/stocknews/hero-image-stocknews-440504.jpeg",
		"publishedAt": 1670335529000,
		"content": "Recent positive economic data indicate that the U.S. economy is not cooling despite the Feds aggressive monetary policy since March. This could prompt the Fed to continue its supersized rate hikes in… [+11094 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "AP",
		"title": "Robinhood takes on retirement in search for more growth",
		"description": "It’s the first such effort for Robinhood, which is trying to recapture some of the high-flying growth that fell off as painful downturns made day-trading of stocks and cryptocurrencies much less fun.",
		"url": "https://economictimes.indiatimes.com/tech/technology/robinhood-takes-on-retirement-in-search-for-more-growth/articleshow/96034254.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-96034289,width-1070,height-580,imgsize-206090,overlay-ettech/photo.jpg",
		"publishedAt": 1670335225000,
		"content": "Robinhood, the company that blazed onto Wall Street after turning millions of novices into investors by making trading fun, is now setting its sights on a more staid corner of the industry: saving fo… [+3182 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Biztoc.com"
		},
		"author": "businessinsider.com",
		"title": "Expect Chinese stocks to rally hard now that Beijing has set a 'clear path' to reopening, Morgan Stanley says",
		"description": "Beijing started easing its zero-COVID controls earlier this month. Sittirak Jadlit/Shutterstock Morgan Stanley upgraded its outlook for China equities and expects a move toward ending zero-COVID controls to boost stocks. Hong Kong's Hang Seng index could rall…",
		"url": "https://biztoc.com/x/b56a5624c2cb09b8",
		"urlToImage": "https://c.biztoc.com/p/b56a5624c2cb09b8/og.webp",
		"publishedAt": 1670334726000,
		"content": "Beijing started easing its zero-COVID controls earlier this month.\r\nSittirak Jadlit/Shutterstock\r\nMorgan Stanley upgraded its outlook for China equities and expects a move toward ending zero-COVID co… [+982 chars]",
		"titleScore": -1,
		"titleMarketGrams": "Expect Chinese stocks \n"
	},
	{
		"source": {
			"id": null,
			"name": "seattlepi.com"
		},
		"author": null,
		"title": "Robinhood takes on retirement in search for more growth",
		"description": "NEW YORK (AP) - Robinhood, the company that blazed onto Wall Street after turning millions of novices into investors by making trading fun, is now setting its sights on a more staid corner of the industry: saving for retirement. The company on Tuesday is init…",
		"url": "https://www.seattlepi.com/business/article/Robinhood-takes-on-retirement-in-search-for-more-17634297.php",
		"urlToImage": "https://s.hdnux.com/img/modules/siteheader/brand.png",
		"publishedAt": 1670334618000,
		"content": "FILE - Robinhood CEO Vlad Tenev poses for a picture during an interview on July 28, 2021, in New York. After blazing onto Wall Street by making trading fun for its customers, Robinhood is now setting… [+4355 chars]",
		"titleScore": 2,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "Barron's"
		},
		"author": "Tae Kim",
		"title": "AMD, Nvidia, and 3 More Chip Stocks to Buy That Have ‘Priced In’ the Downturn",
		"description": "KeyBanc Capital Markets sees \"clear signs\" of an inventory correction cycle, and think the correction is \"largely priced in.\"",
		"url": "https://www.barrons.com/articles/amd-nvidia-qualcomm-chip-stocks-buy-51670262050",
		"urlToImage": "https://images.barrons.com/im-679072/social",
		"publishedAt": 1670334600000,
		"content": "Advanced Micro Devices and four other chip stocks are considered buying opportunities by KeyBanc Capital Markets after the semiconductor sectors big drop in share prices this year.\r\nThe iShares Semic… [+256 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ET Now",
		"title": "Gautam Duggad on why IT stocks are a must buy in this market",
		"description": "Secondly, many stocks have rallied 20-30% from their respective lows, but they are still 15-20% away from their respective 52-week highs. In the meanwhile, the market has reached a new high. Second, fundamentally IT over the last two decades has handled and n…",
		"url": "https://economictimes.indiatimes.com/markets/expert-view/gautam-duggad-on-why-it-stocks-are-a-must-buy-in-this-market/articleshow/96033815.cms",
		"urlToImage": "https://img.etimg.com/thumb/msid-96033824,width-1070,height-580,imgsize-120662,overlay-etmarkets/photo.jpg",
		"publishedAt": 1670333946000,
		"content": "We have an overweight position on IT for the last three years in our model portfolio. At the margin in the last three quarters, we completely removed midcap stocks because they were trading at a very… [+6456 chars]",
		"titleScore": 0,
		"titleMarketGrams": "on why IT stocks \n buy in this market \n"
	},
	{
		"source": {
			"id": null,
			"name": "Business Standard"
		},
		"author": "AP",
		"title": "World shares lower as strong data hit hopes for dovish Fed amid inflation",
		"description": "World stocks were mostly lower on Tuesday after Wall Street pulled back as surprisingly strong economic reports highlighted the challenges the Federal Reserve faces in battling inflation.\nGermany's DAX lost 0.2% to 14,421.84 and the CAC 40 in Paris also was d…",
		"url": "https://www.business-standard.com/article/international/world-shares-lower-as-strong-data-hit-hopes-for-dovish-fed-amid-inflation-122120600889_1.html",
		"urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-06/19/full/1655645837-9649.jpg",
		"publishedAt": 1670333880000,
		"content": "World stocks were mostly lower on Tuesday after Wall Street pulled back as surprisingly strong economic reports highlighted the challenges the Federal Reserve faces in battling inflation.\r\nGermany's … [+3434 chars]",
		"titleScore": 5,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": "business-insider",
			"name": "Business Insider"
		},
		"author": "gglover@insider.com (George Glover)",
		"title": "Expect Chinese stocks to rally hard now that Beijing has set a 'clear path' to reopening, Morgan Stanley says",
		"description": "Major Chinese cities including Beijing and Shanghai started easing zero-Covid controls earlier this month.",
		"url": "https://markets.businessinsider.com/news/stocks/china-zero-covid-lockdown-reopening-hang-seng-morgan-stanley-analysis-2022-12",
		"urlToImage": "https://i.insider.com/638f34b12cd2de0018d048a1?width=1200&format=jpeg",
		"publishedAt": 1670333762000,
		"content": "China looks like a tempting investing option again with policymakers moving toward an economic reopening, according to Morgan Stanley.\r\nThe easing of zero-COVID controls that started earlier this mon… [+2107 chars]",
		"titleScore": -1,
		"titleMarketGrams": "Expect Chinese stocks \n"
	},
	{
		"source": {
			"id": "the-times-of-india",
			"name": "The Times of India"
		},
		"author": "ETMarkets.com",
		"title": "Market Watch: Investors on sidelines ahead of RBI policy decision",
		"description": "A slew of factors including RBI’s monetary policy outcome tomorrow, a weak Indian rupee and renewed concerns over policy tightening by the Fed pushed Sensex 208 points lower on Tuesday while Nifty ended below the 18,650-mark. Barring PSU banks and FMCG stocks…",
		"url": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/market-watch-investors-on-sidelines-ahead-of-rbi-policy-decision/podcast/96033762.cms",
		"urlToImage": "https://img.etimg.com/photo/96033762.cms",
		"publishedAt": 1670333726000,
		"content": "Welcome to ETMarkets Watch, your daily wrap-up to the day on Dalal Street. I am Nikhil Agarwal.A slew of factors including RBI’s monetary policy outcome tomorrow, a weak Indian rupee and renewed conc… [+1515 chars]",
		"titleScore": 0,
		"titleMarketGrams": ""
	},
	{
		"source": {
			"id": null,
			"name": "PRNewswire"
		},
		"author": null,
		"title": "Thinking about buying stock in COMSovereign, Vivint Smart Home, Tilray, Otonomy, or Vapotherm?",
		"description": "NEW YORK, Dec. 6, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for COMS, VVNT, TLRY, OTIC, and VAPO. To see how InvestorsObserver's proprietary scoring system rates these stocks, view the InvestorsObserver's PriceWatch Alert by sel…",
		"url": "https://www.prnewswire.com/news-releases/thinking-about-buying-stock-in-comsovereign-vivint-smart-home-tilray-otonomy-or-vapotherm-301695807.html",
		"urlToImage": "https://mma.prnewswire.com/media/1333368/InvestorsObserver_Logo.jpg?p=facebook",
		"publishedAt": 1670333520000,
		"content": "NEW YORK, Dec. 6, 2022 /PRNewswire/ -- InvestorsObserver issues critical PriceWatch Alerts for COMS, VVNT, TLRY, OTIC, and VAPO.\r\nTo see how InvestorsObserver's proprietary scoring system rates these… [+800 chars]",
		"titleScore": 1,
		"titleMarketGrams": "Thinking about buying stock \n"
	}
]